cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
<?xml version="1.0" encoding="utf-8"?> 


<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance"
	xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
	<name>LPC43xx</name>
	<version>10</version>
	<description>Register cmsis file for LPC43xx parts</description>
	<cpu>
		<name>CM4</name>
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>0</mpuPresent>
		<fpuPresent>0</fpuPresent>
		<nvicPrioBits>3</nvicPrioBits>
		<vendorSystickConfig>0</vendorSystickConfig>
	</cpu>
	<!-- Bus Interface Properties -->
	<!-- Cortex-M4 is byte addressable -->
	<headerDefinitionsPrefix>LPC_</headerDefinitionsPrefix> 
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<size>32</size>

	<!-- changes:
 v1: from LPC18xxv16
 	creg updated
 	event router updated
 	pmu pd_sleep0_mode settings updated w/o IO switch
 	cgu added base clock 2 (for BASE_PERIPH_CLK)
 	sgpio/spi added
 	cgu/ccu updated
 	gima updated
 v2: AES reset/clock/dma bits removed
     usart osr register added
     
     v5:  ethernet updated
     - pmucon register removed in creg    
     
  v6: sgpio regs updated ctr_status -> clr_status  
      address offset fixed for idivc_ctrl and idivd_ctrl
      registers ppsctrl, auxnanoseconds, auxseconds removed
      register fifolvl removed
      schema v1.1 errors fixed
      
   v7: eeprom registers added
	v8: newly extracted
	event router
	CREG
	PMC 
	v8: c_can clkdiv register bit description corrected.
	-->





  








	<peripherals>
		<peripheral>
			<name>SCT</name>
			<description>State Configurable Timer (SCT) with dither engine </description>
			<groupName>SCT</groupName>
			<baseAddress>0x40000000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SCT</name>
				<value>10</value>

			</interrupt>
			<registers>																
	<register>															
		<name>CONFIG</name>														
		<description>SCT configuration register</description>														
		<addressOffset>0x000</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00007E00</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>UNIFY</name>												
				<description>SCT operation</description>												
				<bitRange>[0:0]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>16_BIT</name>										
						<description>16-bit.The SCT operates as two 16-bit counters named L and H.</description>										
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>32_BIT</name>										
						<description>32-bit. The SCT operates as a unified 32-bit counter.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>CLKMODE</name>												
				<description>SCT clock mode</description>												
				<bitRange>[2:1]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>BUS_CLOCK</name>										
						<description>Bus clock. The bus clock clocks the SCT and prescalers.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>PRESCALED_BUS_CLOCK</name>										
						<description>Prescaled bus clock. The SCT clock is the bus clock, but the prescalers are  enabled to count only when sampling of the input selected by  the CKSEL field finds the selected edge. The minimum pulse  width on the clock input is 1 bus clock period. This mode is the high-performance  sampled-clock mode.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>SCT_INPUT</name>										
						<description>SCT Input. The input selected by  CKSEL clocks the SCT and prescalers. The input is synchronized to the bus clock and possibly inverted.  The minimum pulse width on the clock input is 1 bus clock  period. This mode is the low-power sampled-clock mode.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RESERVED</name>										
						<description>Reserved.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>CKSEL</name>												
				<description>SCT clock select</description>												
				<bitRange>[6:3]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>RISING_EDGES_ON_INPU</name>										
						<description>Rising edges on input 0.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>FALLING_EDGES_ON_INP</name>										
						<description>Falling edges on input 0.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RISING_EDGES_ON_INPU</name>										
						<description>Rising edges on input 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>FALLING_EDGES_ON_INP</name>										
						<description>Falling edges on input 1.</description>										
						<value>0x3</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RISING_EDGES_ON_INPU</name>										
						<description>Rising edges on input 2.</description>										
						<value>0x4</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>FALLING_EDGES_ON_INP</name>										
						<description>Falling edges on input 2.</description>										
						<value>0x5</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RISING_EDGES_ON_INPU</name>										
						<description>Rising edges on input 3.</description>										
						<value>0x6</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>FALLING_EDGES_ON_INP</name>										
						<description>Falling edges on input 3.</description>										
						<value>0x7</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RISING_EDGES_ON_INPU</name>										
						<description>Rising edges on input 4.</description>										
						<value>0x8</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>FALLING_EDGES_ON_INP</name>										
						<description>Falling edges on input 4.</description>										
						<value>0x9</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RISING_EDGES_ON_INPU</name>										
						<description>Rising edges on input 5.</description>										
						<value>0xA</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>FALLING_EDGES_ON_INP</name>										
						<description>Falling edges on input 5.</description>										
						<value>0xB</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RISING_EDGES_ON_INPU</name>										
						<description>Rising edges on input 6.</description>										
						<value>0xC</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>FALLING_EDGES_ON_INP</name>										
						<description>Falling edges on input 6.</description>										
						<value>0xD</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>RISING_EDGES_ON_INPU</name>										
						<description>Rising edges on input 7.</description>										
						<value>0xE</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>FALLING_EDGES_ON_INP</name>										
						<description>Falling edges on input 7.</description>										
						<value>0xF</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>NORELAOD_L</name>												
				<description>A 1 in this bit prevents the lower match and fractional match registers from being  reloaded from their respective reload registers. Software can  write to set or clear this bit at any time. This bit applies to both the  higher and lower registers when the UNIFY bit is set.</description>												
				<bitRange>[7:7]</bitRange>												
											
