cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved</description>												
				<bitRange>[15:13]</bitRange>												
											
			</field>													
			<field>													
				<name>DOWN_H</name>												
				<description>This bit is 1 when the H counter is counting down. Hardware sets this bit   when the counter limit is reached and BIDIR is 1. Hardware clears this bit when the counter reaches 0 or when the counter is counting down and a limit condition occurs.</description>												
				<bitRange>[16:16]</bitRange>												
											
			</field>													
			<field>													
				<name>STOP_H</name>												
				<description>When this bit is 1 and HALT is 0, the H counter does not run but I/O  events related to the counter can occur. If such an event matches  the mask in the Start register, this bit is cleared and counting  resumes.</description>												
				<bitRange>[17:17]</bitRange>												
											
			</field>													
			<field>													
				<name>HALT_H</name>												
				<description>When this bit is 1, the H counter does not run and no events can occur.  A reset sets this bit. When the HALT_H bit is one, the STOP_H bit is cleared. If you want to remove the halt condition and keep the SCT in the stop condition (not running), then you can change the halt and stop condition with one single write to this register. Once set, this bit can only be cleared by software to restore counter operation.</description>												
				<bitRange>[18:18]</bitRange>												
											
			</field>													
			<field>													
				<name>CLRCTR_H</name>												
				<description>Writing a 1 to this bit clears the H counter. This bit always reads as 0.</description>												
				<bitRange>[19:19]</bitRange>												
											
			</field>													
			<field>													
				<name>BIDIR_H</name>												
				<description>Direction select</description>												
				<bitRange>[20:20]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>UP</name>										
						<description>Up. The H counter counts up to its limit condition, then is cleared to zero.</description>									
						<value>0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>UPDOWN</name>										
						<description>Up-down. The H counter counts up to its limit, then counts down to a limit condition or to 0.</description>										
						<value>1</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>PRE_H</name>												
				<description>Specifies the factor by which the SCT clock is prescaled to produce the  H counter clock. The counter clock is clocked at the rate of the SCT  clock divided by PRELH+1. Clear the counter (by writing a 1  to the CLRCTR bit) whenever changing the PRE value.</description>												
				<bitRange>[28:21]</bitRange>												
											
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved</description>												
				<bitRange>[31:29]</bitRange>												
											
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>LIMIT</name>														
		<description>SCT limit register</description>														
		<addressOffset>0x008</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>LIMMSK_L</name>												
				<description>If bit n is one, event n is used as a counter limit event for the L or unified counter (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>												
				<bitRange>[15:0]</bitRange>												
			</field>													
			<field>													
				<name>LIMMSK_H</name>												
				<description>If bit n is one, event n is used as a counter limit event for the H counter (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>												
				<bitRange>[31:16]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>HALT</name>														
		<description>SCT halt condition register</description>														
		<addressOffset>0x00C</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>HALTMSK_L</name>												
				<description>If bit n is one, event n sets the HALT_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>												
				<bitRange>[15:0]</bitRange>												
			</field>													
			<field>													
				<name>HALTMSK_H</name>												
				<description>If bit n is one, event n sets the HALT_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>												
				<bitRange>[31:16]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>STOP</name>														
		<description>SCT stop condition register</description>														
		<addressOffset>0x010</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>STOPMSK_L</name>												
				<description>If bit n is one, event n sets the STOP_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>												
				<bitRange>[15:0]</bitRange>												
			</field>													
			<field>													
				<name>STOPMSK_H</name>												
				<description>If bit n is one, event n sets the STOP_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>												
				<bitRange>[31:16]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>START</name>														
		<description>SCT start condition register</description>														
		<addressOffset>0x014</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>STARTMSK_L</name>												
				<description>If bit n is one, event n clears the STOP_L bit in the CTRL register (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15).</description>												
				<bitRange>[15:0]</bitRange>												
			</field>													
			<field>													
				<name>STARTMSK_H</name>												
				<description>If bit n is one, event n clears the STOP_H bit in the CTRL register (event 0 = bit 16, event 1 = bit 17, event 15 = bit 31).</description>												
				<bitRange>[31:16]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>DITHER</name>														
		<description>SCT dither condition register</description>														
		<addressOffset>0x018</addressOffset>														
		<access>read-write</access>														
		<resetValue>0</resetValue>														
		<resetMask>0x00000000</resetMask>														
		<fields>														
			<field>													
				<name>DITHMSK_L</name>												
				<description>If bit n is one, the event n causes the dither engine to advance to the next element in the dither pattern at the start of the next counter cycle of the 16-bit low counter or the unified counter (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15). If all bits are set to 0, the dither pattern automatically advances at the start of every new counter cycle.</description>												
				<bitRange>[15:0]</bitRange>												
			</field>													
			<field>													
				<name>DITHMSK_H</name>												
				<description>If bit n is one, the event n causes the dither engine to advance to the next element in the dither pattern at the start of the next counter cycle of the 16-bit high counter (event 0 = bit 0, event 1 = bit 1, event 15 = bit 15). If all bits are set to 0, the dither pattern automatically advances at the start of every new counter cycle.</description>												
				<bitRange>[31:16]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>COUNT</name>														
		<description>SCT counter register</description>														
		<addressOffset>0x040</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>CTR_L</name>												
				<description>When UNIFY = 0, read or write the 16-bit L counter value. When UNIFY = 1, read or write the lower 16 bits of the 32-bit unified counter.</description>												
				<bitRange>[15:0]</bitRange>												
			</field>													
			<field>													
				<name>CTR_H</name>												
				<description>When UNIFY = 0, read or write the 16-bit H counter value. When UNIFY = 1, read or write the upper 16 bits of the 32-bit unified counter.</description>												
				<bitRange>[31:16]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>STATE</name>														
		<description>SCT state register</description>														
		<addressOffset>0x044</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>STATE_L</name>												
				<description>State variable.</description>												
				<bitRange>[4:0]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[15:5]</bitRange>												
			</field>													
			<field>													
				<name>STATE_H</name>												
				<description>State variable.</description>												
				<bitRange>[20:16]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[31:21]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>INPUT</name>														
		<description>SCT input register</description>														
		<addressOffset>0x048</addressOffset>														
		<access>read-only</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>AIN0</name>												
				<description>Real-time status of input 0.</description>												
				<bitRange>[0:0]</bitRange>												
			</field>													
			<field>													
				<name>AIN1</name>												
				<description>Real-time status of input 1.</description>												
				<bitRange>[1:1]</bitRange>												
			</field>													
			<field>													
				<name>AIN2</name>												
				<description>Real-time status of input 2.</description>												
				<bitRange>[2:2]</bitRange>												
			</field>													
			<field>													
				<name>AIN3</name>												
				<description>Real-time status of input 3.</description>												
				<bitRange>[3:3]</bitRange>												
			</field>													
			<field>													
				<name>AIN4</name>												
				<description>Real-time status of input 4.</description>												
				<bitRange>[4:4]</bitRange>												
			</field>													
			<field>													
				<name>AIN5</name>												
				<description>Real-time status of input 5.</description>												
				<bitRange>[5:5]</bitRange>												
			</field>													
			<field>													
				<name>AIN6</name>												
				<description>Real-time status of input 6.</description>												
				<bitRange>[6:6]</bitRange>												
			</field>													
			<field>													
				<name>AIN7</name>												
				<description>Real-time status of input 7.</description>												
				<bitRange>[7:7]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved.</description>												
				<bitRange>[15:8]</bitRange>												
			</field>													
			<field>													
				<name>SIN0</name>												
				<description>Input 0 state synchronized to the SCT clock.</description>												
				<bitRange>[16:16]</bitRange>												
			</field>													
			<field>													
				<name>SIN1</name>												
				<description>Input 1 state synchronized to the SCT clock.</description>												
				<bitRange>[17:17]</bitRange>												
			</field>													
			<field>													
				<name>SIN2</name>												
				<description>Input 2 state synchronized to the SCT clock.</description>												
				<bitRange>[18:18]</bitRange>												
			</field>													
			<field>													
				<name>SIN3</name>												
				<description>Input 3 state synchronized to the SCT clock.</description>												
				<bitRange>[19:19]</bitRange>												
			</field>													
			<field>													
				<name>SIN4</name>												
				<description>Input 4 state synchronized to the SCT clock.</description>												
				<bitRange>[20:20]</bitRange>												
			</field>													
			<field>													
				<name>SIN5</name>												
				<description>Input 5 state synchronized to the SCT clock.</description>												
				<bitRange>[21:21]</bitRange>												
			</field>													
			<field>													
				<name>SIN6</name>												
				<description>Input 6 state synchronized to the SCT clock.</description>												
				<bitRange>[22:22]</bitRange>												
			</field>													
			<field>													
				<name>SIN7</name>												
				<description>Input 7 state synchronized to the SCT clock.</description>												
				<bitRange>[23:23]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved</description>												
				<bitRange>[31:24]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>REGMODE</name>														
		<description>SCT match/capture registers mode register</description>														
		<addressOffset>0x04C</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>REGMOD_L</name>												
				<description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 15 = bit 15).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>												
				<bitRange>[15:0]</bitRange>												
			</field>													
			<field>													
				<name>REGMOD_H</name>												
				<description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 15 = bit 31). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>												
				<bitRange>[31:16]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<name>OUTPUT</name>														
		<description>SCT output register</description>														
		<addressOffset>0x050</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>OUT</name>												
				<description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 15 = bit 15).</description>												
				<bitRange>[15:0]</bitRange>												
			</field>													
			<field>													
				<name>RESERVED</name>												
				<description>Reserved</description>												
				<bitRange>[31:16]</bitRange>												
			</field>													
		</fields>														
	</register>															
