cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
	<register>															
		<name>OUTPUTDIRCTRL</name>														
		<description>SCT output counter direction control register</description>														
		<addressOffset>0x054</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>SETCLR0</name>												
				<description>Set/clear operation on output 0. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[1:0]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR1</name>												
				<description>Set/clear operation on output 1. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[3:2]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR2</name>												
				<description>Set/clear operation on output 2. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[5:4]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR3</name>												
				<description>Set/clear operation on output 3. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[7:6]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR4</name>												
				<description>Set/clear operation on output 4. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[9:8]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR5</name>												
				<description>Set/clear operation on output 5. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[11:10]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR6</name>												
				<description>Set/clear operation on output 6. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[13:12]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR7</name>												
				<description>Set/clear operation on output 7. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[15:14]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR8</name>												
				<description>Set/clear operation on output 8. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[17:16]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR9</name>												
				<description>Set/clear operation on output 9. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[19:18]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR10</name>												
				<description>Set/clear operation on output 5. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[21:20]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR11</name>												
				<description>Set/clear operation on output 11. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[23:22]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR12</name>												
				<description>Set/clear operation on output 12. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[25:24]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR13</name>												
				<description>Set/clear operation on output 13. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[27:26]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR14</name>												
				<description>Set/clear operation on output 14. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[29:28]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
			<field>													
				<name>SETCLR15</name>												
				<description>Set/clear operation on output 15. Value 0x3 is reserved. Do not program this value.</description>												
				<bitRange>[31:30]</bitRange>												
				<enumeratedValues>												
				<name>ENUM</name>												
					<enumeratedValue>											
						<name>INDEPENDENT</name>										
						<description>Independent. Set and clear do not depend on any counter.</description>										
						<value>0x0</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>L_COUNTER</name>										
						<description>L counter. Set and clear are reversed when counter L or the unified counter is counting down.</description>										
						<value>0x1</value>										
					</enumeratedValue>											
					<enumeratedValue>											
						<name>H_COUNTER</name>										
						<description>H counter. Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>										
						<value>0x2</value>										
					</enumeratedValue>											
				</enumeratedValues>												
			</field>													
		</fields>														
	</register>															
