cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
	<register>															
		<dim>16</dim>														
		<dimIncrement>0x8</dimIncrement>														
		<dimIndex>0-15</dimIndex>														
		<name>EV%s_STATE</name>														
		<description>SCT event state register 0</description>														
		<addressOffset>0x300</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>STATEMSK0</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[0:0]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK1</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[1:1]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK2</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[2:2]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK3</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[3:3]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK4</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[4:4]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK5</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[5:5]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK6</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[6:6]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK7</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[7:7]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK8</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[8:8]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK9</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[9:9]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK10</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[10:10]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK11</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[11:11]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK12</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[12:12]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK13</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[13:13]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK14</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[14:14]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK15</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[15:15]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK16</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[16:16]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK17</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[17:17]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK18</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[18:18]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK19</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[19:19]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK20</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[20:20]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK21</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[21:21]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK22</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[22:22]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK23</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[23:23]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK24</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[24:24]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK25</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[25:25]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK26</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[26:26]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK27</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[27:27]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK28</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[28:28]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK29</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[29:29]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK30</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[30:30]</bitRange>												
			</field>													
			<field>													
				<name>STATEMSK31</name>												
				<description>If bit m is one, event n (n= 0 to 15) happens in state m of the counter selected by the HEVENT bit (m = state number; state 0 = bit 0, state 1= bit 1,..., state 31 = bit 31).</description>												
				<bitRange>[31:31]</bitRange>												
			</field>													
		</fields>														
	</register>															
	<register>															
		<dim>16</dim>														
		<dimIncrement>0x8</dimIncrement>														
		<dimIndex>0-15</dimIndex>														
		<name>EV%s_CTRL</name>														
		<description>SCT event control register 0</description>														
		<addressOffset>0x304</addressOffset>														
		<access>read-write</access>														
		<resetValue>0x00000000</resetValue>														
		<resetMask>0xFFFFFFFF</resetMask>														
		<fields>														
			<field>													
				<name>MATCHSEL</name>												
				<description>Selects the Match register associated with this event (if any). A  match can occur only when the counter selected by the HEVENT  bit is running.</description>												
				<bitRange>[3:0]</bitRange>												
											
