cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
						</field>
						<field>
							<name>ITC</name>
							<description>Terminal count interrupt mask. When cleared, this bit masks out the terminal count interrupt of the relevant channel.</description>
							<bitRange>[15:15]</bitRange>
							
						</field>
						<field>
							<name>L</name>
							<description>Lock. When set, this bit enables locked transfers.</description>
							<bitRange>[16:16]</bitRange>
							
						</field>
						<field>
							<name>A</name>
							<description>Active: 0 = there is no data in the FIFO of the channel. 1 = the channel FIFO has data. This value can be used with the Halt and Channel Enable bits to cleanly disable a DMA channel. This is a read-only bit.</description>
							<bitRange>[17:17]</bitRange>
							
						</field>
						<field>
							<name>H</name>
							<description>Halt: 0 = enable DMA requests. 1 = ignore further source DMA requests. The contents of the channel FIFO are drained. This value can be used with the Active and Channel Enable bits to cleanly disable a DMA channel.</description>
							<bitRange>[18:18]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>ENABLE_DMA_REQUESTS_</name>
									<description>Enable DMA requests.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>IGNORE_FURTHER_SOURC</name>
									<description>Ignore further source DMA requests.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved, do not modify, masked on read.</description>
							<bitRange>[31:19]</bitRange>
							
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		
		<peripheral>
	<name>SPIFI</name>
	<description>SPI Flash Interface (SPIFI)</description>
	<groupName>SPIFI</groupName>
	<baseAddress>0x40003000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>SPIFI</name>
	<value>30</value>
	</interrupt>
	<registers>
		<register>
			<name>CTRL</name>
			<description>SPIFI control register</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x400FFFFF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TIMEOUT</name>
					<description>This field contains the number of serial clock periods without the processor reading data in memory mode, which will cause the SPIFI hardware to terminate the command by driving the CS pin high and negating the CMD bit in the Status register. (This allows the flash memory to enter a lower-power state.) If the processor reads data from the flash region after a time-out, the command in the Memory Command Register is issued again.</description>
					<bitRange>[15:0]</bitRange>

				</field>
				<field>
					<name>CSHIGH</name>
					<description>This field controls the minimum CS high time, expressed as a number of serial clock periods minus one.</description>
					<bitRange>[19:16]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[20:20]</bitRange>

				</field>
				<field>
					<name>D_PRFTCH_DIS</name>
					<description>This bit allows conditioning of memory mode prefetches based on the AHB HPROT (instruction/data) access information. A 1 in this register means that the SPIFI will not attempt a speculative prefetch when it encounters data accesses.</description>
					<bitRange>[21:21]</bitRange>

				</field>
				<field>
					<name>INTEN</name>
					<description>If this bit is 1 when a command ends, the SPIFI will assert its interrupt request output. See INTRQ in the status register for further details.</description>
					<bitRange>[22:22]</bitRange>

				</field>
				<field>
					<name>MODE3</name>
					<description>SPI Mode 3 select.</description>
					<bitRange>[23:23]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SCK_LOW</name>
							<description>SCK LOW. The SPIFI drives SCK low after the rising edge at which the last bit of each command is captured, and keeps it low while CS is HIGH.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SCK_HIGH</name>
							<description>SCK HIGH. the SPIFI keeps SCK high after the rising edge for the last bit of each command and while CS is HIGH, and drives it low after it drives  CS LOW. (Known serial flash devices can handle either mode, but some devices may require a particular mode for proper operation.)  MODE3, RFCLK, and FBCLK should not all be 1, because in this case there is no final rising edge on SCK on which to sample the last data bit of the frame.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved.</description>
					<bitRange>[26:24]</bitRange>

				</field>
				<field>
					<name>PRFTCH_DIS</name>
					<description>Cache prefetching enable. The SPIFI includes an internal cache. A 1 in this bit disables prefetching of cache lines.</description>
					<bitRange>[27:27]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ENABLE</name>
							<description>Enable. Cache prefetching enabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DISABLE</name>
							<description>Disable. Disables prefetching of cache lines.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DUAL</name>
					<description>Select dual protocol.</description>
					<bitRange>[28:28]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>QUAD_PROTOCOL</name>
							<description>Quad protocol. This protocol uses IO3:0.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DUAL_PROTOCOL</name>
							<description>Dual protocol. This protocol uses IO1:0.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RFCLK</name>
					<description>Select active clock edge for input data.</description>
					<bitRange>[29:29]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RISING_EDGE</name>
							<description>Rising edge. Read data is sampled on rising edges on the clock, as in classic SPI operation.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGE</name>
							<description>Falling edge. Read data is sampled on falling edges of the clock, allowing a full serial clock of of time in order to maximize the serial clock frequency. MODE3, RFCLK, and FBCLK should not all be 1, because in this case there is no final rising edge on SCK on which to sample the last data bit of the frame.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FBCLK</name>
					<description>Feedback clock select.</description>
					<bitRange>[30:30]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>INTERNAL_CLOCK</name>
							<description>Internal clock. The SPIFI samples read data using an internal clock.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FEEDBACK_CLOCK</name>
							<description>Feedback clock. Read data is sampled using a feedback clock from the SCK pin. This allows slightly more time for each received bit.  MODE3, RFCLK, and FBCLK should not all be 1, because in this case there is no final rising edge on SCK on which to sample the last data bit of the frame.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>DMAEN</name>
					<description>A 1 in this bit enables the DMA Request output from the SPIFI. Set this bit only when a DMA channel is used to transfer data in peripheral mode. Do not set this bit when a DMA channel is used for memory-to-memory transfers from the SPIFI memory area. DRQEN should only be used in Command mode.</description>
					<bitRange>[31:31]</bitRange>

