cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
				</field>
				<field>
					<name>POLL</name>
					<description>This bit should be written as 0.</description>
					<bitRange>[14:14]</bitRange>

				</field>
				<field>
					<name>DOUT</name>
					<description>This bit should be written as 0.</description>
					<bitRange>[15:15]</bitRange>

				</field>
				<field>
					<name>INTLEN</name>
					<description>This field controls how many intermediate bytes precede the data. (Each such byte may require 8 or 2 SCK cycles, depending on whether the intermediate field is in serial, 2-bit, or 4-bit format.) Intermediate bytes are output by the SPIFI, and include post-address control information, dummy and delay bytes. See the description of the Intermediate Data register for the contents of such bytes.</description>
					<bitRange>[18:16]</bitRange>

				</field>
				<field>
					<name>FIELDFORM</name>
					<description>This field controls how the fields of the command are sent.</description>
					<bitRange>[20:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ALL_SERIAL</name>
							<description>All serial. All fields of the command are serial.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>QUADDUAL_DATA</name>
							<description>Quad/dual data. Data field is quad/dual, other fields are serial.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SERIAL_OPCODE</name>
							<description>Serial opcode. Opcode field is serial. Other fields are quad/dual.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ALL_QUADDUAL</name>
							<description>All quad/dual. All fields of the command are in quad/dual format.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>FRAMEFORM</name>
					<description>This field controls the opcode and address fields.</description>
					<bitRange>[23:21]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPCODE_ONE_BYTE</name>
							<description>Opcode one byte. Opcode, least-significant byte of address.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPCODE_TWO_BYTES</name>
							<description>Opcode two bytes. Opcode, 2 least-significant bytes of address.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPCODE_THREE_BYTES</name>
							<description>Opcode three bytes. Opcode, 3 least-significant bytes of address.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>OPCODE_FOUR_BYTES</name>
							<description>Opcode four bytes. Opcode, 4 bytes of address.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>NO_OPCODE_THREE_BYTE</name>
							<description>No opcode three bytes. No opcode, 3 least-significant bytes of address.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>NO_OPCODE_FOUR_BYTES</name>
							<description>No opcode, 4 bytes of address.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>OPCODE</name>
					<description>The opcode of the command (not used for some FRAMEFORM values).</description>
					<bitRange>[31:24]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>STAT</name>
			<description>SPIFI status register</description>
			<addressOffset>0x01C</addressOffset>
			<access>read-write</access>
			<resetValue>0x02000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MCINIT</name>
					<description>This bit is set when software successfully writes the Memory Command register, and is cleared by Reset or by writing a 1 to the RESET bit in this register.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>CMD</name>
					<description>This bit is 1 when the Command register is written. It is cleared by a hardware reset, a write to the RESET bit in this register, or the deassertion of CS which indicates that the command has completed communication with the SPI Flash.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RESET</name>
					<description>Write a 1 to this bit to abort a current command or memory mode. This bit is cleared when the hardware is ready for a new command to be written to the Command register.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>INTRQ</name>
					<description>This bit reflects the SPIFI interrupt request. Write a 1 to this bit to clear it. This bit is set when a CMD was previously 1 and has been cleared due to the deassertion of CS.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[23:6]</bitRange>
				</field>
				<field>
					<name>VERSION</name>
					<description>The SPIFI hardware described in this chapter returns</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
	</registers>
</peripheral>


		<peripheral>
			<name>SDMMC</name>
			<description>SD/MMC</description>
			<groupName>SDMMC</groupName>
			<baseAddress>0x40004000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>SDIO</name>
				<value>6</value>
			</interrupt>
			<registers>								
	<register>							
		<name>CTRL</name>						
		<description>Control Register</description>						
		<addressOffset>0x000</addressOffset>						
		<access>read-write</access>						
		<resetValue>0</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>CONTROLLER_RESET</name>				
				<description>Controller reset. To reset controller, software should set bit to 1. This bit is auto-cleared after two AHB and two cclk_in clock cycles. This resets:  - BIU/CIU interface - CIU and state machines  - abort_read_data, send_irq_response, and read_wait bits of Control register  - start_cmd bit of Command register  Does not affect any registers or DMA interface, or FIFO. or host interrupts.</description>				
				<bitRange>[0:0]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NO_CHANGE</name>		
						<description>No change.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>RESET</name>		
						<description>Reset. Reset SD/MMC controller</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>FIFO_RESET</name>				
				<description>Fifo reset. To reset FIFO, software should set bit to 1. This bit is auto-cleared after completion of reset operation. auto-cleared after two AHB clocks.</description>				
				<bitRange>[1:1]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NO_CHANGE</name>		
						<description>No change.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>RESET</name>		
						<description>Reset. Reset to data FIFO To reset FIFO pointers</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>DMA_RESET</name>				
				<description>Dma reset. To reset DMA interface, software should set bit to 1. This bit is auto-cleared after two AHB clocks.</description>				
				<bitRange>[2:2]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NO_CHANGE</name>		
						<description>No change.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>RESET</name>		
						<description>Reset. Reset internal DMA interface control logic</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[3:3]</bitRange>				
			
