cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>					
			<field>					
				<name>INT_ENABLE</name>				
				<description>Global interrupt enable/disable bit. The int port is 1 only when this bit is 1 and one or more unmasked interrupts are set.</description>				
				<bitRange>[4:4]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DISABLE_INTERRUPTS</name>		
						<description>Disable interrupts</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ENABLE_INTERRUPTS</name>		
						<description>Enable interrupts</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved. Always write this bit as 0.</description>				
				<bitRange>[5:5]</bitRange>				
			
			</field>					
			<field>					
				<name>READ_WAIT</name>				
				<description>Read/wait. For sending read-wait to SDIO cards.</description>				
				<bitRange>[6:6]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>CLEAR_READ_WAIT</name>		
						<description>Clear read wait</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ASSERT_READ_WAIT</name>		
						<description>Assert read wait</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>SEND_IRQ_RESPONSE</name>				
				<description>Send irq response. This bit automatically clears once response is sent. To wait for MMC card interrupts, the host issues CMD40, and the SD/MMC controller waits for an interrupt response from the MMC card. In the meantime, if the host wants the SD/MMC interface to exit waiting for interrupt state, it can set this bit, at which time the SD/MMC interface command state-machine sends a CMD40 response on the bus and returns to idle state.</description>				
				<bitRange>[7:7]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NO_CHANGE</name>		
						<description>No change</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>SEND_AUTO_IRQ_RESPON</name>		
						<description>Send auto IRQ response</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ABORT_READ_DATA</name>				
				<description>Abort read data. Used in SDIO card suspend sequence.</description>				
				<bitRange>[8:8]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NO_CHANGE</name>		
						<description>No change</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ABORT</name>		
						<description>Abort. After suspend command is issued during read-transfer, software polls card to find when suspend happened. Once suspend occurs, software sets bit to reset data state-machine, which is waiting for next block of data. This bit automatically clears once data state machine resets to idle. Used in SDIO card suspend sequence.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>SEND_CCSD</name>				
				<description>Send ccsd. When set, the SD/MMC controller sends CCSD to the CE-ATA device. Software sets this bit only if current command is expecting CCS (that is, RW_BLK) and interrupts are enabled in CE-ATA device. Once the CCSD pattern is sent to device, the SD/MMC interface automatically clears send_ccsd bit. It also sets Command Done (CD) bit in RINTSTS register and generates interrupt to host if Command Done interrupt is not masked.  NOTE: Once send_ccsd bit is set, it takes two card clock cycles to drive the CCSD on the CMD line. Due to this, during the boundary conditions it may happen that CCSD is sent to the CE-ATA device, even if the device signalled CCS.</description>				
				<bitRange>[9:9]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>CLEAR_BIT</name>		
						<description>Clear bit if the SD/MMC controller does not reset the bit.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>SEND_COMMAND_COMPLET</name>		
						<description>Send Command Completion Signal Disable (CCSD) to CE-ATA device</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>SEND_AUTO_STOP</name>				
				<description>Send auto stop ccsd. NOTE: Always set send_auto_stop_ccsd and send_ccsd bits together; send_auto_stop_ccsd should not be set independent of send_ccsd. When set, the SD/MMC interface automatically sends internallygenerated STOP command (CMD12) to CE-ATA device. After sending internally-generated STOP command, Auto Command Done (ACD) bit in RINTSTS is set and generates interrupt to host if Auto Command Done interrupt is not masked. After sending the CCSD, the SD/MMC interface automatically clears send_auto_stop_ccsd bit.</description>				
				<bitRange>[10:10]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>CLEAR_THIS_BIT_IF_TH</name>		
						<description>Clear this bit if the SD/MMC controller does not reset the bit.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>SEND_INTERNALLY_GENE</name>		
						<description>Send internally generated STOP after sending CCSD to CE-ATA device.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>CEATA_DEVICE_INTERRUPT_STATUS</name>				
				<description>CEATA device interrupt status. Software should appropriately write to this bit after power-on reset or any other reset to CE-ATA device. After reset, usually CE-ATA device interrupt is disabled (nIEN = 1). If the host enables CE-ATA device interrupt, then software should set this bit.</description>				
				<bitRange>[11:11]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DISABLED</name>		
						<description>Disabled. Interrupts not enabled in CE-ATA device (nIEN = 1 in ATA control register)</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ENABLED</name>		
						<description>Enabled. Interrupts are enabled in CE-ATA device (nIEN = 0 in ATA control register)</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[15:12]</bitRange>				
			
