cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>					
			<field>					
				<name>RESPONSE_EXPECT</name>				
				<description>Response expect</description>				
				<bitRange>[6:6]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NONE</name>		
						<description>None. No response expected from card</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>EXPECTED</name>		
						<description>Expected. Response expected from card</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESPONSE_LENGTH</name>				
				<description>Response length</description>				
				<bitRange>[7:7]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>SHORT</name>		
						<description>Short. Short response expected from card</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>LONG</name>		
						<description>Long. Long response expected from card</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>CHECK_RESPONSE_CRC</name>				
				<description>Check response crc. Some of command responses do not return valid CRC bits. Software should disable CRC checks for those commands in order to disable CRC checking by controller.</description>				
				<bitRange>[8:8]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DO_NOT_CHECK_RESPONS</name>		
						<description>Do not check response CRC</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>CHECK_RESPONSE_CRC</name>		
						<description>Check response CRC</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>DATA_EXPECTED</name>				
				<description>Data expected</description>				
				<bitRange>[9:9]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NONE</name>		
						<description>None. No data transfer expected (read/write)</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>DATA</name>		
						<description>Data. Data transfer expected (read/write)</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>READ_WRITE</name>				
				<description>read/write. Don't care if no data expected from card.</description>				
				<bitRange>[10:10]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>READ_FROM_CARD</name>		
						<description>Read from card</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>WRITE_TO_CARD</name>		
						<description>Write to card</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>TRANSFER_MODE</name>				
				<description>Transfer mode. Don't care if no data expected.</description>				
				<bitRange>[11:11]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>BLOCK_DATA_TRANSFER</name>		
						<description>Block data transfer command</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>STREAM_DATA_TRANSFER</name>		
						<description>Stream data transfer command</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>SEND_AUTO_STOP</name>				
				<description>Send auto stop. When set, the SD/MMC interface sends stop command to SD_MMC_CEATA cards at end of data transfer. Refer to Table 339 to determine:  - when send_auto_stop bit should be set, since some data transfers do not need explicit stop commands  - open-ended transfers that software should explicitly send to stop command  Additionally, when   resume is sent to resume - suspended memory access of SD-Combo card - bit should be set correctly if suspended data transfer needs send_auto_stop. Don't care if no data expected from card.</description>				
				<bitRange>[12:12]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NO_STOP_COMMAND_SENT</name>		
						<description>No stop command sent at end of data transfer</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>SEND_STOP_COMMAND_AT</name>		
						<description>Send stop command at end of data transfer</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>WAIT_PRVDATA_COMPLETE</name>				
				<description>Wait prvdata complete. The wait_prvdata_complete = 0 option typically used to query status of card during data transfer or to stop current data transfer; card_number should be same as in previous command.</description>				
				<bitRange>[13:13]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>SEND</name>		
						<description>Send. Send command at once, even if previous data transfer has not completed.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>WAIT</name>		
						<description>Wait. Wait for previous data transfer completion before sending command.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>STOP_ABORT_CMD</name>				
				<description>Stop abort command. When open-ended or predefined data transfer is in progress, and host issues stop or abort command to stop data transfer, bit should be set so that command/data state-machines of CIU can return correctly to idle state. This is also applicable for Boot mode transfers. To Abort boot mode, this bit should be set along with CMD[26] = disable_boot.</description>				
				<bitRange>[14:14]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DISABLED</name>		
						<description>Disabled. Neither stop nor abort command to stop current data transfer in progress. If abort is sent to function-number currently selected or not in data-transfer mode, then bit should be set to 0.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ENABLED</name>		
						<description>Enabled. Stop or abort command intended to stop current data transfer in progress.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>SEND_INITIALIZATION</name>				
				<description>Send initialization. After power on, 80 clocks must be sent to card for initialization before sending any commands to card. Bit should be set while sending first command to card so that controller will initialize clocks before sending command to card. This bit should not be set for either of the boot modes (alternate or mandatory).</description>				
				<bitRange>[15:15]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>NO</name>		
						<description>No. Do not send initialization sequence (80 clocks of 1) before sending this command.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>SEND</name>		
						<description>Send. Send initialization sequence before sending this command.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved. Always write as 0.</description>				
				<bitRange>[20:16]</bitRange>				
			
