cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>RESP0</name>						
		<description>Response Register 0</description>						
		<addressOffset>0x030</addressOffset>						
		<access>read-only</access>						
		<resetValue>0x00000000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>RESPONSE0</name>				
				<description>Bit[31:0] of response</description>				
				<bitRange>[31:0]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>RESP1</name>						
		<description>Response Register 1</description>						
		<addressOffset>0x034</addressOffset>						
		<access>read-only</access>						
		<resetValue>0x00000000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>RESPONSE1</name>				
				<description>Register represents bit[63:32] of long response. When CIU sends auto-stop command, then response is saved in register. Response for previous command sent by host is still preserved in Response 0 register. Additional auto-stop issued only for data transfer commands, and response type is always   short for them. For information on when CIU sends auto-stop commands, refer to   Auto-Stop .</description>				
				<bitRange>[31:0]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>RESP2</name>						
		<description>Response Register 2</description>						
		<addressOffset>0x038</addressOffset>						
		<access>read-only</access>						
		<resetValue>0</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>RESPONSE2</name>				
				<description>Bit[95:64] of long response</description>				
				<bitRange>[31:0]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>RESP3</name>						
		<description>Response Register 3</description>						
		<addressOffset>0x03C</addressOffset>						
		<access>read-only</access>						
		<resetValue>0</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>RESPONSE3</name>				
				<description>Bit[127:96] of long response</description>				
				<bitRange>[31:0]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>MINTSTS</name>						
		<description>Masked Interrupt Status Register</description>						
		<addressOffset>0x040</addressOffset>						
		<access>read-only</access>						
		<resetValue>0</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>CDET</name>				
				<description>Card detect. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[0:0]</bitRange>				
			</field>					
			<field>					
				<name>RE</name>				
				<description>Response error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[1:1]</bitRange>				
			</field>					
			<field>					
				<name>CDONE</name>				
				<description>Command done. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[2:2]</bitRange>				
			</field>					
			<field>					
				<name>DTO</name>				
				<description>Data transfer over. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[3:3]</bitRange>				
			</field>					
			<field>					
				<name>TXDR</name>				
				<description>Transmit FIFO data request. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[4:4]</bitRange>				
			</field>					
			<field>					
				<name>RXDR</name>				
				<description>Receive FIFO data request. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[5:5]</bitRange>				
			</field>					
			<field>					
				<name>RCRC</name>				
				<description>Response CRC error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[6:6]</bitRange>				
			</field>					
			<field>					
				<name>DCRC</name>				
				<description>Data CRC error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[7:7]</bitRange>				
			</field>					
			<field>					
				<name>RTO</name>				
				<description>Response time-out. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[8:8]</bitRange>				
			</field>					
			<field>					
				<name>DRTO</name>				
				<description>Data read time-out. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[9:9]</bitRange>				
			</field>					
			<field>					
				<name>HTO</name>				
				<description>Data starvation-by-host time-out (HTO). Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[10:10]</bitRange>				
			</field>					
			<field>					
				<name>FRUN</name>				
				<description>FIFO underrun/overrun error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[11:11]</bitRange>				
			</field>					
			<field>					
				<name>HLE</name>				
				<description>Hardware locked write error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[12:12]</bitRange>				
			</field>					
			<field>					
				<name>SBE</name>				
				<description>Start-bit error. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[13:13]</bitRange>				
			</field>					
			<field>					
				<name>ACD</name>				
				<description>Auto command done. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[14:14]</bitRange>				
			</field>					
			<field>					
				<name>EBE</name>				
				<description>End-bit error (read)/write no CRC. Interrupt enabled only if corresponding bit in interrupt mask register is set.</description>				
				<bitRange>[15:15]</bitRange>				
			</field>					
			<field>					
				<name>SDIO_INTERRUPT</name>				
				<description>Interrupt from SDIO card. SDIO interrupt for card enabled only if corresponding sdio_int_mask bit is set in Interrupt mask register (mask bit 1 enables interrupt; 0 masks interrupt).  0 - No SDIO interrupt from card  1 - SDIO interrupt from card  In MMC-Ver3.3-only mode, this bit is always 0.</description>				
				<bitRange>[16:16]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:17]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>RINTSTS</name>						
		<description>Raw Interrupt Status Register</description>						
		<addressOffset>0x044</addressOffset>						
		<access>read-write</access>						
		<resetValue>0</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>CDET</name>				
				<description>Card detect. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[0:0]</bitRange>				
			</field>					
			<field>					
				<name>RE</name>				
				<description>Response error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[1:1]</bitRange>				
			</field>					
			<field>					
				<name>CDONE</name>				
				<description>Command done. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[2:2]</bitRange>				
			</field>					
			<field>					
				<name>DTO</name>				
				<description>Data transfer over. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[3:3]</bitRange>				
			</field>					
			<field>					
				<name>TXDR</name>				
				<description>Transmit FIFO data request. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[4:4]</bitRange>				
			</field>					
			<field>					
				<name>RXDR</name>				
				<description>Receive FIFO data request. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[5:5]</bitRange>				
			</field>					
			<field>					
				<name>RCRC</name>				
				<description>Response CRC error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[6:6]</bitRange>				
			</field>					
			<field>					
				<name>DCRC</name>				
				<description>Data CRC error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[7:7]</bitRange>				
			</field>					
			<field>					
				<name>RTO_BAR</name>				
				<description>Response time-out (RTO)/Boot Ack Received (BAR). Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[8:8]</bitRange>				
			</field>					
			<field>					
				<name>DRTO_BDS</name>				
				<description>Data read time-out (DRTO)/Boot Data Start (BDS). Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[9:9]</bitRange>				
			</field>					
			<field>					
				<name>HTO</name>				
				<description>Data starvation-by-host time-out (HTO). Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status./Volt_switch_int</description>				
				<bitRange>[10:10]</bitRange>				
			</field>					
			<field>					
				<name>FRUN</name>				
				<description>FIFO underrun/overrun error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[11:11]</bitRange>				
			</field>					
			<field>					
				<name>HLE</name>				
				<description>Hardware locked write error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[12:12]</bitRange>				
			</field>					
			<field>					
				<name>SBE</name>				
				<description>Start-bit error. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[13:13]</bitRange>				
			</field>					
			<field>					
				<name>ACD</name>				
				<description>Auto command done. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[14:14]</bitRange>				
			</field>					
			<field>					
				<name>EBE</name>				
				<description>End-bit error (read)/write no CRC. Writes to bits clear status bit. Value of 1 clears status bit, and value of 0 leaves bit intact. Bits are logged regardless of interrupt mask status.</description>				
				<bitRange>[15:15]</bitRange>				
			</field>					
			<field>					
				<name>SDIO_INTERRUPT</name>				
				<description>Interrupt from SDIO card. Writes to these bits clear them. Value of 1 clears bit and 0 leaves bit intact.  0 - No SDIO interrupt from card  1 - SDIO interrupt from card  In MMC-Ver3.3-only mode, bits always 0. Bits are logged regardless of interrupt-mask status.</description>				
				<bitRange>[16:16]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved.</description>				
				<bitRange>[31:17]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>STATUS</name>						
		<description>Status Register</description>						
		<addressOffset>0x048</addressOffset>						
		<access>read-only</access>						
		<resetValue>0</resetValue>						
		<resetMask>0x00000000</resetMask>						
		<fields>						
			<field>					
				<name>FIFO_RX_WATERMARK</name>				
				<description>FIFO reached Receive watermark level; not qualified with data transfer.</description>				
				<bitRange>[0:0]</bitRange>				
			</field>					
			<field>					
				<name>FIFO_TX_WATERMARK</name>				
				<description>FIFO reached Transmit watermark level; not qualified with data transfer.</description>				
				<bitRange>[1:1]</bitRange>				
			</field>					
			<field>					
				<name>FIFO_EMPTY</name>				
				<description>FIFO is empty status</description>				
				<bitRange>[2:2]</bitRange>				
			</field>					
			<field>					
				<name>FIFO_FULL</name>				
				<description>FIFO is full status</description>				
				<bitRange>[3:3]</bitRange>				
			</field>					
			<field>					
				<name>CMDFSMSTATES</name>				
				<description>Command FSM states:  0 - Idle  1 - Send init sequence  2 - Tx cmd start bit  3 - Tx cmd tx bit  4 - Tx cmd index + arg  5 - Tx cmd crc7  6 - Tx cmd end bit  7 - Rx resp start bit  8 - Rx resp IRQ response  9 - Rx resp tx bit  10 - Rx resp cmd idx  11 - Rx resp data  12 - Rx resp crc7  13 - Rx resp end bit  14 - Cmd path wait NCC  15 - Wait; CMD-to-response turnaround  NOTE: The command FSM state is represented using 19 bits. The STATUS Register(7:4) has 4 bits to represent the command FSM states. Using these 4 bits, only 16 states can be represented. Thus three states cannot be represented in the STATUS(7:4) register. The three states that are not represented in the STATUS Register(7:4) are:  - Bit 16 - Wait for CCS - Bit 17 - Send CCSD  - Bit 18 - Boot Mode  Due to this, while command FSM is in   Wait for CCS state or   Send CCSD or   Boot Mode, the Status register indicates status as 0 for the bit field 7:4.</description>				
				<bitRange>[7:4]</bitRange>				
			</field>					
			<field>					
				<name>DATA_3_STATUS</name>				
				<description>Raw selected card_data[3]; checks whether card is present  0 - card not present  1 - card present</description>				
				<bitRange>[8:8]</bitRange>				
			</field>					
			<field>					
				<name>DATA_BUSY</name>				
				<description>Inverted version of raw selected card_data[0]  0 - card data not busy  1 - card data busy</description>				
				<bitRange>[9:9]</bitRange>				
			</field>					
			<field>					
				<name>DATA_STATE_MC_BUSY</name>				
				<description>Data transmit or receive state-machine is busy</description>				
				<bitRange>[10:10]</bitRange>				
			</field>					
			<field>					
				<name>RESPONSE_INDEX</name>				
				<description>Index of previous response, including any auto-stop sent by core.</description>				
				<bitRange>[16:11]</bitRange>				
			</field>					
			<field>					
				<name>FIFO_COUNT</name>				
				<description>FIFO count - Number of filled locations in FIFO</description>				
				<bitRange>[29:17]</bitRange>				
			</field>					
			<field>					
				<name>DMA_ACK</name>				
				<description>DMA acknowledge signal state</description>				
				<bitRange>[30:30]</bitRange>				
			</field>					
			<field>					
				<name>DMA_REQ</name>				
				<description>DMA request signal state</description>				
				<bitRange>[31:31]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>FIFOTH</name>						
		<description>FIFO Threshold Watermark Register</description>						
		<addressOffset>0x04C</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x0F800000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>TX_WMARK</name>				
				<description>FIFO threshold watermark level when transmitting data to card. When FIFO data count is less than or equal to this number, DMA/FIFO request is raised. If Interrupt is enabled, then interrupt occurs. During end of packet, request or interrupt is generated, regardless of threshold programming. In non-DMA mode, when transmit FIFO threshold (TXDR) interrupt is enabled, then interrupt is generated instead of DMA request. During end of packet, on last interrupt, host is responsible for filling FIFO with only required remaining bytes (not before FIFO is full or after CIU completes data transfers, because FIFO may not be empty). In DMA mode, at end of packet, if last transfer is less than burst size, DMA controller does single cycles until required bytes are transferred. 12 bits - 1 bit less than FIFO-count of status register, which is 13 bits. Limitation: TX_WMark >= 1; Recommended value: TX_WMARK = 16; (means less than or equal to FIFO_DEPTH/2).</description>				
				<bitRange>[11:0]</bitRange>				
			
