cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved.</description>				
				<bitRange>[15:12]</bitRange>				
			
			</field>					
			<field>					
				<name>RX_WMARK</name>				
				<description>FIFO threshold watermark level when receiving data to card. When FIFO data count reaches greater than this number, DMA/FIFO request is raised. During end of packet, request is generated regardless of threshold programming in order to complete any remaining data. In non-DMA mode, when receiver FIFO threshold (RXDR) interrupt is enabled, then interrupt is generated instead of DMA request. During end of packet, interrupt is not generated if threshold programming is larger than any remaining data. It is responsibility of host to read remaining bytes on seeing Data Transfer Done interrupt. In DMA mode, at end of packet, even if remaining bytes are less than threshold, DMA request does single transfers to flush out any remaining bytes before Data Transfer Done interrupt is set. 12 bits - 1 bit less than FIFO-count of status register, which is 13 bits. Limitation: RX_WMark less than FIFO_DEPTH-2 Recommended: RX_WMARK = 15; (means greater than (FIFO_DEPTH/2) - 1)  NOTE: In DMA mode during CCS time-out, the DMA does not generate the request at the end of packet, even if remaining bytes are less than threshold. In this case, there will be some data left in the FIFO. It is the responsibility of the application to reset the FIFO after the CCS time-out.</description>				
				<bitRange>[27:16]</bitRange>				
			
			</field>					
			<field>					
				<name>DMA_MTS</name>				
				<description>Burst size of multiple transaction; should be programmed same as DW-DMA controller multiple-transaction-size SRC/DEST_MSIZE.The units for transfers is the H_DATA_WIDTH parameter. A single transfer (dw_dma_single assertion in case of Non DW DMA interface) would be signalled based on this value. Value should be sub-multiple of (RX_WMark + 1) and (32 - TX_WMark). For example, if FIFO_DEPTH = 16, FDATA_WIDTH = H_DATA_WIDTH  Allowed combinations for MSize and TX_WMark are:  MSize = 1, TX_WMARK = 1-15  MSize = 4, TX_WMark = 8  MSize = 4, TX_WMark = 4  MSize = 4, TX_WMark = 12  MSize = 8, TX_WMark = 8  MSize = 8, TX_WMark = 4.  Allowed combinations for MSize and RX_WMark are:  MSize = 1, RX_WMARK = 0-14  MSize = 4, RX_WMark = 3  MSize = 4, RX_WMark = 7  MSize = 4, RX_WMark = 11  MSize = 8, RX_WMark = 7  MSize = 8, RX_WMark = 11  Recommended: MSize = 8, TX_WMark = 8, RX_WMark = 7</description>				
				<bitRange>[30:28]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>1_TRANSFER</name>		
						<description>1 transfer</description>		
						<value>0x0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>4_TRANSFERS</name>		
						<description>4 transfers</description>		
						<value>0x1</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>8_TRANSFERS</name>		
						<description>8 transfers</description>		
						<value>0x2</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>16_TRANSFERS</name>		
						<description>16 transfers</description>		
						<value>0x3</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>32_TRANSFERS</name>		
						<description>32 transfers</description>		
						<value>0x4</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>64_TRANSFERS</name>		
						<description>64 transfers</description>		
						<value>0x5</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>128_TRANSFERS</name>		
						<description>128 transfers</description>		
						<value>0x6</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>256_TRANSFERS</name>		
						<description>256 transfers</description>		
						<value>0x7</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:31]</bitRange>				
			
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>CDETECT</name>						
		<description>Card Detect Register</description>						
		<addressOffset>0x050</addressOffset>						
		<access>read-only</access>						
		<resetValue>0</resetValue>						
		<resetMask>0x00000000</resetMask>						
		<fields>						
			<field>					
				<name>CARD_DETECT</name>				
				<description>Card detect. 0 represents presence of card.</description>				
				<bitRange>[0:0]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:1]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>WRTPRT</name>						
		<description>Write Protect Register</description>						
		<addressOffset>0x054</addressOffset>						
		<access>read-only</access>						
		<resetValue>0</resetValue>						
		<resetMask>0x00000000</resetMask>						
		<fields>						
			<field>					
				<name>WRITE_PROTECT</name>				
				<description>Write protect. 1 represents write protection.</description>				
				<bitRange>[0:0]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:1]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>TCBCNT</name>						
		<description>Transferred CIU Card Byte Count Register</description>						
		<addressOffset>0x05C</addressOffset>						
		<access>read-only</access>						
		<resetValue>0x00000000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>TRANS_CARD_BYTE_COUNT</name>				
				<description>Number of bytes transferred by CIU unit to card.  Register should be read only after data transfer completes; during data transfer, register returns 0.</description>				
				<bitRange>[31:0]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>TBBCNT</name>						
		<description>Transferred Host to BIU-FIFO Byte Count Register</description>						
		<addressOffset>0x060</addressOffset>						
		<access>read-only</access>						
		<resetValue>0</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>TRANS_FIFO_BYTE_COUNT</name>				
				<description>Number of bytes transferred between Host/DMA memory and BIU FIFO.</description>				
				<bitRange>[31:0]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>DEBNCE</name>						
		<description>Debounce Count Register</description>						
		<addressOffset>0x064</addressOffset>						
		<access>read-write</access>						
		<resetValue>0</resetValue>						
		<resetMask>0x00000000</resetMask>						
		<fields>						
			<field>					
				<name>DEBOUNCE_COUNT</name>				
				<description>Number of host clocks (clk) used by debounce filter logic for card detect; typical debounce time is 5-25 ms.</description>				
				<bitRange>[23:0]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:24]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>RST_N</name>						
		<description>Hardware Reset</description>						
		<addressOffset>0x078</addressOffset>						
		<access>read-write</access>						
		<resetValue>0</resetValue>						
		<resetMask>0x00000000</resetMask>						
		<fields>						
			<field>					
				<name>CARD_RESET</name>				
				<description>Hardware reset.  1 - Active mode 0 - Reset  Toggles state on SD_RST pin. This bit causes the card to enter pre-idle state, which requires it to be re-initialized.</description>				
				<bitRange>[0:0]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:1]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>BMOD</name>						
		<description>Bus Mode Register</description>						
		<addressOffset>0x080</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00000000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>SWR</name>				
				<description>Software Reset. When set, the DMA Controller resets all its internal registers. SWR is read/write. It is automatically cleared after 1 clock cycle.</description>				
				<bitRange>[0:0]</bitRange>				
			
