cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>					
			<field>					
				<name>FB</name>				
				<description>Fixed Burst. Controls whether the AHB Master interface performs fixed burst transfers or not. When set, the AHB will use only SINGLE, INCR4, INCR8 or INCR16 during start of normal burst transfers. When reset, the AHB will use SINGLE and INCR burst transfer operations. FB is read/write.</description>				
				<bitRange>[1:1]</bitRange>				
			
			</field>					
			<field>					
				<name>DSL</name>				
				<description>Descriptor Skip Length. Specifies the number of HWord/Word/Dword to skip between two unchained descriptors. This is applicable only for dual buffer structure. DSL is read/write.</description>				
				<bitRange>[6:2]</bitRange>				
			
			</field>					
			<field>					
				<name>DE</name>				
				<description>SD/MMC DMA Enable. When set, the SD/MMC DMA is enabled. DE is read/write.</description>				
				<bitRange>[7:7]</bitRange>				
			
			</field>					
			<field>					
				<name>PBL</name>				
				<description>Programmable Burst Length. These bits indicate the maximum number of beats to be performed in one SD/MMC DMA transaction. The SD/MMC DMA will always attempt to burst as specified in PBL each time it starts a Burst transfer on the host bus. The permissible values are 1, 4, 8, 16, 32, 64, 128 and 256. This value is the mirror of MSIZE of FIFOTH register. In order to change this value, write the required value to FIFOTH register. This is an encode value as follows.Transfer unit is 32 bit. PBL is a read-only value.</description>				
				<bitRange>[10:8]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>1_TRANSFER</name>		
						<description>1 transfer</description>		
						<value>0x0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>4_TRANSFERS</name>		
						<description>4 transfers</description>		
						<value>0x1</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>8_TRANSFERS</name>		
						<description>8 transfers</description>		
						<value>0x2</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>16_TRANSFERS</name>		
						<description>16 transfers</description>		
						<value>0x3</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>32_TRANSFERS</name>		
						<description>32 transfers</description>		
						<value>0x4</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>64_TRANSFERS</name>		
						<description>64 transfers</description>		
						<value>0x5</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>128_TRANSFERS</name>		
						<description>128 transfers</description>		
						<value>0x6</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>256_TRANSFERS</name>		
						<description>256 transfers</description>		
						<value>0x7</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:11]</bitRange>				
			
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>PLDMND</name>						
		<description>Poll Demand Register</description>						
		<addressOffset>0x084</addressOffset>						
		<access>write-only</access>						
		<resetValue>0x00000000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>PD</name>				
				<description>Poll Demand. If the OWN bit of a descriptor is not set, the FSM goes to the Suspend state. The host needs to write any value into this register for the SD/MMC DMA state machine to resume normal descriptor fetch operation. This is a write only register. PD bit is write-only.</description>				
				<bitRange>[31:0]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>DBADDR</name>						
		<description>Descriptor List Base Address Register</description>						
		<addressOffset>0x088</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00000000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>SDL</name>				
				<description>Start of Descriptor List. Contains the base address of the First Descriptor. The LSB bits [1:0] are ignored and taken as all-zero by the SD/MMC DMA internally. Hence these LSB bits are read-only.</description>				
				<bitRange>[31:0]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>IDSTS</name>						
		<description>Internal DMAC Status Register</description>						
		<addressOffset>0x08C</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00000000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>TI</name>				
				<description>Transmit Interrupt. Indicates that data transmission is finished for a descriptor. Writing a 1 clears this bit.</description>				
				<bitRange>[0:0]</bitRange>				
			</field>					
			<field>					
				<name>RI</name>				
				<description>Receive Interrupt. Indicates the completion of data reception for a descriptor. Writing a 1 clears this bit.</description>				
				<bitRange>[1:1]</bitRange>				
			</field>					
			<field>					
				<name>FBE</name>				
				<description>Fatal Bus Error Interrupt. Indicates that a Bus Error occurred (IDSTS[12:10]). When this bit is set, the DMA disables all its bus accesses. Writing a 1 clears this bit.</description>				
				<bitRange>[2:2]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[3:3]</bitRange>				
			</field>					
			<field>					
				<name>DU</name>				
				<description>Descriptor Unavailable Interrupt. This bit is set when the descriptor is unavailable due to OWN bit = 0 (DES0[31] =0). Writing a 1 clears this bit.</description>				
				<bitRange>[4:4]</bitRange>				
			</field>					
			<field>					
				<name>CES</name>				
				<description>Card Error Summary. Indicates the status of the transaction to/from the card; also present in RINTSTS. Indicates the logical OR of the following bits:  EBE - End Bit Error  RTO - Response Time-out/Boot Ack Time-out  RCRC - Response CRC  SBE - Start Bit Error  DRTO - Data Read Time-out/BDS time-out  DCRC - Data CRC for Receive  RE - Response Error  Writing a 1 clears this bit.</description>				
				<bitRange>[5:5]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[7:6]</bitRange>				
			</field>					
			<field>					
				<name>NIS</name>				
				<description>Normal Interrupt Summary. Logical OR of the following: IDSTS[0] - Transmit Interrupt IDSTS[1] - Receive Interrupt Only unmasked bits affect this bit. This is a sticky bit and must be cleared each time a corresponding bit that causes NIS to be set is cleared. Writing a 1 clears this bit.</description>				
				<bitRange>[8:8]</bitRange>				
			</field>					
			<field>					
				<name>AIS</name>				
				<description>Abnormal Interrupt Summary. Logical OR of the following: IDSTS[2] - Fatal Bus Interrupt IDSTS[4] - DU bit Interrupt IDSTS[5] - Card Error Summary Interrupt Only unmasked bits affect this bit. This is a sticky bit and must be cleared each time a corresponding bit that causes AIS to be set is cleared. Writing a 1 clears this bit.</description>				
				<bitRange>[9:9]</bitRange>				
			</field>					
			<field>					
				<name>EB</name>				
				<description>Error Bits. Indicates the type of error that caused a Bus Error. Valid only with Fatal Bus Error bit (IDSTS[2]) set. This field does not generate an interrupt.  001 - Host Abort received during transmission  010 - Host Abort received during reception  Others: Reserved EB is read-only.</description>				
				<bitRange>[12:10]</bitRange>				
			</field>					
			<field>					
				<name>FSM</name>				
				<description>DMAC state machine present state.  0 - DMA_IDLE  1 - DMA_SUSPEND  2 - DESC_RD  3 - DESC_CHK  4 - DMA_RD_REQ_WAIT  5 - DMA_WR_REQ_WAIT  6 - DMA_RD  7 - DMA_WR  8 - DESC_CLOSE  This bit is read-only.</description>				
				<bitRange>[16:13]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:17]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>IDINTEN</name>						
		<description>Internal DMAC Interrupt Enable Register</description>						
		<addressOffset>0x090</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00000000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>TI</name>				
				<description>Transmit Interrupt Enable. When set with Normal Interrupt Summary Enable, Transmit Interrupt is enabled. When reset, Transmit Interrupt is disabled.</description>				
				<bitRange>[0:0]</bitRange>				
			</field>					
			<field>					
				<name>RI</name>				
				<description>Receive Interrupt Enable. When set with Normal Interrupt Summary Enable, Receive Interrupt is enabled. When reset, Receive Interrupt is disabled.</description>				
				<bitRange>[1:1]</bitRange>				
			</field>					
			<field>					
				<name>FBE</name>				
				<description>Fatal Bus Error Enable. When set with Abnormal Interrupt Summary Enable, the Fatal Bus Error Interrupt is enabled. When reset, Fatal Bus Error Enable Interrupt is disabled.</description>				
				<bitRange>[2:2]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[3:3]</bitRange>				
			</field>					
			<field>					
				<name>DU</name>				
				<description>Descriptor Unavailable Interrupt. When set along with Abnormal Interrupt Summary Enable, the DU interrupt is enabled.</description>				
				<bitRange>[4:4]</bitRange>				
			</field>					
			<field>					
				<name>CES</name>				
				<description>Card Error summary Interrupt Enable. When set, it enables the Card Interrupt summary.</description>				
				<bitRange>[5:5]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[7:6]</bitRange>				
			</field>					
			<field>					
				<name>NIS</name>				
				<description>Normal Interrupt Summary Enable. When set, a normal interrupt is enabled. When reset, a normal interrupt is disabled. This bit enables the following bits: IDINTEN[0] - Transmit Interrupt IDINTEN[1] - Receive Interrupt</description>				
				<bitRange>[8:8]</bitRange>				
			</field>					
			<field>					
				<name>AIS</name>				
				<description>Abnormal Interrupt Summary Enable. When set, an abnormal interrupt is enabled. This bit enables the following bits: IDINTEN[2] - Fatal Bus Error Interrupt IDINTEN[4] - DU Interrupt IDINTEN[5] - Card Error Summary Interrupt</description>				
				<bitRange>[9:9]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:10]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>DSCADDR</name>						
		<description>Current Host Descriptor Address Register</description>						
		<addressOffset>0x094</addressOffset>						
		<access>read-only</access>						
		<resetValue>0x00000000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>HDA</name>				
				<description>Host Descriptor Address Pointer. Cleared on reset. Pointer updated by IDMAC during operation. This register points to the start address of the current descriptor read by the SD/MMC DMA.</description>				
				<bitRange>[31:0]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>BUFADDR</name>						
		<description>Current Buffer Descriptor Address Register</description>						
		<addressOffset>0x098</addressOffset>						
		<access>read-only</access>						
		<resetValue>0x00000000</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>HBA</name>				
				<description>Host Buffer Address Pointer. Cleared on Reset. Pointer updated by IDMAC during operation. This register points to the current Data Buffer Address being accessed by the SD/MMC DMA.</description>				
				<bitRange>[31:0]</bitRange>				
			</field>					
		</fields>						
	</register>							
