cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>				
			<field>				
				<name>MD</name>			
				<description>Memory device.</description>			
				<bitRange>[4:3]</bitRange>			
				<enumeratedValues>			
				<name>ENUM</name>			
					<enumeratedValue>		
						<name>SDRAM</name>	
						<description>SDRAM (POR reset value).</description>	
						<value>0x0</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>RESERVED</name>	
						<description>Reserved.</description>	
						<value>0x1</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>RESERVED</name>	
						<description>Reserved.</description>	
						<value>0x2</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>RESERVED</name>	
						<description>Reserved.</description>	
						<value>0x3</value>	
					</enumeratedValue>		
				</enumeratedValues>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[6:5]</bitRange>			
		
			</field>				
			<field>				
				<name>AM0</name>			
				<description>Address mapping. See Table 382. 000000 = reset value.[1]</description>			
				<bitRange>[12:7]</bitRange>			
		
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[13:13]</bitRange>			
		
			</field>				
			<field>				
				<name>AM1</name>			
				<description>Address mapping See Table 382. 0 = reset value.</description>			
				<bitRange>[14:14]</bitRange>			
		
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[18:15]</bitRange>			
		
			</field>				
			<field>				
				<name>B</name>			
				<description>Buffer enable.</description>			
				<bitRange>[19:19]</bitRange>			
				<enumeratedValues>			
				<name>ENUM</name>			
					<enumeratedValue>		
						<name>DISABLED</name>	
						<description>Disabled. Buffer disabled for accesses to this chip select (POR reset value).</description>	
						<value>0</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>ENABLED</name>	
						<description>Enabled. Buffer enabled for accesses to this chip select. After configuration of the dynamic memory, the buffer must be enabled for normal operation. [2]</description>	
						<value>1</value>	
					</enumeratedValue>		
				</enumeratedValues>			
			</field>				
			<field>				
				<name>P</name>			
				<description>Write protect.</description>			
				<bitRange>[20:20]</bitRange>			
				<enumeratedValues>			
				<name>ENUM</name>			
					<enumeratedValue>		
						<name>NONE</name>	
						<description>None. Writes not protected (POR reset value).</description>	
						<value>0</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>PROTECTED</name>	
						<description>Protected. Writes protected.</description>	
						<value>1</value>	
					</enumeratedValue>		
				</enumeratedValues>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:21]</bitRange>			
		
			</field>				
		</fields>					
	</register>						
	<register>						
		<dim>4</dim>					
		<dimIncrement>0x20</dimIncrement>					
		<dimIndex>0-3</dimIndex>					
		<name>DYNAMICRASCAS%s</name>					
		<description>Selects the RAS and CAS latencies for dynamic memory chip select 0.</description>					
		<addressOffset>0x104</addressOffset>					
		<access>read-write</access>					
		<resetValue>0x303</resetValue>					
		<resetMask>0xFFFFFFFF</resetMask>					
		<fields>					
			<field>				
				<name>RAS</name>			
				<description>RAS latency (active to read/write delay).</description>			
				<bitRange>[1:0]</bitRange>			
				<enumeratedValues>			
				<name>ENUM</name>			
					<enumeratedValue>		
						<name>RESERVED</name>	
						<description>Reserved.</description>	
						<value>0x0</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>ONE_EMC_CCLK_CYCLE</name>	
						<description>One EMC_CCLK cycle.</description>	
						<value>0x1</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>TWO_EMC_CCLK_CYCLES</name>	
						<description>Two EMC_CCLK cycles.</description>	
						<value>0x2</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>THREE_EMC_CCLK_CYCLE</name>	
						<description>Three EMC_CCLK cycles (POR reset value).</description>	
						<value>0x3</value>	
					</enumeratedValue>		
				</enumeratedValues>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[7:2]</bitRange>			
		
			</field>				
			<field>				
				<name>CAS</name>			
				<description>CAS latency.</description>			
				<bitRange>[9:8]</bitRange>			
				<enumeratedValues>			
				<name>ENUM</name>			
					<enumeratedValue>		
						<name>RESERVED</name>	
						<description>Reserved.</description>	
						<value>0x0</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>ONE_EMC_CCLK_CYCLE</name>	
						<description>One EMC_CCLK cycle.</description>	
						<value>0x1</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>TWO_EMC_CCLK_CYCLES</name>	
						<description>Two EMC_CCLK cycles.</description>	
						<value>0x2</value>	
					</enumeratedValue>		
					<enumeratedValue>		
						<name>THREE_EMC_CCLK_CYCLE</name>	
						<description>Three EMC_CCLK cycles (POR reset value).</description>	
						<value>0x3</value>	
					</enumeratedValue>		
				</enumeratedValues>			
			</field>				
			<field>				
				<name>RESERVED</name>			
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>			
				<bitRange>[31:10]</bitRange>			
		
