cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
	<register>													
		<name>MAC_FLOW_CTRL</name>												
		<description>Flow control register</description>												
		<addressOffset>0x0018</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>FCB</name>										
				<description>Flow Control Busy/Backpressure Activate  This register field can be read by the application (Read), can be set to 1 by the application with a register write of 1 (Write Set), and is cleared to 0 by the core (Self Clear). The application cannot clear this type of field, and a register write of 0 to this bit has no effect on this field.  This bit initiates a Pause Control frame in Full-Duplex mode. In Full-Duplex mode, this bit should be read as 0 before writing to the Flow Control register. To initiate a Pause control frame, the Application must set this bit to 1. During a transfer of the Control Frame, this bit will continue to be set to signify that a frame transmission is in progress. After the completion of Pause control frame transmission, the MAC will reset this bit to 0. The Flow Control register should not be written to until this bit is cleared. In Half-Duplex mode, when this bit is set (and TFE is set), then backpressure is asserted by the MAC Core. During backpressure, when the MAC receives a new frame, the transmitter starts sending a JAM pattern resulting in a collision. This control register bit is logically ORed with the flow controller input signal for the backpressure function. When the MAC is configured to Full- Duplex mode, the BPA is automatically disabled.</description>										
				<bitRange>[0:0]</bitRange>										
			</field>											
			<field>											
				<name>TFE</name>										
				<description>Transmit Flow Control Enable  In Full-Duplex mode, when this bit is set, the MAC enables the flow control operation to transmit Pause frames. When this bit is reset, the flow control operation in the MAC is disabled, and the MAC will not transmit any Pause frames. In Half-Duplex mode, when this bit is set, the MAC enables the back-pressure operation. When this bit is reset, the backpressure feature is disabled.</description>										
				<bitRange>[1:1]</bitRange>										
			</field>											
			<field>											
				<name>RFE</name>										
				<description>Receive Flow Control Enable  When this bit is set, the MAC will decode the received Pause frame and disable its transmitter for a specified (Pause Time) time. When this bit is reset, the decode function of the Pause frame is disabled.</description>										
				<bitRange>[2:2]</bitRange>										
			</field>											
			<field>											
				<name>UP</name>										
				<description>Unicast Pause Frame Detect  When this bit is set, the MAC will detect the Pause frames with the station's unicast address specified in MAC Address0 High Register and MAC Address0 Low Register, in addition to the detecting Pause frames with the unique multicast address. When this bit is reset, the MAC will detect only a Pause frame with the unique multicast address specified in the 802.3x standard.</description>										
				<bitRange>[3:3]</bitRange>										
			</field>											
			<field>											
				<name>PLT</name>										
				<description>Pause Low Threshold  This field configures the threshold of the PAUSE timer at which the input flow control is checked for automatic retransmission of PAUSE Frame. The threshold values should be always less than the Pause Time configured in Bits[31:16]. For example, if PT = 0x100 (256 slot-times), and PLT = 01, then a second PAUSE frame is automatically transmitted if the flow control signal is asserted at 228 (256 - 28) slot-times after the first PAUSE frame is transmitted.</description>										
				<bitRange>[5:4]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[6:6]</bitRange>										
			</field>											
			<field>											
				<name>DZPQ</name>										
				<description>Disable Zero-Quanta Pause  When set, this bit disables the automatic generation of Zero-Quanta Pause Control frames on the deassertion of the flow-control signal from the FIFO layer. When this bit is reset, normal operation with automatic Zero-Quanta Pause Control frame generation is enabled.</description>										
				<bitRange>[7:7]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[15:8]</bitRange>										
			</field>											
			<field>											
				<name>PT</name>										
				<description>Pause time This field holds the value to be used in the Pause Time field in the transmit control frame. If the Pause Time bits is configured to be double-synchronized to the MII clock domain, then consecutive writes to this register should be performed only after at least 4 clock cycles in the destination clock domain.</description>										
				<bitRange>[31:16]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>MAC_VLAN_TAG</name>												
		<description>VLAN tag register</description>												
		<addressOffset>0x001C</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>VL</name>										
				<description>VLAN Tag Identifier for Receive Frames  This contains the 802.1Q VLAN tag to identify VLAN frames, and is compared to the fifteenth and sixteenth bytes of the frames being received for VLAN frames. Bits[15:13] are the User Priority, Bit[12] is the Canonical Format Indicator (CFI) and bits[11:0] are the VLAN tag's VLAN Identifier (VID) field. When the ETV bit is set, only the VID (Bits[11:0]) is used for comparison.  If VL (VL[11:0] if ETV is set) is all zeros, the MAC does not check the fifteenth and sixteenth bytes for VLAN tag comparison, and declares all frames with a Type field value of 0x8100 to be VLAN frames.</description>										
				<bitRange>[15:0]</bitRange>										
			</field>											
			<field>											
				<name>ETV</name>										
				<description>Enable 12-Bit VLAN Tag Comparison  When this bit is set, a 12-bit VLAN identifier, rather than the complete 16-bit VLAN tag, is used for comparison and filtering. Bits[11:0] of the VLAN tag are compared with the corresponding field in the received VLAN-tagged frame.  When this bit is reset, all 16 bits of the received VLAN frame's fifteenth and sixteenth bytes are used for comparison.</description>										
				<bitRange>[16:16]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[31:17]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>MAC_DEBUG</name>												
		<description>Debug register</description>												
		<addressOffset>0x0024</addressOffset>												
		<access>read-only</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>RXIDLESTAT</name>										
				<description>When high, it indicates that the MAC MII receive protocol engine is actively receiving data and not in IDLE state.</description>										
				<bitRange>[0:0]</bitRange>										
			</field>											
			<field>											
				<name>FIFOSTAT0</name>										
				<description>When high, it indicates the active state of the small FIFO Read and Write controllers respectively of the MAC receive Frame Controller module.</description>										
				<bitRange>[2:1]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[3:3]</bitRange>										
			</field>											
			<field>											
				<name>RXFIFOSTAT1</name>										
				<description>When high, it indicates that the MTL RxFIFO Write Controller is active and transferring a received frame to the FIFO.</description>										
				<bitRange>[4:4]</bitRange>										
			</field>											
			<field>											
				<name>RXFIFOSTAT</name>										
				<description>State of the RxFIFO read Controller:  00 = idle state 01 = reading frame data 10 = reading frame status (or Time stamp) 11 = flushing the frame data and status</description>										
				<bitRange>[6:5]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[7:7]</bitRange>										
			</field>											
			<field>											
				<name>RXFIFOLVL</name>										
				<description>Status of the RxFIFO Fill-level  00 = RxFIFO Empty  01 = RxFIFO fill-level below flow-control de-activate threshold  10 = RxFIFO fill-level above flow-control activate threshold  11 = RxFIFO Full</description>										
				<bitRange>[9:8]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[15:10]</bitRange>										
			</field>											
			<field>											
				<name>TXIDLESTAT</name>										
				<description>When high, it indicates that the MAC MII transmit protocol engine is actively transmitting data and not in IDLE state.</description>										
				<bitRange>[16:16]</bitRange>										
			</field>											
			<field>											
				<name>TXSTAT</name>										
				<description>State of the MAC Transmit Frame Controller module:  00 = idle 01 = Waiting for Status of previous frame or IFG/backoff period to be over  10 = Generating and transmitting a PAUSE control frame (in full duplex mode)  11 = Transferring input frame for transmission</description>										
				<bitRange>[18:17]</bitRange>										
			</field>											
			<field>											
				<name>PAUSE</name>										
				<description>When high, it indicates that the MAC transmitter is in PAUSE condition (in full-duplex only) and hence will not schedule any frame for transmission.</description>										
				<bitRange>[19:19]</bitRange>										
			</field>											
			<field>											
				<name>TXFIFOSTAT</name>										
				<description>State of the TxFIFO read Controller  00 = idle state 01 = READ state (transferring data to MAC transmitter)  10 = Waiting for TxStatus from MAC transmitter  11 = Writing the received TxStatus or flushing the TxFIFO</description>										
				<bitRange>[21:20]</bitRange>										
			</field>											
			<field>											
				<name>TXFIFOSTAT1</name>										
				<description>When high, it indicates that the TxFIFO Write Controller is active and transferring data to the TxFIFO.</description>										
				<bitRange>[22:22]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[23:23]</bitRange>										
			</field>											
			<field>											
				<name>TXFIFOLVL</name>										
				<description>When high, it indicates that the TxFIFO is not empty and has some data left for transmission.</description>										
				<bitRange>[24:24]</bitRange>										
			</field>											
			<field>											
				<name>TXFIFOFULL</name>										
				<description>When high, it indicates that the TxStatus FIFO is full and hence the controller will not be accepting any more frames for transmission.</description>										
				<bitRange>[25:25]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[31:26]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>MAC_RWAKE_FRFLT</name>												
		<description>Remote wake-up frame filter</description>												
		<addressOffset>0x0028</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>ADDR</name>										
				<description>WKUPFMFILTER address</description>										
				<bitRange>[31:0]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>MAC_PMT_CTRL_STAT</name>												
		<description>PMT control and status</description>												
		<addressOffset>0x002C</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>PD</name>										
				<description>Power-down This register field can be read by the application (Read), can be set to 1 by the application with a register write of 1 (Write Set), and is cleared to 0 by the core (Self Clear). The application cannot clear this type of field, and a register write of 0 to this bit has no effect on this field.  When set, all received frames will be dropped. This bit is cleared automatically when a magic packet or Wake-Up frame is received, and Power-Down mode is disabled. Frames received after this bit is cleared are forwarded to the application.This bit must only be set when either the Magic Packet Enable or Wake- Up Frame Enable bit is set high.</description>										
				<bitRange>[0:0]</bitRange>										
			</field>											
			<field>											
				<name>MPE</name>										
				<description>Magic packet enable When set, enables generation of a power management event due to Magic Packet reception.</description>										
				<bitRange>[1:1]</bitRange>										
			</field>											
			<field>											
				<name>WFE</name>										
				<description>Wake-up frame enable When set, enables generation of a power management event due to wake-up frame reception.</description>										
				<bitRange>[2:2]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[4:3]</bitRange>										
			</field>											
			<field>											
				<name>MPR</name>										
				<description>Magic Packet Received This register field can be read by the application (Read), can be set to 1 by the Ethernet core on a certain internal event (Self Set), and is automatically cleared to 0 on a register read. A register write of 0 has no effect on this field.  When set, this bit indicates the power management event was generated by the reception of a Magic Packet. This bit is cleared by a Read into this register.</description>										
				<bitRange>[5:5]</bitRange>										
			</field>											
			<field>											
				<name>WFR</name>										
				<description>Wake-up Frame Received This register field can be read by the application (Read), can be set to 1 by the Ethernet core on a certain internal event (Self Set), and is automatically cleared to 0 on a register read. A register write of 0 has no effect on this field.   When set, this bit indicates the power management event was generated due to reception of a wake-up frame. This bit is cleared by a Read into this register.</description>										
				<bitRange>[6:6]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[8:7]</bitRange>										
			</field>											
			<field>											
				<name>GU</name>										
				<description>Global Unicast When set, enables any unicast packet filtered by the MAC (DAF) address recognition to be a wake-up frame.</description>										
				<bitRange>[9:9]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[30:10]</bitRange>										
			</field>											
			<field>											
				<name>WFFRPR</name>										
				<description>Wake-up Frame Filter Register Pointer Reset This register field can be read by the application (Read), can be set to 1 by the application with a register write of 1 (Write Set), and is cleared to 0 by the core (Self Clear). The application cannot clear this type of field, and a register write of 0 to this bit has no effect on this field.  When set, resets the Remote Wake-up Frame Filter register pointer to 000. It is automatically cleared after 1 clock cycle.</description>										
				<bitRange>[31:31]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>MAC_INTR</name>												
		<description>Interrupt status register</description>												
		<addressOffset>0x0038</addressOffset>												
		<access>read-only</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[2:0]</bitRange>										
			</field>											
			<field>											
				<name>PMT</name>										
				<description>PMT Interrupt Status  This bit is set whenever a Magic packet or Wake-on-LAN frame is received in Power- Down mode (See bits 5 and 6 in Table 560). This bit is cleared when both bits[6:5] are cleared because of a read operation to the PMT Control and Status register.</description>										
				<bitRange>[3:3]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[8:4]</bitRange>										
			</field>											
			<field>											
				<name>TS</name>										
				<description>Timestamp interrupt status When Advanced Timestamp feature is enabled, this bit is set when any of the following conditions is true:  - The system time value equals or exceeds the value specified in the Target Time High and Low registers  - There is an overflow in the seconds register  This bit is cleared on reading the byte 0 of the Timestamp Status register (Table 576).  Otherwise, when default Time stamping is enabled, this bit when set indicates that the system time value equals or exceeds the value specified in the Target Time registers. In this mode, this bit is cleared after the completion of the read of this Interrupt Status Register[9]. In all other modes, this bit is reserved.</description>										
				<bitRange>[9:9]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[10:10]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[31:11]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>MAC_INTR_MASK</name>												
		<description>Interrupt mask register</description>												
		<addressOffset>0x003C</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[2:0]</bitRange>										
			</field>											
			<field>											
				<name>PMTIM</name>										
				<description>PMT Interrupt Mask  This bit when set, will disable the assertion of the interrupt signal due to the setting of PMT Interrupt Status bit in Table 561.</description>										
				<bitRange>[3:3]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[8:4]</bitRange>										
			</field>											
			<field>											
				<name>TSIM</name>										
				<description>Timestamp interrupt mask When set, this bit disables the assertion of the interrupt signal because of the setting of Timestamp Interrupt Status bit in Table 561</description>										
				<bitRange>[9:9]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[10:10]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>MAC_ADDR0_HIGH</name>												
		<description>MAC address 0 high register</description>												
		<addressOffset>0x0040</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x8000FFFF</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>A47_32</name>										
				<description>MAC Address0 [47:32]  This field contains the upper 16 bits (47:32) of the 6-byte first MAC address. This is used by the MAC for filtering for received frames and for inserting the MAC address in the Transmit Flow Control (PAUSE) Frames.</description>										
				<bitRange>[15:0]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[30:16]</bitRange>										
			</field>											
			<field>											
				<name>MO</name>										
				<description>Always 1</description>										
				<bitRange>[31:31]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>MAC_ADDR0_LOW</name>												
		<description>MAC address 0 low register</description>												
		<addressOffset>0x0044</addressOffset>												
		<access>read-write</access>												
		<resetValue>0xFFFFFFFF</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>A31_0</name>										
				<description>MAC Address0 [31:0]  This field contains the lower 32 bits of the 6-byte first MAC address. This is used by the MAC for filtering for received frames and for inserting the MAC address in the Transmit Flow Control (PAUSE) Frames.</description>										
				<bitRange>[31:0]</bitRange>										
			</field>											
		</fields>												
	</register>													
