cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
	<register>													
		<name>MAC_TIMESTP_CTRL</name>												
		<description>Time stamp control register</description>												
		<addressOffset>0x0700</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00002000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TSENA</name>										
				<description>Time stamp Enable  When this bit, is set the timestamping is enabled for transmit and receive frames. When disabled timestamp is not added for transmit and receive frames and the TimeStamp Generator is also suspended. User has to always initialize the TimeStamp (system time) after enabling this mode.</description>										
				<bitRange>[0:0]</bitRange>										
			</field>											
			<field>											
				<name>TSCFUPDT</name>										
				<description>Time stamp Fine or Coarse Update  When set, indicates that the system times update to be done using fine update method. When reset it indicates the system time stamp update to be done using Coarse method. This bit is reserved if the fine correction option is not enabled.</description>										
				<bitRange>[1:1]</bitRange>										
			</field>											
			<field>											
				<name>TSINIT</name>										
				<description>Time stamp Initialize This register field can be read and written by the application (Read and Write), and is cleared to 0 by the Ethernet core (Self Clear).  When set, the system time is initialized (over-written) with the value specified in the Time stamp High Update and Time stamp Low Update registers. This register bit should be read zero before updating it. This bit is reset once the initialize is complete.</description>										
				<bitRange>[2:2]</bitRange>										
			</field>											
			<field>											
				<name>TSUPDT</name>										
				<description>Time stamp Update  This register field can be read and written by the application (Read and Write), and is cleared to 0 by the Ethernet core (Self Clear).  When set, the system time is updated (added/subtracted) with the value specified in the Time stamp High Update and Time stamp Low Update registers. This register bit should be read zero before updating it. This bit is reset once the update is completed in hardware.</description>										
				<bitRange>[3:3]</bitRange>										
			</field>											
			<field>											
				<name>TSTRIG</name>										
				<description>Time stamp Interrupt Trigger Enable  This register field can be read and written by the application (Read and Write), and is cleared to 0 by the Ethernet core (Self Clear).  When set, the Time stamp interrupt is generated when the System Time becomes greater than the value written in Target Time register. This bit is reset after the generation of Time stamp Trigger Interrupt.</description>										
				<bitRange>[4:4]</bitRange>										
			</field>											
			<field>											
				<name>TSADDREG</name>										
				<description>Addend Reg Update  When set, the contents of the Time stamp Addend register is updated in the PTP block for fine correction. This is cleared when the update is completed. This register bit should be zero before setting it. This is a reserved bit when only coarse correction option is selected.</description>										
				<bitRange>[5:5]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[7:6]</bitRange>										
			</field>											
			<field>											
				<name>TSENALL</name>										
				<description>Enable Time stamp for All Frames  When set, the Time stamp snapshot is enabled for all frames received by the core.</description>										
				<bitRange>[8:8]</bitRange>										
			</field>											
			<field>											
				<name>TSCTRLSSR</name>										
				<description>Time stamp Digital or Binary rollover control  When set, the Time stamp Low register rolls over after 0x3B9A_C9FF value (i.e., 1 nanosecond accuracy) and increments the Time stamp (High) seconds. When reset, the rollover value of sub-second register is 0x7FFF_FFFF. The sub-second increment has to be programmed correctly depending on the PTP reference clock frequency and this bit value.</description>										
				<bitRange>[9:9]</bitRange>										
			</field>											
			<field>											
				<name>TSVER2ENA</name>										
				<description>Enable PTP packet snooping for version 2 format  When set, the PTP packets are snooped using the 1588 version 2 format else snooped using the version 1 format.</description>										
				<bitRange>[10:10]</bitRange>										
			</field>											
			<field>											
				<name>TSIPENA</name>										
				<description>Enable Time stamp Snapshot for PTP over Ethernet frames  When set, the Time stamp snapshot is taken for frames which have PTP messages in Ethernet frames (PTP over Ethernet) also. By default snapshots are taken for UDP-IP-Ethernet PTP packets.</description>										
				<bitRange>[11:11]</bitRange>										
			</field>											
			<field>											
				<name>TSIPV6ENA</name>										
				<description>Enable Time stamp Snapshot for IPv6 frames  When set, the Time stamp snapshot is taken for IPv6 frames.</description>										
				<bitRange>[12:12]</bitRange>										
			</field>											
			<field>											
				<name>TSIPV4ENA</name>										
				<description>Enable Time stamp Snapshot for IPv4 frames  When set, the Time stamp snapshot is taken for IPv4 frames.</description>										
				<bitRange>[13:13]</bitRange>										
			</field>											
			<field>											
				<name>TSEVNTENA</name>										
				<description>Enable Time stamp Snapshot for Event Messages  When set, the Time stamp snapshot is taken for event messages only. When reset snapshot is taken for all other messages except Announce, Management and Signaling.</description>										
				<bitRange>[14:14]</bitRange>										
			</field>											
			<field>											
				<name>TSMSTRENA</name>										
				<description>Enable Snapshot for Messages Relevant to Master  When set, the snapshot is taken for messages relevant to master node only else snapshot is taken for messages relevant to slave node. This is valid only for ordinary clock and boundary clock node.</description>										
				<bitRange>[15:15]</bitRange>										
			</field>											
			<field>											
				<name>TSCLKTYPE</name>										
				<description>Select the type of clock node  The following are the options to select the type of clock node:  00 = ordinary clock 01 = boundary clock 10 = end-to-end transparent clock 11 = peer-to-peer transparent clock</description>										
				<bitRange>[17:16]</bitRange>										
			</field>											
			<field>											
				<name>TSENMACADDR</name>										
				<description>Enable MAC address for PTP frame filtering  When set, uses the DA MAC address (that matches any MAC Address register except the default MAC address 0) to filter the PTP frames when PTP is sent directly over Ethernet.</description>										
				<bitRange>[18:18]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>SUBSECOND_INCR</name>												
		<description>Sub-second increment register</description>												
		<addressOffset>0x0704</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>SSINC</name>										
				<description>Sub-second increment value. The value programmed in this register is accumulated with the contents of the sub-second register. For example, to achieve an accuracy of 20 ns, the value to be programmed is 20. (Program 0x14 with a 50 MHz reference clock if 1 ns accuracy is selected.)</description>										
				<bitRange>[7:0]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[31:8]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>SECONDS</name>												
		<description>System time seconds register</description>												
		<addressOffset>0x0708</addressOffset>												
		<access>read-only</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TSS</name>										
				<description>Time stamp second The value in this field indicates the current value in seconds of the System Time maintained by the core.</description>										
				<bitRange>[31:0]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>NANOSECONDS</name>												
		<description>System time nanoseconds register</description>												
		<addressOffset>0x070C</addressOffset>												
		<access>read-only</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TSSS</name>										
				<description>Time stamp sub seconds The value in this field has the sub second representation of time, with an accuracy of 0.46 nano-second. (When TSCTRLSSR in the MAC_TIMESTAMP_CTRL register is set, each bit represents 1 ns and the maximum value will be 0x3B9A_C9FF, after which it rolls-over to zero).</description>										
				<bitRange>[30:0]</bitRange>										
			</field>											
			<field>											
				<name>PSNT</name>										
				<description>Positive or negative time This bit indicates positive or negative time value. If the bit is reset, it indicates that the time representation is positive, and if it is set, it indicates negative time value. (This bit represents the 32nd bit of the nanoseconds value when the Advance Time stamp feature is enabled).</description>										
				<bitRange>[31:31]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>SECONDSUPDATE</name>												
		<description>System time seconds update register</description>												
		<addressOffset>0x0710</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TSS</name>										
				<description>Time stamp second The value in this field indicates the time, in seconds, to be initialized or added to the system time.</description>										
				<bitRange>[31:0]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>NANOSECONDSUPDATE</name>												
		<description>System time nanoseconds update register</description>												
		<addressOffset>0x0714</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TSSS</name>										
				<description>Time stamp sub seconds The value in this field has the sub second representation of time, with an accuracy of 0.46 nano-second. (When TSCTRLSSR is set in the Time stamp control register, each bit represents 1 ns and the programmed value should not exceed 0x3B9A_C9FF.)</description>										
				<bitRange>[30:0]</bitRange>										
			</field>											
			<field>											
				<name>ADDSUB</name>										
				<description>Add or subtract time When this bit is set, the time value is subtracted with the contents of the update register. When this bit is reset, the time value is added with the contents of the update register.</description>										
				<bitRange>[31:31]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>ADDEND</name>												
		<description>Time stamp addend register</description>												
		<addressOffset>0x0718</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TSAR</name>										
				<description>Time stamp addend This register indicates the 32-bit time value to be added to the Accumulator register to achieve time synchronization.</description>										
				<bitRange>[31:0]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>TARGETSECONDS</name>												
		<description>Target time seconds register</description>												
		<addressOffset>0x071C</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TSTR</name>										
				<description>Target time seconds register This register stores the time in seconds. When the Time stamp value matches or exceeds both Target Time stamp registers, the MAC, if enabled, generates an interrupt.</description>										
				<bitRange>[31:0]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>TARGETNANOSECONDS</name>												
		<description>Target time nanoseconds register</description>												
		<addressOffset>0x0720</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TSTR</name>										
				<description>Target Time stamp low  This register stores the time in (signed) nanoseconds. When the value of the Time stamp matches the Target Time stamp registers (both), the MAC will generate an interrupt if enabled. (This value should not exceed 0x3B9A_C9FF when TSCTRLSSR is set in the Time stamp control register.)</description>										
				<bitRange>[30:0]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[31:31]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>HIGHWORD</name>												
		<description>System time higher word seconds register</description>												
		<addressOffset>0x0724</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TSHWR</name>										
				<description>Time stamp higher word Contains the most significant 16-bits of the Time stamp seconds value. The register is directly written to initialize the value. This register is incremented when there is an overflow from the 32-bits of the System Time - Seconds register.</description>										
				<bitRange>[15:0]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[31:16]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>TIMESTAMPSTAT</name>												
		<description>Time stamp status register</description>												
		<addressOffset>0x0728</addressOffset>												
		<access>read-only</access>												
		<resetValue>0x00000000</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TSSOVF</name>										
				<description>Time stamp seconds overflow When set, indicates that the seconds value of the Time stamp (when supporting version 2 format) has overflowed beyond 0xFFFF_FFFF.</description>										
				<bitRange>[0:0]</bitRange>										
			</field>											
			<field>											
				<name>TSTARGT</name>										
				<description>Time stamp target reached When set, indicates the value of system time is greater or equal to the value specified in the Target Time High and Low registers</description>										
				<bitRange>[1:1]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved.</description>										
				<bitRange>[31:2]</bitRange>										
			</field>											
		</fields>												
	</register>													
