cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
</registers>														

</peripheral>
		<peripheral>
			<name>ATIMER</name>
			<description>Alarm timer </description>
			<groupName>ATIMER</groupName>
			<baseAddress>0x40040000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ATIMER</name>
				<value>46</value>
			</interrupt>
			<registers>
				<register>
					<name>DOWNCOUNTER</name>
					<description>Downcounter register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0x000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CVAL</name>
							<description>When equal to zero an interrupt is raised. When equal to zero PRESET is loaded and counting continues.</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>PRESET</name>
					<description>Preset value register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0x000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRESETVAL</name>
							<description>Value loaded in DOWNCOUNTER when DOWNCOUNTER equals zero</description>
							<bitRange>[15:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:16]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLR_EN</name>
					<description>Interrupt clear enable register</description>
					<addressOffset>0xFD8</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLR_EN</name>
							<description>Writing a 1 to this bit clears the interrupt enable bit in the ENABLE register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SET_EN</name>
					<description>Interrupt set enable register</description>
					<addressOffset>0xFDC</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SET_EN</name>
							<description>Writing a 1 to this bit sets the interrupt enable bit in the ENABLE register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>Status register</description>
					<addressOffset>0xFE0</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>STAT</name>
							<description>A 1 in this bit shows that the STATUS interrupt has been raised.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>ENABLE</name>
					<description>Enable register</description>
					<addressOffset>0xFE4</addressOffset>
					<access>read-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>EN</name>
							<description>A 1 in this bit shows that the STATUS interrupt has been enabled and that the STATUS interrupt request signal is asserted when STAT = 1 in the STATUS register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>CLR_STAT</name>
					<description>Clear register</description>
					<addressOffset>0xFE8</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CSTAT</name>
							<description>Writing a 1 to this bit clears the STATUS interrupt bit in the STATUS register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SET_STAT</name>
					<description>Set register</description>
					<addressOffset>0xFEC</addressOffset>
					<access>write-only</access>
					<resetValue>0x0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SSTAT</name>
							<description>Writing a 1 to this bit sets the STATUS interrupt bit in the STATUS register.</description>
							<bitRange>[0:0]</bitRange>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[31:1]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>REGFILE</name>
			<description> RTC REGFILE </description>
			<groupName>REGFILE</groupName>
			<baseAddress>0x40041000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<dim>64</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-63</dimIndex>
					<name>REGFILE[%s]</name>
					<description>General purpose storage register</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REGVAL</name>
							<description>General purpose storage.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
