cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>M4MEMMAP</name>									
		<description>ARM Cortex-M4 memory mapping</description>									
		<addressOffset>0x100</addressOffset>									
		<access>read-write</access>									
		<resetValue>0x10400000</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>M4MAP</name>							
				<description>Shadow address when accessing memory at address 0x0000 0000</description>							
				<bitRange>[31:12]</bitRange>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>CREG5</name>									
		<description>Chip configuration register 5. Controls JTAG access.</description>									
		<addressOffset>0x118</addressOffset>									
		<access>read-write</access>									
		<resetValue>0</resetValue>									
		<resetMask>0x00000000</resetMask>									
		<fields>									
			<field>								
				<name>RESERVED</name>							
				<description>Reserved.</description>							
				<bitRange>[9:0]</bitRange>							
						
			</field>								
			<field>								
				<name>M0SUBTAPSEL</name>							
				<description>JTAG debug disable for M0SUB co-processor. If this bit is set to 1, it can be changed to 0 only through a chip reset.</description>							
				<bitRange>[10:10]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>NO_EFFECT</name>					
						<description>No effect.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>DISABLE_JTAG_DEBUG</name>					
						<description>Disable JTAG debug. Once JTAG is disabled, JTAG access remains disabled until the chip is reset by any source.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>M4TAPSEL</name>							
				<description>JTAG debug disable for M4 main processor. If this bit is set to 1, it can be changed to 0 only through a chip reset.</description>							
				<bitRange>[11:11]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>NO_EFFECT</name>					
						<description>No effect.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>DISABLE_JTAG_DEBUG</name>					
						<description>Disable JTAG debug. Once JTAG is disabled, JTAG access remains disabled until the chip is reset by any source.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>M0APPTAPSEL</name>							
				<description>JTAG debug disable for M0APPco-processor. If this bit is set to 1, it can be changed to 0 only through a chip reset.</description>							
				<bitRange>[12:12]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>NO_EFFECT</name>					
						<description>No effect.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>DISABLE_JTAG_DEBUG</name>					
						<description>Disable JTAG debug. Once JTAG is disabled, JTAG access remains disabled until the chip is reset by any source.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved.</description>							
				<bitRange>[31:13]</bitRange>							
						
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>DMAMUX</name>									
		<description>DMA mux control</description>									
		<addressOffset>0x11C</addressOffset>									
		<access>read-write</access>									
		<resetValue>0</resetValue>									
		<resetMask>0x00000000</resetMask>									
		<fields>									
			<field>								
				<name>DMAMUXPER0</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 0.</description>							
				<bitRange>[1:0]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>SPIFI</name>					
						<description>SPIFI</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SCT_CTOUT_2</name>					
						<description>SCT CTOUT_2</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SGPIO14</name>					
						<description>SGPIO14</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>TIMER3_MATCH_1</name>					
						<description>Timer3 match 1</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER1</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 1</description>							
				<bitRange>[3:2]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>TIMER0_MATCH_0</name>					
						<description>Timer0 match 0</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>USART0_TRANSMIT</name>					
						<description>USART0 transmit</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RESERVED</name>					
						<description>Reserved</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RESERVED</name>					
						<description>Reserved</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER2</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 2.</description>							
				<bitRange>[5:4]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>TIMER0_MATCH_1</name>					
						<description>Timer0 match 1</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>USART0_RECEIVE</name>					
						<description>USART0 receive</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RESERVED</name>					
						<description>Reserved</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RESERVED</name>					
						<description>Reserved</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER3</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 3.</description>							
				<bitRange>[7:6]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>TIMER1_MATCH_0</name>					
						<description>Timer1 match 0</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>UART1_TRANSMIT</name>					
						<description>UART1 transmit</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>I2S1_DMA_REQUEST_1</name>					
						<description>I2S1 DMA request 1</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SSP1_TRANSMIT</name>					
						<description>SSP1 transmit</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER4</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 4.</description>							
				<bitRange>[9:8]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>TIMER1_MATCH_1</name>					
						<description>Timer1 match 1</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>UART1_RECEIVE</name>					
						<description>UART1 receive</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>I2S1_DMA_REQUEST_2</name>					
						<description>I2S1 DMA request 2</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SSP1_RECEIVE</name>					
						<description>SSP1 receive</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER5</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 5.</description>							
				<bitRange>[11:10]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>TIMER2_MATCH_0</name>					
						<description>Timer2 match 0</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>USART2_TRANSMIT</name>					
						<description>USART2 transmit</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SSP1_TRANSMIT</name>					
						<description>SSP1 transmit</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SGPIO15</name>					
						<description>SGPIO15</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER6</name>							
				<description>Selects DMA to peripheral connection for DMA peripheral 6.</description>							
				<bitRange>[13:12]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>TIMER2_MATCH_1</name>					
						<description>Timer2 match 1</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>USART2_RECEIVE</name>					
						<description>USART2 receive</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SSP1_RECEIVE</name>					
						<description>SSP1 receive</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SGPIO14</name>					
						<description>SGPIO14</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER7</name>							
				<description>Selects DMA to peripheral connection for DMA peripheral 7.</description>							
				<bitRange>[15:14]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>TIMER3_MATCH_0</name>					
						<description>Timer3 match 0</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>USART3_TRANSMIT</name>					
						<description>USART3 transmit</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SCT_DMA_REQUEST_0</name>					
						<description>SCT DMA request 0</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>ADCHS_WRITE</name>					
						<description>ADCHS write</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER8</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 8.</description>							
				<bitRange>[17:16]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>TIMER3_MATCH_1</name>					
						<description>Timer3 match 1</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>USART3_RECEIVE</name>					
						<description>USART3 receive</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SCT_DMA_REQUEST_1</name>					
						<description>SCT DMA request 1</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>ADCHS_READ</name>					
						<description>ADCHS read</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER9</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 9.</description>							
				<bitRange>[19:18]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>SSP0_RECEIVE</name>					
						<description>SSP0 receive</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>I2S0_DMA_REQUEST_1</name>					
						<description>I2S0 DMA request 1</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SCT_DMA_REQUEST_1</name>					
						<description>SCT DMA request 1</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RESERVED</name>					
						<description>Reserved</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER10</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 10.</description>							
				<bitRange>[21:20]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>SSP0_TRANSMIT</name>					
						<description>SSP0 transmit</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>I2S0_DMA_REQUEST_2</name>					
						<description>I2S0 DMA request 2</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SCT_DMA_REQUEST_0</name>					
						<description>SCT DMA request 0</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RESERVED</name>					
						<description>Reserved</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER11</name>							
				<description>Selects DMA to peripheral connection for DMA peripheral 11.</description>							
				<bitRange>[23:22]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>SSP1_RECEIVE</name>					
						<description>SSP1 receive</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SGPIO14</name>					
						<description>SGPIO14</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>USART0_TRANSMIT</name>					
						<description>USART0 transmit</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RESERVED</name>					
						<description>Reserved</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER12</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 12.</description>							
				<bitRange>[25:24]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>SSP1_TRANSMIT</name>					
						<description>SSP1 transmit</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SGPIO15</name>					
						<description>SGPIO15</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>USART0_RECEIVE</name>					
						<description>USART0 receive</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RESERVED</name>					
						<description>Reserved</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER13</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 13.</description>							
				<bitRange>[27:26]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>ADC0</name>					
						<description>ADC0</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RESERVED</name>					
						<description>Reserved</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SSP1_RECEIVE</name>					
						<description>SSP1 receive</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>USART3_RECEIVE</name>					
						<description>USART3 receive</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER14</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 14.</description>							
				<bitRange>[29:28]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>ADC1</name>					
						<description>ADC1</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RESERVED</name>					
						<description>Reserved</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SSP1_TRANSMIT</name>					
						<description>SSP1 transmit</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>USART3_TRANSMIT</name>					
						<description>USART3 transmit</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>DMAMUXPER15</name>							
				<description>Select DMA to peripheral connection for DMA peripheral 15.</description>							
				<bitRange>[31:30]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>DAC</name>					
						<description>DAC</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SCT_CTOUT_3</name>					
						<description>SCT CTOUT_3</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SGPIO15</name>					
						<description>SGPIO15</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>TIMER3_MATCH_0</name>					
						<description>Timer3 match 0</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>FLASHCFGA</name>									
		<description>Flash accelerator configuration register for flash bank A</description>									
		<addressOffset>0x120</addressOffset>									
		<access>read-write</access>									
		<resetValue>0x8000F03A</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. Do not change these bits from the reset value.</description>							
				<bitRange>[11:0]</bitRange>							
						
