cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>								
			<field>								
				<name>FLASHTIM</name>							
				<description>Flash access time. The value of this field plus 1 gives the number of BASE_M4_CLK clocks used for a flash access. Warning: Improper setting of this value may result in incorrect operation of the device. All other values are allowed but may not be optimal for the supported clock frequencies.</description>							
				<bitRange>[15:12]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>1_BASE_M4_CLK_CLOCK</name>					
						<description>1 BASE_M4_CLK clock. Use for BASE_M4_CLK up to 21 MHz.</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>2_BASE_M4_CLK_CLOCKS</name>					
						<description>2 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 43 MHz.</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>3_BASE_M4_CLK_CLOCKS</name>					
						<description>3 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 64 MHz.</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>4_BASE_M4_CLK_CLOCKS</name>					
						<description>4 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 86 MHz.</description>					
						<value>0x3</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>5_BASE_M4_CLK_CLOCKS</name>					
						<description>5 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 107 MHz.</description>					
						<value>0x4</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>6_BASE_M4_CLK_CLOCKS</name>					
						<description>6 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 129 MHz.</description>					
						<value>0x5</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>7_BASE_M4_CLK_CLOCKS</name>					
						<description>7 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 150 MHz.</description>					
						<value>0x6</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>8_BASE_M4_CLK_CLOCKS</name>					
						<description>8 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 172 MHz.</description>					
						<value>0x7</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>9_BASE_M4_CLK_CLOCKS</name>					
						<description>9 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 193 MHz.</description>					
						<value>0x8</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>10_BASE_M4_CLK_CLOCK</name>					
						<description>10 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 204 MHz. Safe setting for all allowed conditions.</description>					
						<value>0x9</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. Write zeros only to these bits.</description>							
				<bitRange>[30:16]</bitRange>							
						
			</field>								
			<field>								
				<name>POW</name>							
				<description>Flash bank A power control</description>							
				<bitRange>[31:31]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>POWER_DOWN</name>					
						<description>Power-down</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>ACTIVE</name>					
						<description>Active (Default)</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>FLASHCFGB</name>									
		<description>Flash accelerator configuration register for flash bank B</description>									
		<addressOffset>0x124</addressOffset>									
		<access>read-write</access>									
		<resetValue>0x8000F03A</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. Do not change these bits from the reset value.</description>							
				<bitRange>[11:0]</bitRange>							
						
			</field>								
			<field>								
				<name>FLASHTIM</name>							
				<description>Flash access time. The value of this field plus 1 gives the number of BASE_M4_CLK clocks used for a flash access. Warning: Improper setting of this value may result in incorrect operation of the device. All other values are allowed but may not be optimal for the supported clock frequencies.</description>							
				<bitRange>[15:12]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>1_BASE_M4_CLK_CLOCK</name>					
						<description>1 BASE_M4_CLK clock. Use for BASE_M4_CLK up to 21 MHz.</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>2_BASE_M4_CLK_CLOCKS</name>					
						<description>2 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 43 MHz.</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>3_BASE_M4_CLK_CLOCKS</name>					
						<description>3 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 64 MHz.</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>4_BASE_M4_CLK_CLOCKS</name>					
						<description>4 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 86 MHz.</description>					
						<value>0x3</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>5_BASE_M4_CLK_CLOCKS</name>					
						<description>5 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 107 MHz.</description>					
						<value>0x4</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>6_BASE_M4_CLK_CLOCKS</name>					
						<description>6 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 129 MHz.</description>					
						<value>0x5</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>7_BASE_M4_CLK_CLOCKS</name>					
						<description>7 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 150 MHz.</description>					
						<value>0x6</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>8_BASE_M4_CLK_CLOCKS</name>					
						<description>8 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 172 MHz.</description>					
						<value>0x7</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>9_BASE_M4_CLK_CLOCKS</name>					
						<description>9 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 193 MHz.</description>					
						<value>0x8</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>10_BASE_M4_CLK_CLOCK</name>					
						<description>10 BASE_M4_CLK clocks. Use for BASE_M4_CLK up to 204 MHz. Safe setting for all allowed conditions.</description>					
						<value>0x9</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. Write zeros only to these bits.</description>							
				<bitRange>[30:16]</bitRange>							
						
