cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>								
			<field>								
				<name>POW</name>							
				<description>Flash bank A power control</description>							
				<bitRange>[31:31]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>POWER_DOWN</name>					
						<description>Power-down</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>ACTIVE</name>					
						<description>Active (Default)</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>ETBCFG</name>									
		<description>ETB RAM configuration</description>									
		<addressOffset>0x128</addressOffset>									
		<access>read-write</access>									
		<resetValue>0x1</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>ETB</name>							
				<description>Select SRAM interface</description>							
				<bitRange>[0:0]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>ETB_ACCESSES_SRAM_AT</name>					
						<description>ETB accesses SRAM at address 0x2000 C000.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>AHB_ACCESSES_SRAM_AT</name>					
						<description>AHB accesses SRAM at address 0x2000 C000.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved.</description>							
				<bitRange>[31:1]</bitRange>							
						
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>CREG6</name>									
		<description>Chip configuration register 6. Controls multiple functions : Ethernet interface, SCT output, I2S0/1 inputs, EMC clock.</description>									
		<addressOffset>0x12C</addressOffset>									
		<access>read-write</access>									
		<resetValue>0</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>ETHMODE</name>							
				<description>Selects the Ethernet mode. Reset the ethernet after changing the PHY interface. All other settings are reserved.</description>							
				<bitRange>[2:0]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>MII</name>					
						<description>MII</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>RMII</name>					
						<description>RMII</description>					
						<value>0x4</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved.</description>							
				<bitRange>[3:3]</bitRange>							
						
			</field>								
			<field>								
				<name>CTOUTCTRL</name>							
				<description>Selects the functionality of the SCT outputs.</description>							
				<bitRange>[4:4]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>COMBINE_SCT_AND_TIME</name>					
						<description>Combine SCT and timer match outputs. SCT outputs are Red with timer outputs.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>SCT_OUTPUTS_ONLY</name>					
						<description>SCT outputs only. SCT outputs are used without timer match outputs.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved.</description>							
				<bitRange>[11:5]</bitRange>							
						
			</field>								
			<field>								
				<name>I2S0_TX_SCK_IN_SEL</name>							
				<description>I2S0_TX_SCK input select</description>							
				<bitRange>[12:12]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>I2S_REGISTER</name>					
						<description>I2S Register. I2S clock selected as defined by the I2S transmit mode register Table 960.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>BASE_AUDIO_CLK_FOR_I</name>					
						<description>BASE_AUDIO_CLK for I2S transmit clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>I2S0_RX_SCK_IN_SEL</name>							
				<description>I2S0_RX_SCK input select</description>							
				<bitRange>[13:13]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>I2S_REGISTER</name>					
						<description>I2S Register. I2S clock selected as defined by the I2S receive mode register Table 961.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>BASE_AUDIO_CLK_FOR_I</name>					
						<description>BASE_AUDIO_CLK for I2S receive clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>I2S1_TX_SCK_IN_SEL</name>							
				<description>I2S1_TX_SCK input select</description>							
				<bitRange>[14:14]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>I2S_REGISTER</name>					
						<description>I2S register. I2S clock selected as defined by the I2S transmit mode register Table 960.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>BASE_AUDIO_CLK_FOR_I</name>					
						<description>BASE_AUDIO_CLK for I2S transmit clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>I2S1_RX_SCK_IN_SEL</name>							
				<description>I2S1_RX_SCK input select</description>							
				<bitRange>[15:15]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>I2S_REGISTER</name>					
						<description>I2S register. I2S clock selected as defined by the I2S receive mode register Table 961.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>BASE_AUDIO_CLK_FOR_I</name>					
						<description>BASE_AUDIO_CLK for I2S receive clock MCLK input and MCLK output. The I2S must be configured in slave mode.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>EMC_CLK_SEL</name>							
				<description>EMC_CLK divided clock select (see Section 21.1).</description>							
				<bitRange>[16:16]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>DIVIDE_BY_1</name>					
						<description>Divide by 1. EMC_CLK_DIV not divided.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>DIVIDE_BY_2</name>					
						<description>Divide by 2. EMC_CLK_DIV divided by 2.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved.</description>							
				<bitRange>[31:17]</bitRange>							
						
