cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>M4TXEVENT</name>									
		<description>Cortex-M4 TXEV event clear</description>									
		<addressOffset>0x130</addressOffset>									
		<access>read-write</access>									
		<resetValue>0</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>TXEVCLR</name>							
				<description>Cortex-M4 TXEV event.</description>							
				<bitRange>[0:0]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>CLEAR_THE_TXEV_EVENT</name>					
						<description>Clear the TXEV event.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>NO_EFFECT</name>					
						<description>No effect.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved.</description>							
				<bitRange>[31:1]</bitRange>							
						
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>CHIPID</name>									
		<description>Part ID</description>									
		<addressOffset>0x200</addressOffset>									
		<access>read-only</access>									
		<resetValue>0</resetValue>									
		<resetMask>0x00000000</resetMask>									
		<fields>									
			<field>								
				<name>ID</name>							
				<description>Boundary scan ID code 0x5906 002B or 0x6906 002B = LPC4350/30/20/10 (flashless parts) 0x4906 002B = LPC4357/53 (parts with on-chip flash)</description>							
				<bitRange>[31:0]</bitRange>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>M0SUBMEMMAP</name>									
		<description>ARM Cortex-M0SUB memory mapping</description>									
		<addressOffset>0x308</addressOffset>									
		<access>read-write</access>									
		<resetValue>0x18400000</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>M0SUBMAP</name>							
				<description>Shadow address when accessing memory at address 0x0000 0000</description>							
				<bitRange>[31:12]</bitRange>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>M0SUBTXEVENT</name>									
		<description>Cortex-M0SUB TXEV event clear</description>									
		<addressOffset>0x314</addressOffset>									
		<access>read-write</access>									
		<resetValue>0</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>TXEVCLR</name>							
				<description>Cortex-M0SUB TXEV event handling.</description>							
				<bitRange>[0:0]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>CLEAR_THE_TXEV_EVENT</name>					
						<description>Clear the TXEV event.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>NO_EFFECT</name>					
						<description>No effect.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved.</description>							
				<bitRange>[31:1]</bitRange>							
						
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>M0APPTXEVENT</name>									
		<description>Cortex-M0APP TXEV event clear</description>									
		<addressOffset>0x400</addressOffset>									
		<access>read-write</access>									
		<resetValue>0</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>TXEVCLR</name>							
				<description>Cortex-M0APP TXEV event handling.</description>							
				<bitRange>[0:0]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>CLEAR_THE_TXEV_EVENT</name>					
						<description>Clear the TXEV event.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>NO_EFFECT</name>					
						<description>No effect.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved.</description>							
				<bitRange>[31:1]</bitRange>							
						
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>M0APPMEMMAP</name>									
		<description>ARM Cortex-M0APP memory mapping</description>									
		<addressOffset>0x404</addressOffset>									
		<access>read-write</access>									
		<resetValue>0x20000000</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>M0APPMAP</name>							
				<description>Shadow address when accessing memory at address 0x0000 0000</description>							
				<bitRange>[31:12]</bitRange>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>USB0FLADJ</name>									
		<description>USB0 frame length adjust register</description>									
		<addressOffset>0x500</addressOffset>									
		<access>read-write</access>									
		<resetValue>0x20</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>FLTV</name>							
				<description>Frame length timing value The frame length is given in the number of high-speed bit times in decimal format. Each decimal value change to this register corresponds to 16 high-speed bit times. The SOF cycle time (number of SOF counter clock periods to generate a SOF micro-frame length) is equal to 59488 + value in this field. The default value is decimal 32 (0x20), which results in a SOF cycle time of 60000. 0x00 = 59488 (= 59488 + 0 x 16) 0x01 = 59504 (= 59488 + 1 x 16) 0x02 = 59520 (= 59488 + 2 x 16) ... 0x1F = 59984 (= 59488 + 31 x 16) 0x20 = 60000 (= 59488 + 32 x 16) ... 0x3E = 60480 (= 59488 + 62 x 16) 0x3F = 60496 (= 59488 + 63 x 16)</description>							
				<bitRange>[5:0]</bitRange>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved</description>							
				<bitRange>[31:6]</bitRange>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>USB1FLADJ</name>									
		<description>USB1 frame length adjust register</description>									
		<addressOffset>0x600</addressOffset>									
		<access>read-write</access>									
		<resetValue>0x20</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>FLTV</name>							
				<description>Frame length timing value The frame length is given in the number of high-speed bit times in decimal format. Each decimal value change to this register corresponds to 16 high-speed bit times. The SOF cycle time (number of SOF counter clock periods to generate a SOF micro-frame length) is equal to 59488 + value in this field. The default value is decimal 32 (0x20), which results in a SOF cycle time of 60000. 0x00 = 59488 (= 59488 + 0 x 16) 0x01 = 59504 (= 59488 + 1 x 16) 0x02 = 59520 (= 59488 + 2 x 16) ... 0x1F = 59984 (= 59488 + 31 x 16) 0x20 = 60000 (= 59488 + 32 x 16) ... 0x3E = 60480 (= 59488 + 62 x 16) 0x3F = 60496 (= 59488 + 63 x 16)</description>							
				<bitRange>[5:0]</bitRange>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved</description>							
				<bitRange>[31:6]</bitRange>							
			</field>								
		</fields>									
	</register>										
