cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
</registers>											

</peripheral>
<peripheral>
	<name>EVENTROUTER</name>
	<description>Event router</description>
	<groupName>EVENTROUTER</groupName>
	<baseAddress>0x40044000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>EVENTROUTER</name>
	<value>42</value>
	</interrupt>
	<registers>													
	<register>												
		<name>HILO</name>											
		<description>Level configuration register</description>											
		<addressOffset>0x000</addressOffset>											
		<access>read-write</access>											
		<resetValue>0x000</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>WAKEUP0_L</name>									
				<description>Level detect mode for WAKEUP0 event.</description>									
				<bitRange>[0:0]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level on the WAKEUP0 pin if bit 0 in the EDGE register is 0. Detect falling edge if bit 0 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level on the WAKEUP0 pin if bit 0 in the EDGE register is 0. Detect rising edge if bit 0 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>WAKEUP1_L</name>									
				<description>Level detect mode for WAKEUP1 event. The corresponding bit in the EDGE register must be 0.</description>									
				<bitRange>[1:1]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level on the WAKEUP1 pin if bit 1 in the EDGE register is 0.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level on the WAKEUP1 pin if bit 1 in the EDGE register is 0. Detect rising edge if bit 1 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>WAKEUP2_L</name>									
				<description>Level detect mode for WAKEUP2 event.</description>									
				<bitRange>[2:2]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level on the WAKEUP2 pin if bit 2 in the EDGE register is 0. Detect falling edge if bit 2 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level on the WAKEUP2 pin if bit 2 in the EDGE register is 0. Detect rising edge if bit 2 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>WAKEUP3_L</name>									
				<description>Level detect mode for WAKEUP3 event.</description>									
				<bitRange>[3:3]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level on the WAKEUP3 pin if bit 3 in the EDGE register is 0. Detect falling edge if bit 3 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level on the WAKEUP3 pin if bit 3 in the EDGE register is 0. Detect rising edge if bit 3 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>ATIMER_L</name>									
				<description>Level detect mode for alarm timer event.</description>									
				<bitRange>[4:4]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of the alarm timer interrupt if bit 4 in the EDGE register is 0. Detect falling edge if bit 4 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of the alarm timer interrupt if bit 4 in the EDGE register is 0. Detect rising edge if bit 4 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RTC_L</name>									
				<description>Level detect mode for RTC event.</description>									
				<bitRange>[5:5]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of the RTC interrupt if bit 5 in the EDGE register is 0. Detect falling edge if bit 5 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of the RTC interrupt if bit 5 in the EDGE register is 0. Detect rising edge if bit 5 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>BOD_L</name>									
				<description>Level detect mode for BOD event.</description>									
				<bitRange>[6:6]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of the BOD interrupt if bit 6 in the EDGE register is 0. Detect falling edge if bit 6 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of the BOD interrupt if bit 6 in the EDGE register is 0. Detect rising edge if bit 6 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>WWDT_L</name>									
				<description>Level detect mode for WWDT event.</description>									
				<bitRange>[7:7]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of the WWDT interrupt if bit 7 in the EDGE register is 0. Detect falling edge if bit 7 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of the WWDT interrupt if bit 7 in the EDGE register is 0. Detect rising edge if bit 7 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>ETH_L</name>									
				<description>Level detect mode for Ethernet event</description>									
				<bitRange>[8:8]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of the Ethernet interrupt if bit 8 in the EDGE register is 0. Detect falling edge if bit 8 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of the Ethernet interrupt if bit 8 in the EDGE register is 0. Detect rising edge if bit 8 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>USB0_L</name>									
				<description>Level detect mode for USB0 event</description>									
				<bitRange>[9:9]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of the USB0 interrupt if bit 9 in the EDGE register is 0. Detect falling edge if bit 9 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of the USB0 interrupt if bit 9 in the EDGE register is 0. Detect rising edge if bit 9 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>USB1_L</name>									
				<description>Level detect mode for USB1 event</description>									
				<bitRange>[10:10]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of the USB1 interrupt if bit 10 in the EDGE register is 0. Detect falling edge if bit 10 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of the USB1 interrupt if bit 10 in the EDGE register is 0. Detect rising edge if bit 10 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>SDMMC_L</name>									
				<description>Level detect mode for SD/MMC event</description>									
				<bitRange>[11:11]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of the SD/MMC interrupt if bit 11 in the EDGE register is 0. Detect falling edge if bit 11 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of the SD/MMC interrupt if bit 11 in the EDGE register is 0. Detect rising edge if bit 11 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>CAN_L</name>									
				<description>Level detect mode for C_CAN event.</description>									
				<bitRange>[12:12]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of the combined C_CAN interrupt if bit 12 in the EDGE register is 0. Detect falling edge if bit 12 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of the combined C_CAN interrupt if bit 12 in the EDGE register is 0. Detect rising edge if bit 12 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>TIM2_L</name>									
				<description>Level detect mode for combined timer output 2 event.</description>									
				<bitRange>[13:13]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level GIMA output 25 if bit 13 in the EDGE register is 0. Detect falling edge if bit 13 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level GIMA output 25 if bit 13 in the EDGE register is 0. Detect rising edge if bit 13 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>TIM6_L</name>									
				<description>Level detect mode for combined timer output 6 event.</description>									
				<bitRange>[14:14]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of GIMA output 26 if bit 14 in the EDGE register is 0. Detect falling edge if bit 14 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of GIMA output 26 if bit 14 in the EDGE register is 0. Detect rising edge if bit 14 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>QEI_L</name>									
				<description>Level detect mode for QEI event.</description>									
				<bitRange>[15:15]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of the QEI interrupt if bit 15 in the EDGE register is 0. Detect falling edge if bit 15 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of the QEI interrupt if bit 15 in the EDGE register is 0. Detect rising edge if bit 15 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>TIM14_L</name>									
				<description>Level detect mode for combined timer output 14 event.</description>									
				<bitRange>[16:16]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>DETECT_LOW_LEVEL</name>							
						<description>Detect LOW level of GIMA output 27 if bit 16 in the EDGE register is 0. Detect falling edge if bit 16 in the EDGE register is 1.</description>							
						<value>0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>DETECT_HIGH_LEVEL</name>							
						<description>Detect HIGH level of GIMA output 27 if bit 16 in the EDGE register is 0. Detect rising edge if bit 16 in the EDGE register is 1.</description>							
						<value>1</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved.</description>									
				<bitRange>[18:17]</bitRange>									
												
