cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>								
			<field>								
				<name>ERMODE</name>							
				<description>Controls enabling the Event Monitor/Recorder and selecting its operating frequency. Event Monitor/Recorder registers can always be written to regardless of the state of these bits. Events occurring during the 1-sec interval immediately following enabling of the clocks may not be recognized.</description>							
				<bitRange>[31:30]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>DISABLE_EVENT_MONITO</name>					
						<description>Disable Event Monitor/Recorder clocks. Operation of the Event Monitor/Recorder is disabled except for asynchronous clearing of GP registers if selected.</description>					
						<value>0x0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>16_HZ_SAMPLE_CLOCK</name>					
						<description>16 Hz sample clock. Enable Event Monitor/Recorder and select a 16 Hz sample clock for event input edge detection and glitch suppression. Pulses (in either direction) shorter than 62.5 ms to 125 ms will be filtered out.</description>					
						<value>0x1</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>64_HZ_SAMPLE_CLOCK</name>					
						<description>64 Hz sample clock. Enable Event Monitor/Recorder and select a 64 Hz sample clock for event input edge detection and glitch suppression. Pulses (in either direction) shorter than 15.6 ms to 31.2 ms will be filtered out.</description>					
						<value>0x2</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>1_KHZ_SAMPLE_CLOCK</name>					
						<description>1 kHz sample clock. Enable Event Monitor/Recorder and select a 1 kHz sample clock for event input edge detection and glitch suppression. Pulses (in either direction) shorter than 1 ms to 2 ms will be filtered out.</description>					
						<value>0x3</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>ERSTATUS</name>									
		<description>Event Monitor/Recorder Status register. Contains status flags for event channels and other Event Monitor/Recorder conditions.</description>									
		<addressOffset>0x080</addressOffset>									
		<access>read-write</access>									
		<resetValue>0</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>EV0</name>							
				<description>Channel0 event flag (WAKEUP0 pin). Set at the end of any second if there has been an event during the preceding second. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>							
				<bitRange>[0:0]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>NO_CHANGE</name>					
						<description>No event change on channel 0.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>EVENT</name>					
						<description>At least one event has occurred on channel 0.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>EV1</name>							
				<description>Channel1 Event flag (WAKEUP1 pin). Set at the end of any second if there has been an event during the preceding second. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>							
				<bitRange>[1:1]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>NO_CHANGE</name>					
						<description>No event change on channel 1.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>EVENT</name>					
						<description>At least one event has occurred on channel 1.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>EV2</name>							
				<description>Channel2 Event flag (WAKEUP2 pin). Set at the end of any second if there has been an event during the preceding second. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>							
				<bitRange>[2:2]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>NO_CHANGE</name>					
						<description>No event change on channel 2.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>EVENT</name>					
						<description>At least one event has occurred on channel 2.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>GP_CLEARED</name>							
				<description>General purpose register asynchronous clear flag. This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>							
				<bitRange>[3:3]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>NO_CHANGE</name>					
						<description>General purpose registers have not been asynchronous cleared.</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>EVENT</name>					
						<description>General purpose registers have been asynchronous cleared.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. Read value is undefined, only zero should be written.</description>							
				<bitRange>[30:4]</bitRange>							
									
