cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>								
			<field>								
				<name>WAKEUP</name>							
				<description>Interrupt/wake-up request flag (Read-only). This bit is cleared by writing a 1 to it. Writing 0 has no effect.</description>							
				<bitRange>[31:31]</bitRange>							
				<enumeratedValues>							
				<name>ENUM</name>							
					<enumeratedValue>						
						<name>NOINTERRUPTWAKEUP</name>					
						<description>No interrupt/wake-up request is pending</description>					
						<value>0</value>					
					</enumeratedValue>						
					<enumeratedValue>						
						<name>INTERRUPTWAKEUP</name>					
						<description>An interrupt/wake-up request is pending.</description>					
						<value>1</value>					
					</enumeratedValue>						
				</enumeratedValues>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<name>ERCOUNTERS</name>									
		<description>Event Monitor/Recorder Counters register. Allows reading the counters associated with the event channels.</description>									
		<addressOffset>0x088</addressOffset>									
		<access>read-only</access>									
		<resetValue>0</resetValue>									
		<resetMask>0xFFFFFFFF</resetMask>									
		<fields>									
			<field>								
				<name>COUNTER0</name>							
				<description>Value of the counter for Event 0. If the counter reaches full count (the value 7), it remains there if additional events occur. This counter is cleared when the corresponding EVx bit in the ERSTATUS register is cleared by software.</description>							
				<bitRange>[2:0]</bitRange>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. The value read from a reserved bit is not defined.</description>							
				<bitRange>[7:3]</bitRange>							
			</field>								
			<field>								
				<name>COUNTER1</name>							
				<description>Value of the counter for event 1. See description for COUNTER0.</description>							
				<bitRange>[10:8]</bitRange>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. The value read from a reserved bit is not defined.</description>							
				<bitRange>[15:11]</bitRange>							
			</field>								
			<field>								
				<name>COUNTER2</name>							
				<description>Value of the counter for event 2. See description for COUNTER0.</description>							
				<bitRange>[18:16]</bitRange>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. The value read from a reserved bit is not defined.</description>							
				<bitRange>[31:19]</bitRange>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<dim>3</dim>									
		<dimIncrement>0x4</dimIncrement>									
		<dimIndex>0-2</dimIndex>									
		<name>ERFIRSTSTAMP%s</name>									
		<description>Event Monitor/Recorder First Stamp register for channel 0. Retains the time stamp for the first event on channel 0.</description>									
		<addressOffset>0x090</addressOffset>									
		<access>read-only</access>									
		<resetValue>0</resetValue>									
		<resetMask>0x00000000</resetMask>									
		<fields>									
			<field>								
				<name>SEC</name>							
				<description>Seconds value in the range of 0 to 59.</description>							
				<bitRange>[5:0]</bitRange>							
			</field>								
			<field>								
				<name>MIN</name>							
				<description>Minutes value in the range of 0 to 59.</description>							
				<bitRange>[11:6]</bitRange>							
			</field>								
			<field>								
				<name>HOUR</name>							
				<description>Hours value in the range of 0 to 23.</description>							
				<bitRange>[16:12]</bitRange>							
			</field>								
			<field>								
				<name>DOY</name>							
				<description>Day of Year value in the range of 1 to 366.</description>							
				<bitRange>[25:17]</bitRange>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. The value read from a reserved bit is not defined.</description>							
				<bitRange>[31:26]</bitRange>							
			</field>								
		</fields>									
	</register>										
	<register>										
		<dim>3</dim>									
		<dimIncrement>0x4</dimIncrement>									
		<dimIndex>0-2</dimIndex>									
		<name>ERLASTSTAMP%s</name>									
		<description>Event Monitor/Recorder Last Stamp register for channel 0. Retains the time stamp for the last (i.e. most recent) event on channel 0.</description>									
		<addressOffset>0x0A0</addressOffset>									
		<access>read-only</access>									
		<resetValue>0</resetValue>									
		<resetMask>0x00000000</resetMask>									
		<fields>									
			<field>								
				<name>SEC</name>							
				<description>Seconds value in the range of 0 to 59.</description>							
				<bitRange>[5:0]</bitRange>							
			</field>								
			<field>								
				<name>MIN</name>							
				<description>Minutes value in the range of 0 to 59.</description>							
				<bitRange>[11:6]</bitRange>							
			</field>								
			<field>								
				<name>HOUR</name>							
				<description>Hours value in the range of 0 to 23.</description>							
				<bitRange>[16:12]</bitRange>							
			</field>								
			<field>								
				<name>DOY</name>							
				<description>Day of Year value in the range of 1 to 366.</description>							
				<bitRange>[25:17]</bitRange>							
			</field>								
			<field>								
				<name>RESERVED</name>							
				<description>Reserved. The value read from a reserved bit is not defined.</description>							
				<bitRange>[31:26]</bitRange>							
			</field>								
		</fields>									
	</register>										

			</registers>
		</peripheral>
		<peripheral>
			<name>CGU</name>
			<description>Clock Generation Unit (CGU)</description>
			<groupName>CGU</groupName>
			<baseAddress>0x40050000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				
				
				
				
				
			<register>															
	<name>FREQ_MON</name>														
	<description>Frequency monitor register</description>														
	<addressOffset>0x014</addressOffset>														
	<access>read-write</access>														
	<resetValue>0</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>RCNT</name>												
			<description>9-bit reference clock-counter value</description>												
			<bitRange>[8:0]</bitRange>												
											
