cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL0USB_MDIV</name>														
	<description>PLL0USB M-divider register</description>														
	<addressOffset>0x024</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x05F85B6A</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>MDEC</name>												
			<description>Decoded M-divider coefficient value. Select values for the M-divider between 1 and 131071.</description>												
			<bitRange>[16:0]</bitRange>												
		</field>													
		<field>													
			<name>SELP</name>												
			<description>Bandwidth select P value</description>												
			<bitRange>[21:17]</bitRange>												
		</field>													
		<field>													
			<name>SELI</name>												
			<description>Bandwidth select I value</description>												
			<bitRange>[27:22]</bitRange>												
		</field>													
		<field>													
			<name>SELR</name>												
			<description>Bandwidth select R value; SELR = 0.</description>												
			<bitRange>[31:28]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL0USB_NP_DIV</name>														
	<description>PLL0USB N/P-divider register</description>														
	<addressOffset>0x028</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x000B1002</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>PDEC</name>												
			<description>Decoded P-divider coefficient value</description>												
			<bitRange>[6:0]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[11:7]</bitRange>												
		</field>													
		<field>													
			<name>NDEC</name>												
			<description>Decoded N-divider coefficient value</description>												
			<bitRange>[21:12]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:22]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL0AUDIO_STAT</name>														
	<description>PLL0AUDIO status register</description>														
	<addressOffset>0x02C</addressOffset>														
	<access>read-only</access>														
	<resetValue>0x01000000</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>LOCK</name>												
			<description>PLL0 lock indicator</description>												
			<bitRange>[0:0]</bitRange>												
		</field>													
		<field>													
			<name>FR</name>												
			<description>PLL0 free running indicator</description>												
			<bitRange>[1:1]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:2]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL0AUDIO_CTRL</name>														
	<description>PLL0AUDIO control register</description>														
	<addressOffset>0x030</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x01004003</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>PD</name>												
			<description>PLL0 power down</description>												
			<bitRange>[0:0]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>PLL0_ENABLED</name>										
					<description>PLL0 enabled</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL0_POWERED_DOWN</name>										
					<description>PLL0 powered down</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>BYPASS</name>												
			<description>Input clock bypass control</description>												
			<bitRange>[1:1]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>CCO_CLOCK_SENT_TO_PO</name>										
					<description>CCO clock sent to post-dividers. Use this in normal operation.</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL0_INPUT_CLOCK_SEN</name>										
					<description>PLL0 input clock sent to post-dividers (default).</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>DIRECTI</name>												
			<description>PLL0 direct input</description>												
			<bitRange>[2:2]</bitRange>												
											
		</field>													
		<field>													
			<name>DIRECTO</name>												
			<description>PLL0 direct output</description>												
			<bitRange>[3:3]</bitRange>												
											
		</field>													
		<field>													
			<name>CLKEN</name>												
			<description>PLL0 clock enable</description>												
			<bitRange>[4:4]</bitRange>												
											
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[5:5]</bitRange>												
											
