cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL0AUDIO_MDIV</name>														
	<description>PLL0AUDIO M-divider register</description>														
	<addressOffset>0x034</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x05F85B6A</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>MDEC</name>												
			<description>Decoded M-divider coefficient value. Select values for the M-divider between 1 and 131071.</description>												
			<bitRange>[16:0]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:17]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL0AUDIO_NP_DIV</name>														
	<description>PLL0AUDIO N/P-divider register</description>														
	<addressOffset>0x038</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x000B1002</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>PDEC</name>												
			<description>Decoded P-divider coefficient value</description>												
			<bitRange>[6:0]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[11:7]</bitRange>												
		</field>													
		<field>													
			<name>NDEC</name>												
			<description>Decoded N-divider coefficient value</description>												
			<bitRange>[21:12]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:22]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL0AUDIO_FRAC</name>														
	<description>PLL0AUDIO fractional divider register</description>														
	<addressOffset>0x03C</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x00200000</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>PLLFRACT_CTRL</name>												
			<description>PLL fractional divider control word</description>												
			<bitRange>[21:0]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:22]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL1_STAT</name>														
	<description>PLL1 status register</description>														
	<addressOffset>0x040</addressOffset>														
	<access>read-only</access>														
	<resetValue>0x01000000</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>LOCK</name>												
			<description>PLL1 lock indicator</description>												
			<bitRange>[0:0]</bitRange>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:1]</bitRange>												
		</field>													
	</fields>														
</register>															
<register>															
	<name>PLL1_CTRL</name>														
	<description>PLL1 control register</description>														
	<addressOffset>0x044</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x01000003</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>PD</name>												
			<description>PLL1 power down</description>												
			<bitRange>[0:0]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>PLL1_ENABLED</name>										
					<description>PLL1 enabled</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL1_POWERED_DOWN</name>										
					<description>PLL1 powered down</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>BYPASS</name>												
			<description>Input clock bypass control</description>												
			<bitRange>[1:1]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>NORMAL</name>										
					<description>Normal. CCO clock sent to post-dividers. Use for normal operation.</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>INPUT_CLOCK</name>										
					<description>Input clock. PLL1 input clock sent to post-dividers (default).</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved. Do not write one to this bit.</description>												
			<bitRange>[2:2]</bitRange>												
											
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved. Do not write one to these bits.</description>												
			<bitRange>[5:3]</bitRange>												
											
