cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
		</field>													
		<field>													
			<name>FBSEL</name>												
			<description>PLL feedback select.</description>												
			<bitRange>[6:6]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>CCO_OUT</name>										
					<description>CCO out. CCO output is used as feedback divider input clock.</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL_OUT</name>										
					<description>PLL out. PLL output clock (clkout) is used as feedback divider input clock. Use for normal operation.</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>DIRECT</name>												
			<description>PLL direct CCO output</description>												
			<bitRange>[7:7]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>DISABLED</name>										
					<description>Disabled</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENABLED</name>										
					<description>Enabled</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>PSEL</name>												
			<description>Post-divider division ratio P. The value applied is 2xP.</description>												
			<bitRange>[9:8]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>1</name>										
					<description>1</description>										
					<value>0x0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PEQ2</name>										
					<description>2 (default)</description>										
					<value>0x1</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PEQ4</name>										
					<description>4</description>										
					<value>0x2</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>8</name>										
					<description>8</description>										
					<value>0x3</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[10:10]</bitRange>												
											
		</field>													
		<field>													
			<name>AUTOBLOCK</name>												
			<description>Block clock automatically during frequency change</description>												
			<bitRange>[11:11]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>DISABLED</name>										
					<description>Disabled. Autoblocking disabled</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENABLED</name>										
					<description>Enabled. Autoblocking enabled</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>NSEL</name>												
			<description>Pre-divider division ratio N</description>												
			<bitRange>[13:12]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>1</name>										
					<description>1</description>										
					<value>0x0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>NEQ2</name>										
					<description>2</description>										
					<value>0x1</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>NEQ3</name>										
					<description>3 (default)</description>										
					<value>0x2</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>4</name>										
					<description>4</description>										
					<value>0x3</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[15:14]</bitRange>												
											
		</field>													
		<field>													
			<name>MSEL</name>												
			<description>Feedback-divider division ratio (M) 00000000 = 1 00000001 = 2  ... 11111111 = 256</description>												
			<bitRange>[23:16]</bitRange>												
											
		</field>													
		<field>													
			<name>CLK_SEL</name>												
			<description>Clock-source selection.</description>												
			<bitRange>[28:24]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>32_KHZ_OSCILLATOR</name>										
					<description>32 kHz oscillator</description>										
					<value>0x00</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IRC_DEFAULT</name>										
					<description>IRC (default)</description>										
					<value>0x01</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENET_RX_CLK</name>										
					<description>ENET_RX_CLK</description>										
					<value>0x02</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENET_TX_CLK</name>										
					<description>ENET_TX_CLK</description>										
					<value>0x03</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>GP_CLKIN</name>										
					<description>GP_CLKIN</description>										
					<value>0x04</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>RESERVED</name>										
					<description>Reserved</description>										
					<value>0x05</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>CRYSTAL_OSCILLATOR</name>										
					<description>Crystal oscillator</description>										
					<value>0x06</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL0USB</name>										
					<description>PLL0USB</description>										
					<value>0x07</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL0AUDIO</name>										
					<description>PLL0AUDIO</description>										
					<value>0x08</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>RESERVED</name>										
					<description>Reserved</description>										
					<value>0x09</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>RESERVED</name>										
					<description>Reserved</description>										
					<value>0x0A</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVA</name>										
					<description>IDIVA</description>										
					<value>0x0C</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVB</name>										
					<description>IDIVB</description>										
					<value>0x0D</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVC</name>										
					<description>IDIVC</description>										
					<value>0x0E</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVD</name>										
					<description>IDIVD</description>										
					<value>0x0F</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IDIVE</name>										
					<description>IDIVE</description>										
					<value>0x10</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:29]</bitRange>												
											
