cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
		</field>													
	</fields>														
</register>															
<register>															
	<name>IDIVA_CTRL</name>														
	<description>Integer divider A control register</description>														
	<addressOffset>0x048</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x01000000</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>PD</name>												
			<description>Integer divider A power down</description>												
			<bitRange>[0:0]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>ENABLED</name>										
					<description>Enabled. IDIVA enabled (default)</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>POWER_DOWN</name>										
					<description>Power-down</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[1:1]</bitRange>												
											
		</field>													
		<field>													
			<name>IDIV</name>												
			<description>Integer divider A divider values  (1/(IDIV + 1))</description>												
			<bitRange>[3:2]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>DIV1</name>										
					<description>1 (default)</description>										
					<value>0x0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>DIV2</name>										
					<description>2</description>										
					<value>0x1</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>DIV3</name>										
					<description>3</description>										
					<value>0x2</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>DIV4</name>										
					<description>4</description>										
					<value>0x3</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[10:4]</bitRange>												
											
		</field>													
		<field>													
			<name>AUTOBLOCK</name>												
			<description>Block clock automatically during frequency change</description>												
			<bitRange>[11:11]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>DISABLED</name>										
					<description>Disabled. Autoblocking disabled</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENABLED</name>										
					<description>Enabled. Autoblocking enabled</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[23:12]</bitRange>												
											
		</field>													
		<field>													
			<name>CLK_SEL</name>												
			<description>Clock source selection. All other values are reserved.</description>												
			<bitRange>[28:24]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>32_KHZ_OSCILLATOR</name>										
					<description>32 kHz oscillator</description>										
					<value>0x00</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>IRC</name>										
					<description>IRC (default)</description>										
					<value>0x01</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENET_RX_CLK</name>										
					<description>ENET_RX_CLK</description>										
					<value>0x02</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>ENET_TX_CLK</name>										
					<description>ENET_TX_CLK</description>										
					<value>0x03</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>GP_CLKIN</name>										
					<description>GP_CLKIN</description>										
					<value>0x04</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>CRYSTAL_OSCILLATOR</name>										
					<description>Crystal oscillator</description>										
					<value>0x06</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL0USB</name>										
					<description>PLL0USB</description>										
					<value>0x07</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL0AUDIO</name>										
					<description>PLL0AUDIO</description>										
					<value>0x08</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>PLL1</name>										
					<description>PLL1</description>										
					<value>0x09</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[31:29]</bitRange>												
											
		</field>													
	</fields>														
</register>															
<register>															
	<name>IDIVB_CTRL</name>														
	<description>Integer divider B control register</description>														
	<addressOffset>0x04C</addressOffset>														
	<access>read-write</access>														
	<resetValue>0x01000000</resetValue>														
	<resetMask>0xFFFFFFFF</resetMask>														
	<fields>														
		<field>													
			<name>PD</name>												
			<description>Integer divider power down</description>												
			<bitRange>[0:0]</bitRange>												
			<enumeratedValues>												
			<name>ENUM</name>												
				<enumeratedValue>											
					<name>ENABLED</name>										
					<description>Enabled. IDIV enabled (default)</description>										
					<value>0</value>										
				</enumeratedValue>											
				<enumeratedValue>											
					<name>POWER_DOWN</name>										
					<description>Power-down</description>										
					<value>1</value>										
				</enumeratedValue>											
			</enumeratedValues>												
		</field>													
		<field>													
			<name>RESERVED</name>												
			<description>Reserved</description>												
			<bitRange>[1:1]</bitRange>												
											
