cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>
							
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_PERIPH_SGPIO_STAT</name>
					<description>CLK_CORE_SGPIO_STAT clock status register</description>
					<addressOffset>0x071C</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>
							
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>
							
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_USB0_STAT</name>
					<description>CLK_USB0 clock status register</description>
					<addressOffset>0x804</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_USB1_STAT</name>
					<description>CLK_USB1 clock status register</description>
					<addressOffset>0x904</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

						</field>
					</fields>
				</register>
				<register>
					<name>CLK_SPI_STAT</name>
					<description>CLK_SPI clock status register</description>
					<addressOffset>0xA04</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>
							
						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>
							
						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>
							
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>
							
						</field>
					</fields>
				</register>
				<register>
					<name>CLK_ADCHS_STAT</name>
					<description>CLK_ADCHS clock status register</description>
					<addressOffset>0xB04</addressOffset>
					<access>read-only</access>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN</name>
							<description>Run enable status 0 = clock is disabled. 1 = clock is enabled.</description>
							<bitRange>[0:0]</bitRange>

						</field>
						<field>
							<name>AUTO</name>
							<description>Auto (AHB disable mechanism) enable status 0 = Auto is disabled. 1 = Auto is enabled.</description>
							<bitRange>[1:1]</bitRange>

						</field>
						<field>
							<name>WAKEUP</name>
							<description>Wake-up mechanism enable status 0 = Wake-up is disabled. 1 = Wake-up is enabled.</description>
							<bitRange>[2:2]</bitRange>

						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved</description>
							<bitRange>[31:3]</bitRange>

