cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
	<register>													
		<name>RESET_STATUS1</name>												
		<description>Reset status register 1</description>												
		<addressOffset>0x114</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x55555555</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>LCD_RST</name>										
				<description>Status of the LCD_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[1:0]</bitRange>										
			</field>											
			<field>											
				<name>USB0_RST</name>										
				<description>Status of the USB0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[3:2]</bitRange>										
			</field>											
			<field>											
				<name>USB1_RST</name>										
				<description>Status of the USB1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[5:4]</bitRange>										
			</field>											
			<field>											
				<name>DMA_RST</name>										
				<description>Status of the DMA_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[7:6]</bitRange>										
			</field>											
			<field>											
				<name>SDIO_RST</name>										
				<description>Status of the SDIO_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[9:8]</bitRange>										
			</field>											
			<field>											
				<name>EMC_RST</name>										
				<description>Status of the EMC_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[11:10]</bitRange>										
			</field>											
			<field>											
				<name>ETHERNET_RST</name>										
				<description>Status of the ETHERNET_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[13:12]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[15:14]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[17:16]</bitRange>										
			</field>											
			<field>											
				<name>FLASHA_RST</name>										
				<description>Status of the FLASHA_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[19:18]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[21:20]</bitRange>										
			</field>											
			<field>											
				<name>EEPROM_RST</name>										
				<description>Status of the EEPROM_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[23:22]</bitRange>										
			</field>											
			<field>											
				<name>GPIO_RST</name>										
				<description>Status of the GPIO_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[25:24]</bitRange>										
			</field>											
			<field>											
				<name>FLASHB_RST</name>										
				<description>Status of the FLASHB_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[27:26]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[29:28]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[31:30]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>RESET_STATUS2</name>												
		<description>Reset status register 2</description>												
		<addressOffset>0x118</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x55555555</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>TIMER0_RST</name>										
				<description>Status of the TIMER0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[1:0]</bitRange>										
			</field>											
			<field>											
				<name>TIMER1_RST</name>										
				<description>Status of the TIMER1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[3:2]</bitRange>										
			</field>											
			<field>											
				<name>TIMER2_RST</name>										
				<description>Status of the TIMER2_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[5:4]</bitRange>										
			</field>											
			<field>											
				<name>TIMER3_RST</name>										
				<description>Status of the TIMER3_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[7:6]</bitRange>										
			</field>											
			<field>											
				<name>RITIMER_RST</name>										
				<description>Status of the RITIMER_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[9:8]</bitRange>										
			</field>											
			<field>											
				<name>SCT_RST</name>										
				<description>Status of the SCT_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[11:10]</bitRange>										
			</field>											
			<field>											
				<name>MOTOCONPWM_RST</name>										
				<description>Status of the MOTOCONPWM_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[13:12]</bitRange>										
			</field>											
			<field>											
				<name>QEI_RST</name>										
				<description>Status of the QEI_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[15:14]</bitRange>										
			</field>											
			<field>											
				<name>ADC0_RST</name>										
				<description>Status of the ADC0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[17:16]</bitRange>										
			</field>											
			<field>											
				<name>ADC1_RST</name>										
				<description>Status of the ADC1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[19:18]</bitRange>										
			</field>											
			<field>											
				<name>DAC_RST</name>										
				<description>Status of the DAC_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[21:20]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[23:22]</bitRange>										
			</field>											
			<field>											
				<name>UART0_RST</name>										
				<description>Status of the UART0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[25:24]</bitRange>										
			</field>											
			<field>											
				<name>UART1_RST</name>										
				<description>Status of the UART1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[27:26]</bitRange>										
			</field>											
			<field>											
				<name>UART2_RST</name>										
				<description>Status of the UART2_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[29:28]</bitRange>										
			</field>											
			<field>											
				<name>UART3_RST</name>										
				<description>Status of the UART3_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[31:30]</bitRange>										
			</field>											
		</fields>												
	</register>													
	<register>													
		<name>RESET_STATUS3</name>												
		<description>Reset status register 3</description>												
		<addressOffset>0x11C</addressOffset>												
		<access>read-write</access>												
		<resetValue>0x55555555</resetValue>												
		<resetMask>0xFFFFFFFF</resetMask>												
		<fields>												
			<field>											
				<name>I2C0_RST</name>										
				<description>Status of the I2C0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[1:0]</bitRange>										
			</field>											
			<field>											
				<name>I2C1_RST</name>										
				<description>Status of the I2C1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[3:2]</bitRange>										
			</field>											
			<field>											
				<name>SSP0_RST</name>										
				<description>Status of the SSP0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[5:4]</bitRange>										
			</field>											
			<field>											
				<name>SSP1_RST</name>										
				<description>Status of the SSP1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[7:6]</bitRange>										
			</field>											
			<field>											
				<name>I2S_RST</name>										
				<description>Status of the I2S_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[9:8]</bitRange>										
			</field>											
			<field>											
				<name>SPIFI_RST</name>										
				<description>Status of the SPIFI_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[11:10]</bitRange>										
			</field>											
			<field>											
				<name>CAN1_RST</name>										
				<description>Status of the CAN1_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[13:12]</bitRange>										
			</field>											
			<field>											
				<name>CAN0_RST</name>										
				<description>Status of the CAN0_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[15:14]</bitRange>										
			</field>											
			<field>											
				<name>M0APP_RST</name>										
				<description>Status of the M0APP_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[17:16]</bitRange>										
			</field>											
			<field>											
				<name>SGPIO_RST</name>										
				<description>Status of the SGPIO_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[19:18]</bitRange>										
			</field>											
			<field>											
				<name>SPI_RST</name>										
				<description>Status of the SPI_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[21:20]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[23:22]</bitRange>										
			</field>											
			<field>											
				<name>ADCHS_RST</name>										
				<description>Status of the ADCHS_RST reset generator output 00 = No reset activated 01 = Reset output activated by input to the reset generator 10 = Reserved 11 = Reset output activated by software write to RESET_CTRL register</description>										
				<bitRange>[25:24]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[27:26]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[29:28]</bitRange>										
			</field>											
			<field>											
				<name>RESERVED</name>										
				<description>Reserved</description>										
				<bitRange>[31:30]</bitRange>										
			</field>											
		</fields>												
	</register>													
