cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>LSR</name>													
		<description>Line Status Register. Contains flags for transmit and receive status, including line errors.</description>													
		<addressOffset>0x014</addressOffset>													
		<access>read-only</access>													
		<resetValue>0x60</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>		
		<readAction>modify</readAction>
		<fields>													
			<field>												
				<name>RDR</name>											
				<description>Receiver Data Ready. LSR[0] is set when the RBR holds an unread character and is cleared when the USART RBR FIFO is empty.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>EMPTY</name>									
						<description>Empty. RBR is empty.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>DATA</name>									
						<description>Data. RBR contains valid data.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>OE</name>											
				<description>Overrun Error. The overrun error condition is set as soon as it occurs. A LSR read clears LSR[1]. LSR[1] is set when USART RSR has a new character assembled and the USART RBR FIFO is full. In this case, the USART RBR FIFO will not be overwritten and the character in the USART RSR will be lost.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>INACTIVE</name>									
						<description>Inactive. Overrun error status is inactive.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ACTIVE</name>									
						<description>Active. Overrun error status is active.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>PE</name>											
				<description>Parity Error. When the parity bit of a received character is in the wrong state, a parity error occurs. A LSR read clears LSR[2]. Time of parity error detection is dependent on FCR[0]. Note: A parity error is associated with the character at the top of the USART RBR FIFO.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>INACTIVE</name>									
						<description>Inactive. Parity error status is inactive.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ACTIVE</name>									
						<description>Active. Parity error status is active.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>FE</name>											
				<description>Framing Error. When the stop bit of a received character is a logic 0, a framing error occurs. A LSR read clears LSR[3]. The time of the framing error detection is dependent on FCR0. Upon detection of a framing error, the RX will attempt to re-synchronize to the data and assume that the bad stop bit is actually an early start bit. However, it cannot be assumed that the next received byte will be correct even if there is no Framing Error. Note: A framing error is associated with the character at the top of the USART RBR FIFO.</description>											
				<bitRange>[3:3]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>INACTIVE</name>									
						<description>Inactive. Framing error status is inactive.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ACTIVE</name>									
						<description>Active. Framing error status is active.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>BI</name>											
				<description>Break Interrupt. When RXD1 is held in the spacing state (all zeros) for one full character transmission (start, data, parity, stop), a break interrupt occurs. Once the break condition has been detected, the receiver goes idle until RXD1 goes to marking state (all ones). A LSR read clears this status bit. The time of break detection is dependent on FCR[0]. Note: The break interrupt is associated with the character at the top of the USART RBR FIFO.</description>											
				<bitRange>[4:4]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>INACTIVE</name>									
						<description>Inactive. Break interrupt status is inactive.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ACTIVE</name>									
						<description>Active. Break interrupt status is active.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>THRE</name>											
				<description>Transmitter Holding Register Empty. THRE is set immediately upon detection of an empty USART THR and is cleared on a THR write.</description>											
				<bitRange>[5:5]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NOT_EMPTY</name>									
						<description>Not empty. THR contains valid data.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>EMPTY</name>									
						<description>Empty. THR is empty.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>TEMT</name>											
				<description>Transmitter Empty. TEMT is set when both THR and TSR are empty; TEMT is cleared when either the TSR or the THR contain valid data.</description>											
				<bitRange>[6:6]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NOT_EMPTY</name>									
						<description>Not empty. THR and/or the TSR contains valid data.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>EMPTY</name>									
						<description>Empty. THR and the TSR are empty.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RXFE</name>											
				<description>Error in RX FIFO. LSR[7] is set when a character with a RX error such as framing error, parity error or break interrupt, is loaded into the RBR. This bit is cleared when the LSR register is read and there are no subsequent errors in the USART FIFO.</description>											
				<bitRange>[7:7]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_ERROR</name>									
						<description>No error. RBR contains no USART RX errors or FCR[0]=0.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ERROR</name>									
						<description>Error. USART RBR contains at least one USART RX error.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>TXERR</name>											
				<description>Error in transmitted character.   A NACK response is given by the receiver in Smart card T=0 mode. This bit is cleared when the LSR register is read.</description>											
				<bitRange>[8:8]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>NO_ERROR</name>									
						<description>No error. No error (normal default condition).</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>NACK</name>									
						<description>NACK. A NACK response is received during Smart card T=0 operation.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved</description>											
				<bitRange>[31:9]</bitRange>											
										
