cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:6]</bitRange>											
										
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>FDR</name>													
		<description>Fractional Divider Register. Generates a clock input for the baud rate divider.</description>													
		<addressOffset>0x028</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x10</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>DIVADDVAL</name>											
				<description>Baud rate generation pre-scaler divisor value.  If this field is 0, fractional baud rate generator will not impact the USART baud rate.</description>											
				<bitRange>[3:0]</bitRange>											
			</field>												
			<field>												
				<name>MULVAL</name>											
				<description>Baud rate pre-scaler multiplier value.  This field must be greater or equal 1 for USART to operate properly, regardless of whether the fractional baud rate generator is used or not.</description>											
				<bitRange>[7:4]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:8]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>OSR</name>													
		<description>Oversampling Register. Controls the degree of oversampling during each bit time.</description>													
		<addressOffset>0x02C</addressOffset>													
		<access>read-write</access>													
		<resetValue>0xF0</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[0:0]</bitRange>											
			</field>												
			<field>												
				<name>OSFRAC</name>											
				<description>Fractional part of the oversampling ratio, in units of 1/8th of an input clock period. (001 = 0.125, ..., 111 = 0.875)</description>											
				<bitRange>[3:1]</bitRange>											
			</field>												
			<field>												
				<name>OSINT</name>											
				<description>Integer part of the oversampling ratio, minus 1. The reset values equate to the normal operating mode of 16 input clocks per bit time.</description>											
				<bitRange>[7:4]</bitRange>											
			</field>												
			<field>												
				<name>FDINT</name>											
				<description>In Smart Card mode, these bits act as a more-significant extension of the OSint field, allowing an oversampling ratio up to 2048 as required by ISO7816-3. In Smart Card mode, bits 14:4 should initially be set to 371, yielding an oversampling ratio of 372.</description>											
				<bitRange>[14:8]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:15]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>HDEN</name>													
		<description>Half-duplex enable Register</description>													
		<addressOffset>0x040</addressOffset>													
		<access>read-write</access>													
		<resetValue>0</resetValue>													
		<resetMask>0x00000000</resetMask>													
		<fields>													
			<field>												
				<name>HDEN</name>											
				<description>Half-duplex mode enable</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Disable half-duplex mode.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. Enable half-duplex mode.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:1]</bitRange>											
										
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>SCICTRL</name>													
		<description>Smart card interface control register</description>													
		<addressOffset>0x048</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>SCIEN</name>											
				<description>Smart Card Interface Enable.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. Smart card interface disabled.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. synchronous half duplex smart card interface is enabled.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>NACKDIS</name>											
				<description>NACK response disable. Only applicable in T=0.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled. A NACK response is enabled.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled. A NACK response is inhibited.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>PROTSEL</name>											
				<description>Protocol selection as defined in the ISO7816-3 standard.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>T_EQ_0</name>									
						<description>T = 0</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>T_EQ_1</name>									
						<description>T = 1</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[4:3]</bitRange>											
										
