cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>RS485ADRMATCH</name>													
		<description>RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode.</description>													
		<addressOffset>0x050</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>ADRMATCH</name>											
				<description>Contains the address match value.</description>											
				<bitRange>[7:0]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved</description>											
				<bitRange>[31:8]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>RS485DLY</name>													
		<description>RS-485/EIA-485 direction control delay.</description>													
		<addressOffset>0x054</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>DLY</name>											
				<description>Contains the direction control delay value. This register works in conjunction with an 8-bit counter.</description>											
				<bitRange>[7:0]</bitRange>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:8]</bitRange>											
			</field>												
		</fields>													
	</register>														
	<register>														
		<name>SYNCCTRL</name>													
		<description>Synchronous mode control register.</description>													
		<addressOffset>0x058</addressOffset>													
		<access>read-write</access>													
		<resetValue>0x00</resetValue>													
		<resetMask>0xFFFFFFFF</resetMask>													
		<fields>													
			<field>												
				<name>SYNC</name>											
				<description>Enables synchronous mode.</description>											
				<bitRange>[0:0]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>DISABLED</name>									
						<description>Disabled.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>ENABLED</name>									
						<description>Enabled.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>CSRC</name>											
				<description>Clock source select.</description>											
				<bitRange>[1:1]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>SLAVE_MODE</name>									
						<description>Slave mode. Synchronous slave mode (SCLK in)</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>MASTER_MODE</name>									
						<description>Master mode. Synchronous master mode (SCLK out)</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>FES</name>											
				<description>Edge sampling.</description>											
				<bitRange>[2:2]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>RISING</name>									
						<description>Rising. RxD is sampled on the rising edge of SCLK.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>FALLING</name>									
						<description>Falling. RxD is sampled on the falling edge of SCLK.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>TSBYPASS</name>											
				<description>Transmit synchronization bypass in synchronous slave mode.</description>											
				<bitRange>[3:3]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>SYNCHRONIZED</name>									
						<description>Synchronized. The input clock is synchronized prior to being used in clock edge detection logic.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>NOT_SYNCHRONIZED</name>									
						<description>Not synchronized. The input clock is not synchronized prior to being used in clock edge detection logic. This allows for a high er input clock rate at the expense of potential metastability.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>CSCEN</name>											
				<description>Continuous master clock enable (used only when CSRC is 1)</description>											
				<bitRange>[4:4]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>ON_CHARACTER</name>									
						<description>On character. SCLK cycles only when characters are being sent on TxD.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>CONTINUOUSLY</name>									
						<description>Continuously. SCLK runs continuously (characters can be received on RxD independently from transmission on TxD).</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>SSSDIS</name>											
				<description>Start/stop bits</description>											
				<bitRange>[5:5]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>SEND</name>									
						<description>Send. Send start and stop bits as in other modes.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>DO_NOT_SEND</name>									
						<description>Do not send. Do not send start/stop bits.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>CCCLR</name>											
				<description>Continuous clock clear</description>											
				<bitRange>[6:6]</bitRange>											
				<enumeratedValues>											
				<name>ENUM</name>											
					<enumeratedValue>										
						<name>SOFTWARE</name>									
						<description>Software. CSCEN is under software control.</description>									
						<value>0</value>									
					</enumeratedValue>										
					<enumeratedValue>										
						<name>HARDWARE</name>									
						<description>Hardware. Hardware clears CSCEN after each character is received.</description>									
						<value>1</value>									
					</enumeratedValue>										
				</enumeratedValues>											
			</field>												
			<field>												
				<name>RESERVED</name>											
				<description>Reserved. The value read from a reserved bit is not defined.</description>											
				<bitRange>[31:7]</bitRange>											
										
