cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>										
		</fields>											
	</register>												
	<register>												
		<name>CTCR</name>											
		<description>Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>											
		<addressOffset>0x070</addressOffset>											
		<access>read-write</access>											
		<resetValue>0</resetValue>											
		<resetMask>0xFFFFFFFF</resetMask>											
		<fields>											
			<field>										
				<name>CTMODE</name>									
				<description>Counter/Timer Mode This field selects which rising PCLK edges can increment Timer's Prescale Counter (PC), or clear PC and increment Timer Counter (TC). Timer Mode: the TC is incremented when the Prescale Counter matches the Prescale Register.</description>									
				<bitRange>[1:0]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>TIMER_MODE</name>							
						<description>Timer Mode. Counts every rising PCLK edge</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>COUNTER_MODE_RISING</name>							
						<description>Counter Mode rising edge. TC is incremented on rising edges on the CAP input selected by bits 3:2.</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>COUNTER_MODE_FALLING</name>							
						<description>Counter Mode falling edge. TC is incremented on falling edges on the CAP input selected by bits 3:2.</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>COUNTER_MODE_EDGES</name>							
						<description>Counter Mode edges. TC is incremented on both edges on the CAP input selected by bits 3:2.</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>CINSEL</name>									
				<description>Count Input Select When bits 1:0 in this register are not 00, these bits select which CAP pin is sampled for clocking. Note: If Counter mode is selected for a particular CAPn input in the TnCTCR, the 3 bits for that input in the Capture Control Register (TnCCR) must be programmed as 000. However, capture and/or interrupt can be selected for the other 3 CAPn inputs in the same timer.</description>									
				<bitRange>[3:2]</bitRange>									
				<enumeratedValues>									
				<name>ENUM</name>									
					<enumeratedValue>								
						<name>CAP0</name>							
						<description>CAP0. CAPn.0 for TIMERn</description>							
						<value>0x0</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>CAP1</name>							
						<description>CAP1. CAPn.1 for TIMERn</description>							
						<value>0x1</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>CAP2</name>							
						<description>CAP2. CAPn.2 for TIMERn</description>							
						<value>0x2</value>							
					</enumeratedValue>								
					<enumeratedValue>								
						<name>CAP3</name>							
						<description>CAP3. CAPn.3 for TIMERn</description>							
						<value>0x3</value>							
					</enumeratedValue>								
				</enumeratedValues>									
			</field>										
			<field>										
				<name>RESERVED</name>									
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>									
				<bitRange>[31:4]</bitRange>									
								
			</field>										
		</fields>											
	</register>												
</registers>													
										
												
												
												
												

		</peripheral>

		<peripheral derivedFrom="TIMER0">
			<name>TIMER1</name>
			<baseAddress>0x40085000</baseAddress>
			<interrupt>
				<name>TIMER1</name>
				<value>13</value>

			</interrupt>
		</peripheral>

		<peripheral derivedFrom="TIMER0">
			<name>TIMER2</name>
			<baseAddress>0x400C3000</baseAddress>
			<interrupt>
				<name>TIMER2</name>
				<value>14</value>

			</interrupt>
		</peripheral>

		<peripheral derivedFrom="TIMER0">
			<name>TIMER3</name>
			<baseAddress>0x400C4000</baseAddress>
			<interrupt>
				<name>TIMER3</name>
				<value>15</value>

			</interrupt>
		</peripheral>
		<peripheral>
			<name>SCU</name>
			<description>System Control Unit (SCU) I/O configuration </description>
			<groupName>SCU</groupName>
			<baseAddress>0x40086000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<dim>2</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-1</dimIndex>
					<name>SFSP0_%s</name>
					<description>Pin configuration register for pins P0</description>
					<addressOffset>0x000</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>						
						<field>					
							<name>MODE</name>				
							<description>Select pin function.</description>				
							<bitRange>[2:0]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>FUNCTION_0_DEFAULT</name>		
									<description>Function 0 (default)</description>		
									<value>0x0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_1</name>		
									<description>Function 1</description>		
									<value>0x1</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_2</name>		
									<description>Function 2</description>		
									<value>0x2</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_3</name>		
									<description>Function 3</description>		
									<value>0x3</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_4</name>		
									<description>Function 4</description>		
									<value>0x4</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_5</name>		
									<description>Function 5</description>		
									<value>0x5</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_6</name>		
									<description>Function 6</description>		
									<value>0x6</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_7</name>		
									<description>Function 7</description>		
									<value>0x7</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>EPD</name>				
							<description>Enable pull-down resistor at pad.</description>				
							<bitRange>[3:3]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>DISABLE_PULL_DOWN</name>		
									<description>Disable pull-down.</description>		
									<value>0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>ENABLE_PULL_DOWN</name>		
									<description>Enable pull-down.Enable both pull-down resistor and pull-up resistor for repeater mode.</description>		
									<value>1</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>EPUN</name>				
							<description>Disable pull-up resistor at pad. By default, the pull-up resistor is enabled at reset.</description>				
							<bitRange>[4:4]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>ENABLE_PULL_UP</name>		
									<description>Enable pull-up. Enable both pull-down resistor and pull-up resistor for repeater mode.</description>		
									<value>0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>DISABLE_PULL_UP</name>		
									<description>Disable pull-up.</description>		
									<value>1</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>EHS</name>				
							<description>Select Slew rate.</description>				
							<bitRange>[5:5]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>SLOW_LOW_NOISE_WITH</name>		
									<description>Slow (low noise with medium speed)</description>		
									<value>0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FAST_MEDIUM_NOISE_W</name>		
									<description>Fast (medium noise with fast speed)</description>		
									<value>1</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>EZI</name>				
							<description>Input buffer enable. The input buffer is disabled by default at reset and must be enabled for receiving.</description>				
							<bitRange>[6:6]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>DISABLE_INPUT_BUFFER</name>		
									<description>Disable input buffer</description>		
									<value>0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>ENABLE_INPUT_BUFFER</name>		
									<description>Enable input buffer</description>		
									<value>1</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>ZIF</name>				
							<description>Input glitch filter. Disable the input glitch filter for clocking signals higher than 30 MHz.</description>				
							<bitRange>[7:7]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>ENABLE_INPUT_GLITCH</name>		
									<description>Enable input glitch filter</description>		
									<value>0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>DISABLE_INPUT_GLITCH</name>		
									<description>Disable input glitch filter</description>		
									<value>1</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>RESERVED</name>				
							<description>Reserved</description>				
							<bitRange>[31:8]</bitRange>				
									
