cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
						</field>					
					</fields>						
					
				</register>
				<register>
					<dim>17</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>0-16</dimIndex>
					<name>SFSP1_%s</name>
					<description>Pin configuration register for pins P1</description>
					<addressOffset>0x080</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>						
						<field>					
							<name>MODE</name>				
							<description>Select pin function.</description>				
							<bitRange>[2:0]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>FUNCTION_0_DEFAULT</name>		
									<description>Function 0 (default)</description>		
									<value>0x0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_1</name>		
									<description>Function 1</description>		
									<value>0x1</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_2</name>		
									<description>Function 2</description>		
									<value>0x2</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_3</name>		
									<description>Function 3</description>		
									<value>0x3</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_4</name>		
									<description>Function 4</description>		
									<value>0x4</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_5</name>		
									<description>Function 5</description>		
									<value>0x5</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_6</name>		
									<description>Function 6</description>		
									<value>0x6</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FUNCTION_7</name>		
									<description>Function 7</description>		
									<value>0x7</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>EPD</name>				
							<description>Enable pull-down resistor at pad.</description>				
							<bitRange>[3:3]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>DISABLE_PULL_DOWN</name>		
									<description>Disable pull-down.</description>		
									<value>0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>ENABLE_PULL_DOWN</name>		
									<description>Enable pull-down.Enable both pull-down resistor and pull-up resistor for repeater mode.</description>		
									<value>1</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>EPUN</name>				
							<description>Disable pull-up resistor at pad. By default, the pull-up resistor is enabled at reset.</description>				
							<bitRange>[4:4]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>ENABLE_PULL_UP</name>		
									<description>Enable pull-up. Enable both pull-down resistor and pull-up resistor for repeater mode.</description>		
									<value>0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>DISABLE_PULL_UP</name>		
									<description>Disable pull-up.</description>		
									<value>1</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>EHS</name>				
							<description>Select Slew rate.</description>				
							<bitRange>[5:5]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>SLOW_LOW_NOISE_WITH</name>		
									<description>Slow (low noise with medium speed)</description>		
									<value>0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>FAST_MEDIUM_NOISE_W</name>		
									<description>Fast (medium noise with fast speed)</description>		
									<value>1</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>EZI</name>				
							<description>Input buffer enable. The input buffer is disabled by default at reset and must be enabled for receiving.</description>				
							<bitRange>[6:6]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>DISABLE_INPUT_BUFFER</name>		
									<description>Disable input buffer</description>		
									<value>0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>ENABLE_INPUT_BUFFER</name>		
									<description>Enable input buffer</description>		
									<value>1</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>ZIF</name>				
							<description>Input glitch filter. Disable the input glitch filter for clocking signals higher than 30 MHz.</description>				
							<bitRange>[7:7]</bitRange>				
							<enumeratedValues>				
								<name>ENUM</name>				
								<enumeratedValue>			
									<name>ENABLE_INPUT_GLITCH</name>		
									<description>Enable input glitch filter</description>		
									<value>0</value>		
								</enumeratedValue>			
								<enumeratedValue>			
									<name>DISABLE_INPUT_GLITCH</name>		
									<description>Disable input glitch filter</description>		
									<value>1</value>		
								</enumeratedValue>			
							</enumeratedValues>				
						</field>					
						<field>					
							<name>RESERVED</name>				
							<description>Reserved</description>				
							<bitRange>[31:8]</bitRange>				
							
						</field>					
					</fields>
				</register>
				<register>
					
					<name>SFSP1_17</name>
					<description>Pin configuration register for pins P1_17</description>
					<addressOffset>0x0C4</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>							
						<field>						
							<name>MODE</name>					
							<description>Select pin function.</description>					
							<bitRange>[2:0]</bitRange>					
							<enumeratedValues>					
								<name>ENUM</name>					
								<enumeratedValue>				
									<name>FUNCTION_0_DEFAULT</name>			
									<description>Function 0 (default)</description>			
									<value>0x0</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_1</name>			
									<description>Function 1</description>			
									<value>0x1</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_2</name>			
									<description>Function 2</description>			
									<value>0x2</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_3</name>			
									<description>Function 3</description>			
									<value>0x3</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_4</name>			
									<description>Function 4</description>			
									<value>0x4</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_5</name>			
									<description>Function 5</description>			
									<value>0x5</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_6</name>			
									<description>Function 6</description>			
									<value>0x6</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_7</name>			
									<description>Function 7</description>			
									<value>0x7</value>			
								</enumeratedValue>				
							</enumeratedValues>					
						</field>						
						<field>						
							<name>EPD</name>					
							<description>Enable pull-down resistor at pad.</description>					
							<bitRange>[3:3]</bitRange>					
							<enumeratedValues>					
								<name>ENUM</name>					
								<enumeratedValue>				
									<name>DISABLE_PULL_DOWN</name>			
									<description>Disable pull-down.</description>			
									<value>0</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>ENABLE_PULL_DOWN</name>			
									<description>Enable pull-down. Enable both pull-down resistor and pull-up resistor for repeater mode.</description>			
									<value>1</value>			
								</enumeratedValue>				
							</enumeratedValues>					
						</field>						
						<field>						
							<name>EPUN</name>					
							<description>Disable pull-up resistor at pad. By default, the pull-up resistor is enabled at reset.</description>					
							<bitRange>[4:4]</bitRange>					
							<enumeratedValues>					
								<name>ENUM</name>					
								<enumeratedValue>				
									<name>ENABLE_PULL_UP</name>			
									<description>Enable pull-up. Enable both pull-down resistor and pull-up resistor for repeater mode.</description>			
									<value>0</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>DISABLE_PULL_UP</name>			
									<description>Disable pull-up</description>			
									<value>1</value>			
								</enumeratedValue>				
							</enumeratedValues>					
						</field>						
						<field>						
							<name>RESERVED</name>					
							<description>Reserved</description>					
							<bitRange>[5:5]</bitRange>					
											
