cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
						</field>					
					</fields>
				</register>
				
				<register>
					<dim>3</dim>
					<dimIncrement>0x4</dimIncrement>
					<dimIndex>1-3</dimIndex>
					<name>SFSPA_%s</name>
					<description>Pin configuration register for pins PA</description>
					<addressOffset>0x504</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>							
						<field>						
							<name>MODE</name>					
							<description>Select pin function.</description>					
							<bitRange>[2:0]</bitRange>					
							<enumeratedValues>					
								<name>ENUM</name>					
								<enumeratedValue>				
									<name>FUNCTION_0_DEFAULT</name>			
									<description>Function 0 (default)</description>			
									<value>0x0</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_1</name>			
									<description>Function 1</description>			
									<value>0x1</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_2</name>			
									<description>Function 2</description>			
									<value>0x2</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_3</name>			
									<description>Function 3</description>			
									<value>0x3</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_4</name>			
									<description>Function 4</description>			
									<value>0x4</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_5</name>			
									<description>Function 5</description>			
									<value>0x5</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_6</name>			
									<description>Function 6</description>			
									<value>0x6</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>FUNCTION_7</name>			
									<description>Function 7</description>			
									<value>0x7</value>			
								</enumeratedValue>				
							</enumeratedValues>					
						</field>						
						<field>						
							<name>EPD</name>					
							<description>Enable pull-down resistor at pad.</description>					
							<bitRange>[3:3]</bitRange>					
							<enumeratedValues>					
								<name>ENUM</name>					
								<enumeratedValue>				
									<name>DISABLE_PULL_DOWN</name>			
									<description>Disable pull-down.</description>			
									<value>0</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>ENABLE_PULL_DOWN</name>			
									<description>Enable pull-down. Enable both pull-down resistor and pull-up resistor for repeater mode.</description>			
									<value>1</value>			
								</enumeratedValue>				
							</enumeratedValues>					
						</field>						
						<field>						
							<name>EPUN</name>					
							<description>Disable pull-up resistor at pad. By default, the pull-up resistor is enabled at reset.</description>					
							<bitRange>[4:4]</bitRange>					
							<enumeratedValues>					
								<name>ENUM</name>					
								<enumeratedValue>				
									<name>ENABLE_PULL_UP</name>			
									<description>Enable pull-up. Enable both pull-down resistor and pull-up resistor for repeater mode.</description>			
									<value>0</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>DISABLE_PULL_UP</name>			
									<description>Disable pull-up</description>			
									<value>1</value>			
								</enumeratedValue>				
							</enumeratedValues>					
						</field>						
						<field>						
							<name>RESERVED</name>					
							<description>Reserved</description>					
							<bitRange>[5:5]</bitRange>					
							
						</field>						
						<field>						
							<name>EZI</name>					
							<description>Input buffer enable. The input buffer is disabled by default at reset but must be enabled to transfer data from the I/O buffer to the pad.</description>					
							<bitRange>[6:6]</bitRange>					
							<enumeratedValues>					
								<name>ENUM</name>					
								<enumeratedValue>				
									<name>DISABLE_INPUT_BUFFER</name>			
									<description>Disable input buffer</description>			
									<value>0</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>ENABLE_INPUT_BUFFER</name>			
									<description>Enable input buffer</description>			
									<value>1</value>			
								</enumeratedValue>				
							</enumeratedValues>					
						</field>						
						<field>						
							<name>ZIF</name>					
							<description>Input glitch filter. Disable the input glitch filter for clocking signals higher than 30 MHz.</description>					
							<bitRange>[7:7]</bitRange>					
							<enumeratedValues>					
								<name>ENUM</name>					
								<enumeratedValue>				
									<name>ENABLE_INPUT_GLITCH</name>			
									<description>Enable input glitch filter</description>			
									<value>0</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>DISABLE_INPUT_GLITCH</name>			
									<description>Disable input glitch filter</description>			
									<value>1</value>			
								</enumeratedValue>				
							</enumeratedValues>					
						</field>						
						<field>						
							<name>EHD</name>					
							<description>Select drive strength.</description>					
							<bitRange>[9:8]</bitRange>					
							<enumeratedValues>					
								<name>ENUM</name>					
								<enumeratedValue>				
									<name>NORMAL_DRIVE_4_MA_D</name>			
									<description>Normal-drive: 4 mA drive strength</description>			
									<value>0x0</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>MEDIUM_DRIVE_8_MA_D</name>			
									<description>Medium-drive: 8 mA drive strength</description>			
									<value>0x1</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>HIGH_DRIVE_14_MA_DR</name>			
									<description>High-drive: 14 mA drive strength</description>			
									<value>0x2</value>			
								</enumeratedValue>				
								<enumeratedValue>				
									<name>ULTRA_HIGH_DRIVE_20</name>			
									<description>Ultra high-drive: 20 mA drive strength</description>			
									<value>0x3</value>			
								</enumeratedValue>				
							</enumeratedValues>					
						</field>						
						<field>						
							<name>RESERVED</name>					
							<description>Reserved</description>					
							<bitRange>[31:10]</bitRange>					
							
