cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>					
			<field>					
				<name>USB_EPWR</name>				
				<description>Power mode.</description>				
				<bitRange>[4:4]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>POWER_SAVING_MODE_S</name>		
						<description>Power saving mode (Suspend mode)</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>NORMAL_MODE</name>		
						<description>Normal mode</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>USB_VBUS</name>				
				<description>Enable the vbus_valid signal. This signal is monitored by the USB1 block. Use this bit for software de-bouncing of the VBUS sense signal or to indicate the VBUS state to the USB1 controller when the VBUS signal is present but the USB1_VBUS function is not connected in the SFSP2_5 register.  The setting of this bit has no effect if the USB1_VBUS function of pin P2_5 is enabled through the SFSP2_5 register.</description>				
				<bitRange>[5:5]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>VBUS_SIGNAL_LOW_OR_I</name>		
						<description>VBUS signal LOW or inactive</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>VBUS_SIGNAL_HIGH_OR</name>		
						<description>VBUS signal HIGH or active</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:6]</bitRange>				
			
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>SFSI2C0</name>						
		<description>Pin configuration register for I2C0-bus pins</description>						
		<addressOffset>0xC84</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>SCL_EFP</name>				
				<description>Select input glitch filter time constant for the SCL pin.</description>				
				<bitRange>[0:0]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>50_NS_GLITCH_FILTER</name>		
						<description>50 ns glitch filter</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>3_NS_GLITCH_FILTER</name>		
						<description>3 ns glitch filter</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved. Always write a 0 to this bit.</description>				
				<bitRange>[1:1]</bitRange>				
			
			</field>					
			<field>					
				<name>SCL_EHD</name>				
				<description>Select I2C mode for the SCL pin.</description>				
				<bitRange>[2:2]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>STANDARDFAST_MODE</name>		
						<description>Standard/Fast mode transmit</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>FAST_MODE_PLUS_TRANS</name>		
						<description>Fast-mode Plus transmit</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>SCL_EZI</name>				
				<description>Enable the input receiver for the SCL pin. Always write a 1 to this bit when using the I2C0.</description>				
				<bitRange>[3:3]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DISABLED</name>		
						<description>Disabled</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ENABLED</name>		
						<description>Enabled</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[6:4]</bitRange>				
			
			</field>					
			<field>					
				<name>SCL_ZIF</name>				
				<description>Enable or disable input glitch filter for the SCL pin. The filter time constant is determined by bit EFP.</description>				
				<bitRange>[7:7]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>ENABLE_INPUT_FILTER</name>		
						<description>Enable input filter</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>DISABLE_INPUT_FILTER</name>		
						<description>Disable input filter</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>SDA_EFP</name>				
				<description>Select input glitch filter time constant for the SDA pin.</description>				
				<bitRange>[8:8]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>50_NS_GLITCH_FILTER</name>		
						<description>50 ns glitch filter</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>3_NS_GLITCH_FILTER</name>		
						<description>3 ns glitch filter</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved. Always write a 0 to this bit.</description>				
				<bitRange>[9:9]</bitRange>				
			
			</field>					
			<field>					
				<name>SDA_EHD</name>				
				<description>Select I2C mode for the SDA pin.</description>				
				<bitRange>[10:10]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>STANDARDFAST_MODE</name>		
						<description>Standard/Fast mode transmit</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>FAST_MODE_PLUS_TRANS</name>		
						<description>Fast-mode Plus transmit</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>SDA_EZI</name>				
				<description>Enable the input receiver for the SDA pin. Always write a 1 to this bit when using the I2C0.</description>				
				<bitRange>[11:11]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DISABLED</name>		
						<description>Disabled</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ENABLED</name>		
						<description>Enabled</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[14:12]</bitRange>				
			
