cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>					
			<field>					
				<name>SDA_ZIF</name>				
				<description>Enable or disable input glitch filter for the SDA pin. The filter time constant is determined by bit SDA_EFP.</description>				
				<bitRange>[15:15]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>ENABLE_INPUT_FILTER</name>		
						<description>Enable input filter</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>DISABLE_INPUT_FILTER</name>		
						<description>Disable input filter</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved</description>				
				<bitRange>[31:16]</bitRange>				
			
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>ENAIO0</name>						
		<description>ADC0 function select register</description>						
		<addressOffset>0xC88</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>ADC0_0</name>				
				<description>Select ADC0_0</description>				
				<bitRange>[0:0]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin P4_3.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC0</name>		
						<description>Analog function ADC0_0 selected on pin P4_3</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC0_1</name>				
				<description>Select ADC0_1</description>				
				<bitRange>[1:1]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin P4_1.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC0</name>		
						<description>Analog function ADC0_1 selected on pin P4_1.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC0_2</name>				
				<description>Select ADC0_2</description>				
				<bitRange>[2:2]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PF_8.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC0</name>		
						<description>Analog function ADC0_2 selected on pin PF_8.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC0_3</name>				
				<description>Select ADC0_3</description>				
				<bitRange>[3:3]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin P7_5.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC0</name>		
						<description>Analog function ADC0_3 selected on pin P7_5.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC0_4</name>				
				<description>Select ADC0_4</description>				
				<bitRange>[4:4]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin P7_4.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC0</name>		
						<description>Analog function ADC0_4 selected on pin P7_4.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC0_5</name>				
				<description>Select ADC0_5</description>				
				<bitRange>[5:5]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PF_10.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC0</name>		
						<description>Analog function ADC0_5 selected on pin PF_10.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC0_6</name>				
				<description>Select ADC0_6</description>				
				<bitRange>[6:6]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PB_6.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC0</name>		
						<description>Analog function ADC0_6 selected on pin PB_6.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>ENAIO1</name>						
		<description>ADC1 function select register</description>						
		<addressOffset>0xC8C</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>ADC1_0</name>				
				<description>Select ADC1_0</description>				
				<bitRange>[0:0]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PC_3.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC1</name>		
						<description>Analog function ADC1_0 selected on pin PC_3.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC1_1</name>				
				<description>Select ADC1_1</description>				
				<bitRange>[1:1]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PC_0.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC1</name>		
						<description>Analog function ADC1_1 selected on pin PC_0.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC1_2</name>				
				<description>Select ADC1_2</description>				
				<bitRange>[2:2]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PF_9.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC1</name>		
						<description>Analog function ADC1_2 selected on pin PF_9.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC1_3</name>				
				<description>Select ADC1_3</description>				
				<bitRange>[3:3]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PF_6.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC1</name>		
						<description>Analog function ADC1_3 selected on pin PF_6.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC1_4</name>				
				<description>Select ADC1_4</description>				
				<bitRange>[4:4]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PF_5.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC1</name>		
						<description>Analog function ADC1_4 selected on pin PF_5.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC1_5</name>				
				<description>Select ADC1_5</description>				
				<bitRange>[5:5]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PF_11.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC1</name>		
						<description>Analog function ADC1_5 selected on pin PF_11.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC1_6</name>				
				<description>Select ADC1_6</description>				
				<bitRange>[6:6]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin P7_7.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC1</name>		
						<description>Analog function ADC1_6 selected on pin P7_7.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>ADC1_7</name>				
				<description>Select ADC1_7.</description>				
				<bitRange>[7:7]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PF_7.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_ADC1</name>		
						<description>Analog function ADC1_7 selected on pin PF_7.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>ENAIO2</name>						
		<description>Analog function select register</description>						
		<addressOffset>0xC90</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>DAC</name>				
				<description>Select DAC</description>				
				<bitRange>[0:0]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin P4_4.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>ANALOG_FUNCTION_DAC</name>		
						<description>Analog function DAC selected on pin P4_4.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>BG</name>				
				<description>Select band gap output. To measure the band gap, disable the pull-up on pin PF_7 and connect PF_7 to the digital pad. Do not use the digital pad nor the ADC1_7 on the board when measuring the band gap (see Section 15.4.8.1).</description>				
				<bitRange>[4:4]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>DIGITAL_FUNCTION_SEL</name>		
						<description>Digital function selected on pin PF_7.</description>		
						<value>0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>BAND_GAP_OUTPUT_SELE</name>		
						<description>Band gap output selected for pin PF_7.</description>		
						<value>1</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>EMCDELAYCLK</name>						
		<description>EMC clock delay register</description>						
		<addressOffset>0xD00</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>CLK_DELAY</name>				
				<description>EMC_CLKn SDRAM clock output delay. 0x0 = no delay 0x1111 approximately 0.5 ns delay 0x2222 approximately 1.0 ns delay 0x3333 approximately 1.5 ns delay 0x4444 approximately 2.0 ns delay 0x5555 approximately 2.5 ns delay 0x6666 approximately 3.0 ns delay 0x7777 approximately 3.5 ns delay</description>				
				<bitRange>[15:0]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved. Do not write ones to reserved register bits.</description>				
				<bitRange>[31:16]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>SDDELAY</name>						
		<description>SD/MMC sample and drive delay register</description>						
		<addressOffset>0xD80</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>SAMPLE_DELAY</name>				
				<description>SD/MMC sample delay. The delay value is SAMPLE_DELAY x 0.5 ns.</description>				
				<bitRange>[3:0]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved. Do not write ones to reserved register bits.</description>				
				<bitRange>[7:4]</bitRange>				
			</field>					
			<field>					
				<name>DRV_DELAY</name>				
				<description>SD/MMC drive delay. The delay value is DRV_DELAY x 0.5 ns. The values DRV_DELAY = 0 and DRV_DELAY = 1 are not allowed.</description>				
				<bitRange>[11:8]</bitRange>				
			</field>					
			<field>					
				<name>RESERVED</name>				
				<description>Reserved. Do not write ones to reserved register bits.</description>				
				<bitRange>[31:12]</bitRange>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>PINTSEL0</name>						
		<description>Pin interrupt select register for pin interrupts 0 to 3.</description>						
		<addressOffset>0xE00</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>INTPIN0</name>				
				<description>Pint interrupt 0: Select the pin number within the GPIO port selected by the PORTSEL0 bit in this register.</description>				
				<bitRange>[4:0]</bitRange>				
			
