cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>					
			<field>					
				<name>PORTSEL0</name>				
				<description>Pin interrupt 0: Select the port for the pin number to be selected in the INTPIN0 bits of this register.</description>				
				<bitRange>[7:5]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>GPIO_PORT_0</name>		
						<description>GPIO Port 0</description>		
						<value>0x0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_1</name>		
						<description>GPIO Port 1</description>		
						<value>0x1</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_2</name>		
						<description>GPIO Port 2</description>		
						<value>0x2</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_3</name>		
						<description>GPIO Port 3</description>		
						<value>0x3</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_4</name>		
						<description>GPIO Port 4</description>		
						<value>0x4</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_5</name>		
						<description>GPIO Port 5</description>		
						<value>0x5</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_6</name>		
						<description>GPIO Port 6</description>		
						<value>0x6</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_7</name>		
						<description>GPIO Port 7</description>		
						<value>0x7</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>INTPIN1</name>				
				<description>Pint interrupt 1: Select the pin number within the GPIO port selected by the PORTSEL1 bit in this register.</description>				
				<bitRange>[12:8]</bitRange>				
			
			</field>					
			<field>					
				<name>PORTSEL1</name>				
				<description>Pin interrupt 1: Select the port for the pin number to be selected in the INTPIN1 bits of this register.</description>				
				<bitRange>[15:13]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>GPIO_PORT_0</name>		
						<description>GPIO Port 0</description>		
						<value>0x0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_1</name>		
						<description>GPIO Port 1</description>		
						<value>0x1</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_2</name>		
						<description>GPIO Port 2</description>		
						<value>0x2</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_3</name>		
						<description>GPIO Port 3</description>		
						<value>0x3</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_4</name>		
						<description>GPIO Port 4</description>		
						<value>0x4</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_5</name>		
						<description>GPIO Port 5</description>		
						<value>0x5</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_6</name>		
						<description>GPIO Port 6</description>		
						<value>0x6</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_7</name>		
						<description>GPIO Port 7</description>		
						<value>0x7</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>INTPIN2</name>				
				<description>Pint interrupt 2: Select the pin number within the GPIO port selected by the PORTSEL2 bit in this register.</description>				
				<bitRange>[20:16]</bitRange>				
			
			</field>					
			<field>					
				<name>PORTSEL2</name>				
				<description>Pin interrupt 2: Select the port for the pin number to be selected in the INTPIN2 bits of this register.</description>				
				<bitRange>[23:21]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>GPIO_PORT_0</name>		
						<description>GPIO Port 0</description>		
						<value>0x0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_1</name>		
						<description>GPIO Port 1</description>		
						<value>0x1</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_2</name>		
						<description>GPIO Port 2</description>		
						<value>0x2</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_3</name>		
						<description>GPIO Port 3</description>		
						<value>0x3</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_4</name>		
						<description>GPIO Port 4</description>		
						<value>0x4</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_5</name>		
						<description>GPIO Port 5</description>		
						<value>0x5</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_6</name>		
						<description>GPIO Port 6</description>		
						<value>0x6</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_7</name>		
						<description>GPIO Port 7</description>		
						<value>0x7</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
			<field>					
				<name>INTPIN3</name>				
				<description>Pint interrupt 3: Select the pin number within the GPIO port selected by the PORTSEL3 bit in this register.</description>				
				<bitRange>[28:24]</bitRange>				
			
			</field>					
			<field>					
				<name>PORTSEL3</name>				
				<description>Pin interrupt 3: Select the port for the pin number to be selected in the INTPIN3 bits of this register.</description>				
				<bitRange>[31:29]</bitRange>				
				<enumeratedValues>				
				<name>ENUM</name>				
					<enumeratedValue>			
						<name>GPIO_PORT_0</name>		
						<description>GPIO Port 0</description>		
						<value>0x0</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_1</name>		
						<description>GPIO Port 1</description>		
						<value>0x1</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_2</name>		
						<description>GPIO Port 2</description>		
						<value>0x2</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_3</name>		
						<description>GPIO Port 3</description>		
						<value>0x3</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_4</name>		
						<description>GPIO Port 4</description>		
						<value>0x4</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_5</name>		
						<description>GPIO Port 5</description>		
						<value>0x5</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_6</name>		
						<description>GPIO Port 6</description>		
						<value>0x6</value>		
					</enumeratedValue>			
					<enumeratedValue>			
						<name>GPIO_PORT_7</name>		
						<description>GPIO Port 7</description>		
						<value>0x7</value>		
					</enumeratedValue>			
				</enumeratedValues>				
			</field>					
		</fields>						
	</register>							
	<register>							
		<name>PINTSEL1</name>						
		<description>Pin interrupt select register for pin interrupts 4 to 7.</description>						
		<addressOffset>0xE04</addressOffset>						
		<access>read-write</access>						
		<resetValue>0x00</resetValue>						
		<resetMask>0xFFFFFFFF</resetMask>						
		<fields>						
			<field>					
				<name>INTPIN4</name>				
				<description>Pint interrupt 4: Select the pin number within the GPIO port selected by the PORTSEL4 bit in this register.</description>				
				<bitRange>[4:0]</bitRange>				
			
