cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>CTIN_4_IN</name>															
		<description>SCT CTIN_4 capture input multiplexer (GIMA output 20)</description>															
		<addressOffset>0x050</addressOffset>															
		<access>read-write</access>															
		<resetValue>0</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>INV</name>													
				<description>Invert input</description>													
				<bitRange>[0:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>NOT_INVERTED</name>											
						<description>Not inverted.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>INPUT_INVERTED</name>											
						<description>Input inverted.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>EDGE</name>													
				<description>Enable rising edge detection</description>													
				<bitRange>[1:1]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>NO_EDGE_DETECTION</name>											
						<description>No edge detection.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>RISING_EDGE_DETECTIO</name>											
						<description>Rising edge detection enabled.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SYNCH</name>													
				<description>Enable   synchronization</description>													
				<bitRange>[2:2]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE__SYNCHRONIZ</name>											
						<description>Disable   synchronization.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE__SYNCHRONIZA</name>											
						<description>Enable   synchronization.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>PULSE</name>													
				<description>Enable single pulse generation.</description>													
				<bitRange>[3:3]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE_SINGLE_PULSE</name>											
						<description>Disable single pulse generation.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE_SINGLE_PULSE</name>											
						<description>Enable single pulse generation.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SELECT</name>													
				<description>Select input. Values 0x4 to 0xF are reserved.</description>													
				<bitRange>[7:4]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>CTIN_4</name>											
						<description>CTIN_4</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>USART0_RX_ACTIVE</name>											
						<description>USART0 RX active</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>_I2S1_RX_MWS1</name>											
						<description>- I2S1_RX_MWS1</description>											
						<value>0x2</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>_I2S1_TX_MWS1</name>											
						<description>- I2S1_TX_MWS1</description>											
						<value>0x3</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
												
			</field>														
		</fields>															
	</register>																
	<register>																
		<name>CTIN_5_IN</name>															
		<description>SCT CTIN_5 capture input multiplexer (GIMA output 21)</description>															
		<addressOffset>0x054</addressOffset>															
		<access>read-write</access>															
		<resetValue>0</resetValue>															
		<resetMask>0xFFFFFFFF</resetMask>															
		<fields>															
			<field>														
				<name>INV</name>													
				<description>Invert input</description>													
				<bitRange>[0:0]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>NOT_INVERTED</name>											
						<description>Not inverted.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>INPUT_INVERTED</name>											
						<description>Input inverted.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>EDGE</name>													
				<description>Enable rising edge detection</description>													
				<bitRange>[1:1]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>NO_EDGE_DETECTION</name>											
						<description>No edge detection.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>RISING_EDGE_DETECTIO</name>											
						<description>Rising edge detection enabled.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SYNCH</name>													
				<description>Enable   synchronization</description>													
				<bitRange>[2:2]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE__SYNCHRONIZ</name>											
						<description>Disable   synchronization.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE__SYNCHRONIZA</name>											
						<description>Enable   synchronization.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>PULSE</name>													
				<description>Enable single pulse generation.</description>													
				<bitRange>[3:3]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>DISABLE_SINGLE_PULSE</name>											
						<description>Disable single pulse generation.</description>											
						<value>0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>ENABLE_SINGLE_PULSE</name>											
						<description>Enable single pulse generation.</description>											
						<value>1</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>SELECT</name>													
				<description>Select input. Values 0x3 to 0xF are reserved.</description>													
				<bitRange>[7:4]</bitRange>													
				<enumeratedValues>													
				<name>ENUM</name>													
					<enumeratedValue>												
						<name>CTIN_5</name>											
						<description>CTIN_5</description>											
						<value>0x0</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>USART2_RX_ACTIVE</name>											
						<description>USART2 RX active</description>											
						<value>0x1</value>											
					</enumeratedValue>												
					<enumeratedValue>												
						<name>SGPIO12_DIV</name>											
						<description>SGPIO12_DIV</description>											
						<value>0x2</value>											
					</enumeratedValue>												
				</enumeratedValues>													
			</field>														
			<field>														
				<name>RESERVED</name>													
				<description>Reserved</description>													
				<bitRange>[31:8]</bitRange>													
												
