cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
	</registers>
</peripheral>


<peripheral>
	<name>SGPIO</name>
	<description>Serial GPIO (SGPIO)</description>
	<groupName>SGPIO</groupName>
	<baseAddress>0x40101000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>SGPIO_IINT</name>
	<value>31</value>
	</interrupt>
	<registers>																							
	<register>																						
		<dim>16</dim>																					
		<dimIncrement>0x4</dimIncrement>																					
		<dimIndex>0-15</dimIndex>																					
		<name>OUT_MUX_CFG[%s]</name>																					
		<description>Pin multiplexer configuration registers.</description>																					
		<addressOffset>0x0000</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>P_OUT_CFG</name>																			
				<description>Output control of output SGPIOn. All other values are reserved.</description>																			
				<bitRange>[3:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DOUT_DOUTM1</name>																	
						<description>dout_doutm1 (1-bit mode)</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_DOUTM2A</name>																	
						<description>dout_doutm2a (2-bit mode 2a)</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_DOUTM2B</name>																	
						<description>dout_doutm2b (2-bit mode 2b)</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_DOUTM2C</name>																	
						<description>dout_doutm2c (2-bit mode 2c)</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>GPIO_OUT_LEVEL_SET</name>																	
						<description>gpio_out (level set by GPIO_OUTREG)</description>																	
						<value>0x4</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_DOUTM4A</name>																	
						<description>dout_doutm4a (4-bit mode 4a)</description>																	
						<value>0x5</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_DOUTM4B</name>																	
						<description>dout_doutm4b (4-bit mode 4b)</description>																	
						<value>0x6</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_DOUTM4C</name>																	
						<description>dout_doutm4c (4-bit mode 4c)</description>																	
						<value>0x7</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>CLK_OUT</name>																	
						<description>clk_out</description>																	
						<value>0x8</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_DOUTM8A</name>																	
						<description>dout_doutm8a (8-bit mode 8a)</description>																	
						<value>0x9</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_DOUTM8B</name>																	
						<description>dout_doutm8b (8-bit mode 8b)</description>																	
						<value>0xA</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_DOUTM8C</name>																	
						<description>dout_doutm8c (8-bit mode 8c)</description>																	
						<value>0xB</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>P_OE_CFG</name>																			
				<description>Output enable source. All other values are reserved.</description>																			
				<bitRange>[6:4]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>GPIO_OE_STATE_SET_B</name>																	
						<description>gpio_oe (state set by GPIO_OEREG)</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_OEM1_1_BIT_MOD</name>																	
						<description>dout_oem1 (1-bit mode)</description>																	
						<value>0x4</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_OEM2_2_BIT_MOD</name>																	
						<description>dout_oem2 (2-bit mode)</description>																	
						<value>0x5</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_OEM4_4_BIT_MOD</name>																	
						<description>dout_oem4 (4-bit mode)</description>																	
						<value>0x6</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DOUT_OEM8_8_BIT_MOD</name>																	
						<description>dout_oem8 (8-bit mode)</description>																	
						<value>0x7</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:7]</bitRange>																			
																					
