cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<dim>16</dim>																					
		<dimIncrement>0x4</dimIncrement>																					
		<dimIndex>0-15</dimIndex>																					
		<name>SGPIO_MUX_CFG[%s]</name>																					
		<description>SGPIO multiplexer configuration registers.</description>																					
		<addressOffset>0x0040</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>EXT_CLK_ENABLE</name>																			
				<description>Select clock signal.</description>																			
				<bitRange>[0:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>INTERNAL_CLOCK_SIGNA</name>																	
						<description>Internal clock signal (slice)</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>EXTERNAL_CLOCK_SIGNA</name>																	
						<description>External clock signal (pin)</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>CLK_SOURCE_PIN_MODE</name>																			
				<description>Select source clock pin.</description>																			
				<bitRange>[2:1]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>SGPIO8</name>																	
						<description>SGPIO8</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SGPIO9</name>																	
						<description>SGPIO9</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SGPIO10</name>																	
						<description>SGPIO10</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SGPIO11</name>																	
						<description>SGPIO11</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>CLK_SOURCE_SLICE_MODE</name>																			
				<description>Select clock source slice. Note that slices D, H, O and P do not support this mode.</description>																			
				<bitRange>[4:3]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>SLICE_D</name>																	
						<description>Slice D</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SLICE_H</name>																	
						<description>Slice H</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SLICE_O</name>																	
						<description>Slice O</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SLICE_P</name>																	
						<description>Slice P</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>QUALIFIER_MODE</name>																			
				<description>Select qualifier mode.</description>																			
				<bitRange>[6:5]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>ENABLE</name>																	
						<description>Enable</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DISABLE</name>																	
						<description>Disable</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SLICE_SEE_BITS_QUAL</name>																	
						<description>Slice (see bits QUALIFIER_SLICE_MODE in this register)</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>EXTERNAL_SGPIO_PIN</name>																	
						<description>External SGPIO pin (SGPIO8, SGPIO9, SGPIO10, or SGPIO11)</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>QUALIFIER_PIN_MODE</name>																			
				<description>Select qualifier pin.</description>																			
				<bitRange>[8:7]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>SGPIO8</name>																	
						<description>SGPIO8</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SGPIO9</name>																	
						<description>SGPIO9</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SGPIO10</name>																	
						<description>SGPIO10</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SGPIO11</name>																	
						<description>SGPIO11</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>QUALIFIER_SLICE_MODE</name>																			
				<description>Select qualifier slice.</description>																			
				<bitRange>[10:9]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>SLICE_A</name>																	
						<description>Slice A, but for slice A slice D is used.</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SLICE_H</name>																	
						<description>Slice H, but for slice H slice O is used.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SLICE_I</name>																	
						<description>Slice I, but for slice I slice D is used.</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SLICE_P</name>																	
						<description>Slice P, but for slice P slice O is used.</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>CONCAT_ENABLE</name>																			
				<description>Enable concatenation.</description>																			
				<bitRange>[11:11]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>EXTERNAL_DATA_PIN</name>																	
						<description>External data pin</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>CONCATENATE_DATA</name>																	
						<description>Concatenate data</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>CONCAT_ORDER</name>																			
				<description>Select concatenation order</description>																			
				<bitRange>[13:12]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>SELF_LOOP</name>																	
						<description>Self-loop</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>2_SLICES</name>																	
						<description>2 slices</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>4_SLICES</name>																	
						<description>4 slices</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>8_SLICES</name>																	
						<description>8 slices</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved</description>																			
				<bitRange>[31:14]</bitRange>																			
																			
