cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<dim>16</dim>																					
		<dimIncrement>0x4</dimIncrement>																					
		<dimIndex>0-15</dimIndex>																					
		<name>SLICE_MUX_CFG[%s]</name>																					
		<description>Slice multiplexer configuration registers.</description>																					
		<addressOffset>0x0080</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>MATCH_MODE</name>																			
				<description>Match mode. Selects whether the match filter is active or whether data is captured.</description>																			
				<bitRange>[0:0]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DO_NOT_MATCH_DATA</name>																	
						<description>Do not match data.</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>MATCH_DATA</name>																	
						<description>Match data.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>CLK_CAPTURE_MODE</name>																			
				<description>Capture clock mode</description>																			
				<bitRange>[1:1]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>USE_RISING_CLOCK_EDG</name>																	
						<description>Use rising clock edge.</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>USE_FALLING_CLOCK_ED</name>																	
						<description>Use falling clock edge.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>CLKGEN_MODE</name>																			
				<description>Clock generation mode. Selects the clock generated by the slice counter or by an external pin or other slice as shift clock.</description>																			
				<bitRange>[2:2]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>USE_CLOCK_INTERNALLY</name>																	
						<description>Use clock internally generated by COUNTER.</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>USE_EXTERNAL_CLOCK_F</name>																	
						<description>Use external clock from a pin or other slice.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>INV_OUT_CLK</name>																			
				<description>Invert output clock</description>																			
				<bitRange>[3:3]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>NORMAL_CLOCK</name>																	
						<description>Normal clock.</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>INVERTED_CLOCK</name>																	
						<description>Inverted clock.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>DATA_CAPTURE_MODE</name>																			
				<description>Condition for input bit match interrupt</description>																			
				<bitRange>[5:4]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>DETECT_RISING_EDGE</name>																	
						<description>Detect rising edge.</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DETECT_FALLING_EDGE</name>																	
						<description>Detect falling edge.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DETECT_LOW_LEVEL</name>																	
						<description>Detect LOW level.</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>DETECT_HIGH_LEVEL</name>																	
						<description>Detect HIGH level.</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>PARALLEL_MODE</name>																			
				<description>Parallel mode</description>																			
				<bitRange>[7:6]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>SHIFT_1_BIT_PER_CLOC</name>																	
						<description>Shift 1 bit per clock.</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SHIFT_2_BITS_PER_CLO</name>																	
						<description>Shift 2 bits per clock.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SHIFT_4_BITS_PER_CLO</name>																	
						<description>Shift 4 bits per clock.</description>																	
						<value>0x2</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>SHIFT_1_BYTE_PER_CLO</name>																	
						<description>Shift 1 byte per clock.</description>																	
						<value>0x3</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>INV_QUALIFIER</name>																			
				<description>Inversion qualifier</description>																			
				<bitRange>[8:8]</bitRange>																			
				<enumeratedValues>																			
				<name>ENUM</name>																			
					<enumeratedValue>																		
						<name>USE_NORMAL_QUALIFIER</name>																	
						<description>Use normal qualifier.</description>																	
						<value>0x0</value>																	
					</enumeratedValue>																		
					<enumeratedValue>																		
						<name>USE_INVERTED_QUALIFI</name>																	
						<description>Use inverted qualifier.</description>																	
						<value>0x1</value>																	
					</enumeratedValue>																		
				</enumeratedValues>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:9]</bitRange>																			
																					
