cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<dim>16</dim>																					
		<dimIncrement>0x4</dimIncrement>																					
		<dimIndex>0-15</dimIndex>																					
		<name>REG[%s]</name>																					
		<description>Slice data registers. Each time COUNT0 reaches 0x0 the register shifts loading bit 31 with data captured from DIN(n). DOUT(n) is set to REG(0)</description>																					
		<addressOffset>0x00C0</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>REG</name>																			
				<description>At each active shift clock the register shifts right;  loading REG(31) with data captured from DIN(n) and  DOUT(n) is set to REG(0).</description>																			
				<bitRange>[31:0]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<dim>16</dim>																					
		<dimIncrement>0x4</dimIncrement>																					
		<dimIndex>0-15</dimIndex>																					
		<name>REG_SS[%s]</name>																					
		<description>Slice data shadow registers. Each time POS reaches 0x0 the contents of REG_SS is exchanged with the content of REG</description>																					
		<addressOffset>0x0100</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>REG_SS</name>																			
				<description>Each time POS reaches 0x0 the contents of REG_SS  is exchanged with the content of REG.</description>																			
				<bitRange>[31:0]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<dim>16</dim>																					
		<dimIncrement>0x4</dimIncrement>																					
		<dimIndex>0-15</dimIndex>																					
		<name>PRESET[%s]</name>																					
		<description>Reload value of COUNT0, loaded when COUNT0 reaches 0x0</description>																					
		<addressOffset>0x0140</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>PRESET</name>																			
				<description>Counter reload value; loaded when COUNT reaches  0x0.</description>																			
				<bitRange>[11:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:12]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<dim>16</dim>																					
		<dimIncrement>0x4</dimIncrement>																					
		<dimIndex>0-15</dimIndex>																					
		<name>COUNT[%s]</name>																					
		<description>Down counter, counts down each clock cycle.</description>																					
		<addressOffset>0x0180</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>COUNT</name>																			
				<description>Down counter, counts down each shift clock cycle.  Next count after 0x0 is PRESET.</description>																			
				<bitRange>[11:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:12]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<dim>16</dim>																					
		<dimIncrement>0x4</dimIncrement>																					
		<dimIndex>0-15</dimIndex>																					
		<name>POS[%s]</name>																					
		<description>Each time COUNT0 reaches 0x0 POS counts down.</description>																					
		<addressOffset>0x01C0</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>POS</name>																			
				<description>Each time COUNT reaches 0x0 POS counts down.</description>																			
				<bitRange>[7:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>POS_RESET</name>																			
				<description>Reload value for POS after POS reaches 0x0.</description>																			
				<bitRange>[15:8]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>MASK_A</name>																					
		<description>Mask for pattern match function of slice A</description>																					
		<addressOffset>0x0200</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>MASK_A</name>																			
				<description>Mask for pattern match function of slice A  0 = No effect. 1 = Mask this bit.</description>																			
				<bitRange>[31:0]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>MASK_H</name>																					
		<description>Mask for pattern match function of slice H</description>																					
		<addressOffset>0x0204</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>MASK_H</name>																			
				<description>Mask for pattern match function of slice H  0 = No effect. 1 = Mask this bit.</description>																			
				<bitRange>[31:0]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>MASK_I</name>																					
		<description>Mask for pattern match function of slice I</description>																					
		<addressOffset>0x0208</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>MASK_I</name>																			
				<description>Mask for pattern match function of slice I  0 = No effect . 1 = Mask this bit.</description>																			
				<bitRange>[31:0]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>MASK_P</name>																					
		<description>Mask for pattern match function of slice P</description>																					
		<addressOffset>0x020C</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>MASK_P</name>																			
				<description>Mask for pattern match function of slice P  0 = No effect. 1 = Mask this bit.</description>																			
				<bitRange>[31:0]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>GPIO_INREG</name>																					
		<description>GPIO input status register</description>																					
		<addressOffset>0x0210</addressOffset>																					
		<access>read-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>GPIO_INi</name>																			
				<description>Bit i reflects the input state of SGPIO pin i . 0 = LOW 1 = HIGH</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>GPIO_OUTREG</name>																					
		<description>GPIO output control register</description>																					
		<addressOffset>0x0214</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>GPIO_OUT</name>																			
				<description>GPIO output register. Bit i sets the output of SGPIO pin i. 0 = LOW 1 = HIGH</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>GPIO_OENREG</name>																					
		<description>GPIO OE control register</description>																					
		<addressOffset>0x0218</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>GPIO_OE</name>																			
				<description>Bit i selects the output enable state of SGPIO pin i. 0 = GPIO output i is tri-stated . 1 = GPIO output i is active.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CTRL_ENABLE</name>																					
		<description>Enables the slice COUNT counter</description>																					
		<addressOffset>0x021C</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CTRL_EN</name>																			
				<description>Slice count enable. Bit n controls slice n (0 = slice A, ..., 15 = slice P). 0 = Disables slice shift clock. 1 = Starts COUNTn or external shift clock.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CTRL_DISABLE</name>																					
		<description>Disables the slice POS counter</description>																					
		<addressOffset>0x0220</addressOffset>																					
		<access>read-write</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CTRL_DIS</name>																			
				<description>Slice count disable. Bit n controls slice n, (0 = slice A, ..., 15 = slice P). 0 = Enables COUNT and POS counters. The counters start counting when the CTRL_EN bit or bits are set in the CTRL_ENABLED register. 1 = Disables POS counter of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CLR_EN_0</name>																					
		<description>Shift clock interrupt clear mask</description>																					
		<addressOffset>0x0F00</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CLR_SCI</name>																			
				<description>1 = Shift clock interrupt clear mask of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>SET_EN_0</name>																					
		<description>Shift clock interrupt set mask</description>																					
		<addressOffset>0x0F04</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>SET_SCI</name>																			
				<description>1 = Shift clock interrupt set mask of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>ENABLE_0</name>																					
		<description>Shift clock interrupt enable</description>																					
		<addressOffset>0x0F08</addressOffset>																					
		<access>read-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>ENABLE_SCI</name>																			
				<description>1 = Shift clock interrupt enable of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>STATUS_0</name>																					
		<description>Shift clock interrupt status</description>																					
		<addressOffset>0x0F0C</addressOffset>																					
		<access>read-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>STATUS_SCI</name>																			
				<description>Shift clock interrupt status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CLR_STATUS_0</name>																					
		<description>Shift clock interrupt clear status</description>																					
		<addressOffset>0x0F10</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CLR_STATUS_SCI</name>																			
				<description>Shift clock interrupt clear status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>SET_STATUS_0</name>																					
		<description>Shift clock interrupt set status</description>																					
		<addressOffset>0x0F14</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>SET_STATUS_SCI</name>																			
				<description>Shift clock interrupt set status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CLR_EN_1</name>																					
		<description>Exchange clock interrupt clear mask</description>																					
		<addressOffset>0x0F20</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CLR_EN_CCI</name>																			
				<description>1 = Exchange clock interrupt clear mask of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>SET_EN_1</name>																					
		<description>Exchange clock interrupt set mask</description>																					
		<addressOffset>0x0F24</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>SET_EN_CCI</name>																			
				<description>1 = Exchange clock interrupt set mask of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>ENABLE_1</name>																					
		<description>Exchange clock interrupt enable</description>																					
		<addressOffset>0x0F28</addressOffset>																					
		<access>read-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>ENABLE_CCI</name>																			
				<description>Exchange clock interrupt enable of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
