cmsis-svd/cmsis-svd/data/NXP/LPC43xx_43Sxx.svd
	<register>																						
		<name>STATUS_1</name>																					
		<description>Exchange clock interrupt status</description>																					
		<addressOffset>0x0F2C</addressOffset>																					
		<access>read-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>STATUS_CCI</name>																			
				<description>Exchange clock interrupt status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CLR_STATUS_1</name>																					
		<description>Exchange clock interrupt clear status</description>																					
		<addressOffset>0x0F30</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CLR_STATUS_CCI</name>																			
				<description>Exchange clock interrupt clear status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>SET_STATUS_1</name>																					
		<description>Exchange clock interrupt set status</description>																					
		<addressOffset>0x0F34</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>SET_STATUS_CCI</name>																			
				<description>Exchange clock interrupt set status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CLR_EN_2</name>																					
		<description>Pattern match interrupt clear mask</description>																					
		<addressOffset>0x0F40</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CLR_EN2_PMI</name>																			
				<description>1 = Match interrupt clear mask of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>SET_EN_2</name>																					
		<description>Pattern match interrupt set mask</description>																					
		<addressOffset>0x0F44</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>SET_EN_PMI</name>																			
				<description>1 = Match interrupt set mask of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>ENABLE_2</name>																					
		<description>Pattern match interrupt enable</description>																					
		<addressOffset>0x0F48</addressOffset>																					
		<access>read-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>ENABLE_PMI</name>																			
				<description>Match interrupt enable of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>STATUS_2</name>																					
		<description>Pattern match interrupt status</description>																					
		<addressOffset>0x0F4C</addressOffset>																					
		<access>read-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>STATUS_PMI</name>																			
				<description>Match interrupt status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CLR_STATUS_2</name>																					
		<description>Pattern match interrupt clear status</description>																					
		<addressOffset>0x0F50</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CLR_STATUS_PMI</name>																			
				<description>Match interrupt clear status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>SET_STATUS_2</name>																					
		<description>Pattern match interrupt set status</description>																					
		<addressOffset>0x0F54</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>SET_STATUS_PMI</name>																			
				<description>Match interrupt set status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CLR_EN_3</name>																					
		<description>Input interrupt clear mask</description>																					
		<addressOffset>0x0F60</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CLR_EN_INPI</name>																			
				<description>1 = Input interrupt clear mask of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>SET_EN_3</name>																					
		<description>Input bit match interrupt set mask</description>																					
		<addressOffset>0x0F64</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>SET_EN_INPI</name>																			
				<description>1 = Input interrupt set mask of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>ENABLE_3</name>																					
		<description>Input bit match interrupt enable</description>																					
		<addressOffset>0x0F68</addressOffset>																					
		<access>read-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>ENABLE3_INPI</name>																			
				<description>Input interrupt enable of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>STATUS_3</name>																					
		<description>Input bit match interrupt status</description>																					
		<addressOffset>0x0F6C</addressOffset>																					
		<access>read-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>STATUS_INPI</name>																			
				<description>Input interrupt status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>CLR_STATUS_3</name>																					
		<description>Input bit match interrupt clear status</description>																					
		<addressOffset>0x0F70</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>CLR_STATUS_INPI</name>																			
				<description>Input interrupt clear status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
	<register>																						
		<name>SET_STATUS_3</name>																					
		<description>Input bit match interrupt set status</description>																					
		<addressOffset>0x0F74</addressOffset>																					
		<access>write-only</access>																					
		<resetValue>0</resetValue>																					
		<resetMask>0xFFFFFFFF</resetMask>																					
		<fields>																					
			<field>																				
				<name>SET_STATUS_INPI</name>																			
				<description>Shift interrupt set status of slice n.</description>																			
				<bitRange>[15:0]</bitRange>																			
			</field>																				
			<field>																				
				<name>RESERVED</name>																			
				<description>Reserved.</description>																			
				<bitRange>[31:16]</bitRange>																			
			</field>																				
		</fields>																					
	</register>																						
</registers>																							

</peripheral>




	</peripherals>




</device>
